{"id":"42859037","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Technical Team Lead (remote, AWS)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":400000,"to":null,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong># # # About the Company # # #</strong></p> <p><strong>ClearScale LLC</strong> (headquarters: San Francisco, CA, USA) - <strong>AWS Premier Consulting Partner</strong>, has been offering a full range of professional cloud computing services for more than 10 years, including architecture design, DevOps automation, refactoring and cloud-native application development, integration, migration and support using the best advanced technologies. Our team of 100 + certified architects, engineers and developers has a serious experience of successful projects. We help large Fortune 500 companies, midsize businesses and Silicon Valley startups successfully implement ambitious and complex cloud projects to become industry leaders.</p> <p><strong>ClearScale</strong> is growing quickly and there is high demand for the services we provide. Clients come to us for our deep experience with Big Data, Containerization, Serverless Infrastructure, Microservices, IoT, Machine Learning, DevOps and more.</p> <p>Due to the growing new needs in the company, we are looking for a<strong> Technical Team Lead </strong>who likes to find solutions to complex problems.</p> <p>We work 100% remotely from various cities and countries. We trust each other, do not take shots of the screen, do not watch you through webcam and do not track your typing, as many others do. The professional reputation of engineers and developers in our community is of the highest value.</p> <p>This is a unique opportunity for you to make a big impact, enjoy competitive compensation, work on a wide variety of projects for clients across multiple industries, and work alongside some of the best minds in the cloud</p> <p><strong># # # Job Overview # # #</strong></p> <p>In this role, you will be on a dedicated software development team, helping build innovative proprietary software products. This is a tight-knit team with top-performers that are constantly innovating and expanding the capabilities of our software while maintaining process and writing clean code. It is a fun and driven team that often explores modern technologies. The team is looking for a lead developer to steer major projects and work on highly visible strategic priorities. Your work will directly influence software for some of the most revolutionary ideas in customer loyalty!</p> <p>Major responsibilities of the position are listed below. To perform the job successfully, the individual must be able to execute each essential duty satisfactorily.</p> <p><strong>Job Responsibilities:</strong></p> <ul> <li>Participate on pre-sale activities and helps CTO create and estimate proposals</li> <li>Lead projects, taking ownership of task assignments and deliverables (support risk assessment, cost and timing, dependence and impact on other solutions / projects)</li> <li>Design, build and deliver cloud computing solutions, hosted services and underlying software infrastructure</li> <li>Understand the domain, business requirements and resulting technical challenges – you should have an expert level in the technologies used for implementation (see “Required skills and experience”) and quickly become very knowledgeable in the problem domain and business cases</li> <li>Play an active role during the project requirements gathering, design and implementation, building out application components and unit/acceptance tests alongside your team</li> <li>Work on technical documentation (e.g. diagrams, architecture design and handover instructions and documents)</li> <li>Get to know your team: strengths, weaknesses, ambitions and personalities, making sure they understand the big picture and how important their work is to the team’s overall success</li> <li>Act as a communication proxy for your team and route important information to the appropriate people (team, CEO/CTO, Director of Development, PMs, clients)</li> <li>Be a leading participant in planning activities, internal and customer-facing design sessions, empowering team members and ensuring architectural integrity/consistency across subsystems</li> <li>Know the status of your team’s work, communicating schedule slip immediately to management and keeping track of technical debt, manage the team’s backlog, the daily activities, project status, provide QBO (tracking systems) time tracking audit on the hours in their projects at the end of each billing cycle.</li> <li>Manage a regular team code review process and ensure compliance with company policy, procedures, and standards.</li> <li>Escalates technical project issues and concerns to Project Manager and Director of Development.</li> </ul> <p>This position will report to CEO/CTO, Director of Development and PMs.</p> <p><strong># # # Description of candidate requirements # # #</strong></p> <p><strong>Requirements:</strong></p> <ul> <li><strong>At least 8 years of custom software application development experience using Java, Data, or/and NodeJS with 3-5 years as people manager, team lead or technical delivery manager</strong></li> <li><strong>At least 2 years of experience with AWS development stack and development lifecycle tooling</strong> (Lambda, API Gateway, EC2, S3, Code Deploy, etc). Alternative cloud platform (Azure or GCP) can be accepted</li> <li>Preference towards those candidates who have hands-on experience or solid theoretical background in <strong>Big Data, AI or ML domains</strong></li> <li><strong>Strong English: ability to carry on verbal discussion on technical matters (requirements, design negotiation, issue resolution)</strong></li> <li>Experience developing enterprise-scale serverless applications</li> <li>Strong leadership skills and mentoring skills</li> <li>Planning, designing, implementing and supporting technology applications</li> <li>Experience working in cross-functional teams</li> <li>Multitasking and prioritizing while ensuring deadlines are met with attention to detail</li> <li>Ability to think strategically about business needs, product and technical challenges in an enterprise environment</li> <li>Be familiar with different teamwork approaches and methodologies (Scrum, Agile, Waterfall), understand their applicability areas and shortcomings, and have an ability to apply appropriate practices to real projects</li> </ul> <p><strong>Desired Technical Certifications (not a must):</strong></p> <ul> <li>AWS Certified Solutions Architect (Associate / Professional)</li> <li>AWS Certified Data Analytics (Speciality)</li> <li>AWS Certified Developer (Associate)</li> </ul> <p><strong># # # We offer # # #</strong></p> <ul> <li>High compensation paid every two weeks in USD;</li> <li>Completely remote work: we trust our employees to work from anywhere they please;</li> <li>Very flexible schedule consisting of 40 hours per week, Slack for communication;</li> <li>Bureaucracy-free environment;</li> <li>We adore change-makers and creators so you&#39;ll be able to influence our processes;</li> <li>Highly skilled project teams that consists of senior level professionals;</li> <li>Wise projects rotation including ML, Big Data, IoT, fintech and healthcare;</li> <li>Paid AWS certifications</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Business Development"},{"name":"Leadership Skills"},{"name":"Agile Project Management"},{"name":"Team management"},{"name":"Software Development"},{"name":"Business English"},{"name":"AWS"},{"name":"Organization Skills"},{"name":"Analytical skills"},{"name":"Customer Needs Analysis"},{"name":"Java"},{"name":"Big Data"},{"name":"Node.js"},{"name":"ML"},{"name":"artificial intelligence"},{"name":"Tech Lead"},{"name":"Team Lead"},{"name":"technical delivery manager"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1574063","name":"ClearScale","url":"https://api.hh.ru/employers/1574063?host=hh.ru","alternate_url":"https://hh.ru/employer/1574063","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/7789.png","90":"https://hhcdn.ru/employer-logo/1091270.png","240":"https://hhcdn.ru/employer-logo/1091271.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1574063&host=hh.ru","trusted":true},"published_at":"2021-10-25T09:41:13+0300","created_at":"2021-10-25T09:41:13+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=42859037","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/42859037","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}