{"id":"43417132","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Java/Kotlin Developer (Qodana, Static Analysis Project)","insider_interview":null,"response_letter_required":true,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":220000,"to":null,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>At JetBrains, we have a passion for building the strongest, most effective developer tools in the world. Our tools are designed to give developers the freedom to grow, discover, and create.<br />Over 8 million of the world&#39;s most dynamic developers speed up their workflows using our products, which help them stay focused on code design and the big picture and allow them to deliver more creative and effective results.</p> <p>Qodana is a new product being added to the JetBrains Team Tools lineup. It is a powerful, flexible solution for monitoring code quality. The aim of the product is to identify and suggest fixes for bugs, security vulnerabilities, duplications, and imperfections in your codebase. Our product leverages the code development experience of JetBrains tools, and it can also be integrated with a variety of other products to enhance or reinforce their features.</p> <p>We are looking for a talented software engineer who is eager to take on complex challenges – from code analysis execution inside the IntelliJ platform to implementing AWS integration. Every team member has their own specialization, but we still expect everyone to have a deep understanding of the product as a whole. Every engineer at Qodana plays an essential role in forming the product vision and realizing each part of it. We value everyone’s opinions and active position as much as their ability to collaborate as part of the team.</p> <p><strong>What you will do:</strong></p> <ul> <li> <p>Develop complex solutions, working with them from idea to production.</p> </li> <li> <p>Ensure that all architectural and technological decisions are reasonable and justified.</p> </li> <li> <p>Collaborate with other team members to influence product strategy and direction.</p> </li> <li> <p>Design, write, and ship well-tested, reliable, and maintainable code.</p> </li> <li> <p>Learn from your coworkers and teach others through discussions and code reviews.</p> </li> <li> <p>Create new features from scratch and improve existing features based on research and feedback from users.</p> </li> </ul> <p><strong>Basic Qualifications:</strong></p> <ul> <li> <p>BA/BS degree in Computer Science or equivalent practical experience.</p> </li> <li> <p>At least 5 years of experience in Java/Kotlin development.</p> </li> <li> <p>Have a strong understanding of data structures and algorithms.</p> </li> <li> <p>Have strong teamwork skills, be open to diverse opinions, and be able to support your points with sound reasoning.</p> </li> </ul> <p><strong>Bonus Qualifications:</strong></p> <ul> <li> <p>Experience in performance optimization and profiling.</p> </li> <li> <p>Ability to communicate with all levels of users (internal and external). Strong problem-solving skills.</p> </li> <li> <p>Adaptability and willingness to take responsibility for your own tasks.</p> </li> <li> <p>Participation in OSS projects, readiness to send PRs to external tools that we use.</p> </li> <li> <p>Knowledge of other programming languages and paradigms (Haskell, Python, Scala, Ruby, etc.).</p> </li> </ul> <p><strong>Project technology stack:</strong></p> <ul> <li> <p>Client-side: React, Redux, Recompose, Ring UI, Typescript.</p> </li> <li> <p>Backend: AWS, TeamCity, IntelliJ IDEA in Docker, Java/Spring App, GitHub Apps.</p> </li> <li> <p>Building: yarn, webpack, Babel, postcss, CSS Modules, Gradle.</p> </li> <li> <p>Unit Testing: Karma, Mocha, Chai, Sinon, Enzyme.</p> </li> <li> <p>Manual and screenshot testing: Storybook, Gemini.</p> </li> <li> <p>Integration testing: TeamCity.</p> </li> </ul> <p><strong>What we offer:</strong></p> <ul> <li> <p>Flexible working hours, a comfortable and friendly workspace, horizontal management structure, direct communication, and helpful and engaged colleagues.</p> </li> <li> <p>Competitive salary.</p> </li> <li> <p>25 working days of paid leave per year.</p> </li> <li> <p>Great team and office environment and a Happiness Manager on staff.</p> </li> <li> <p>Fitness and leisure zones and a company-paid car park.</p> </li> <li> <p>Additional benefits including lunch vouchers, free refreshments and snacks in the office, and more.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Java"},{"name":"Kotlin"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"9281","name":"JetBrains","url":"https://api.hh.ru/employers/9281?host=hh.ru","alternate_url":"https://hh.ru/employer/9281","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1647147.png","original":"https://hhcdn.ru/employer-logo-original/301193.png","90":"https://hhcdn.ru/employer-logo/1647146.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=9281&host=hh.ru","trusted":true},"published_at":"2021-11-08T12:21:38+0300","created_at":"2021-11-08T12:21:38+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=43417132","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/43417132","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}