{"id":"44201085","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Full-stack developer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>What is the opportunity?</strong></p> <p>Corel’s digital platform team is looking for a full stack developer to assist in the development and maintenance of our websites and web applications. Our websites are based on the Django framework using Python and Java for the web applications and JavaScript frameworks for several front-end dynamic experiences. They are hosted on AWS, deployed using Jenkins scripts and leverage technologies like Akamai, GTM/GA to monitor and improve the customer experience.</p> <p>Reporting to the Director of platform development, you will have the opportunity to explore the latest trends in technical SEO and leverage machine learning technology for web log analytics. The position does not require content management in a CMS or HTML UI design.</p> <p>Some of the major projects we’ll be working on this year include improving our site performance against Core Web Vitals, migrating legacy websites to the Django framework, and developing improvements to some of the dynamic features of our platform.</p> <p>This position is high-paced and covers a wide range of technologies. You must have strong attention to detail and excel in learning new technologies and systems. If you’re a problem solver at your core and are eager to make an immediate impact, this could be a good fit. Apply now!</p> <p><strong>What will you be doing?</strong></p> <p>You are a key member of the team responsible for the performance of our websites and functionality of our web applications.</p> <ul> <li>Diagnose client issues, by tracing HTML request/responses, inspecting logs and thoroughly apply system knowledge to deliver timely solutions.</li> <li>Identify and implement website performance improvements by using tools like Google Search Console, PageSpeed Insights and various other debugging tools.</li> <li>Contribute to solution storming discussions, providing right sized and scalable ideas.</li> <li>Collaborate with agencies, business partners, product engineering, and QA teams in implementing and releasing high quality improvements and features.</li> <li>Scope change requests, estimate effort and risk.</li> </ul> <p><strong>What do you need to succeed?</strong></p> <p><strong>Must have:</strong></p> <ul> <li>An undergraduate degree in Computer science, Engineering, or related areas</li> <li>3+ years of experience working on projects developing and integrating web interfaces, leveraging JavaScript solutions.</li> <li>Excellent communication skills with technical and non-technical team members to be able to convey solutions both verbally and through documentation.</li> <li>Attitude is key, and you must have a curious and creative mind set. Driven to understand the entire solution in order to improve upon it.</li> <li>Strong ability to trace web traffic, understand the flow of data and diagnose functional and performance issues.</li> <li>Expertise in optimizing websites for SEO performance, leveraging the latest trends in technical SEO like Core Web Vitals.</li> <li>Understand the fundamentals of caching architectures and how Content Delivery Network contribute to these.</li> <li>Expertise in page tagging and analytics with Google Tag Manager and Google Analytics.</li> <li>Applied excellence in these technologies: <ul> <li>Familiarity with the Django web framework</li> <li>Expert in the programming languages JavaScript, Python, Perl and Java</li> <li>Knowledgeable in redirection solutions using Apache rewrites</li> <li>Ability to create scripts and queries using SQL server and MySQL</li> </ul> </li> </ul> <p><strong>Nice to have:</strong></p> <ul> <li>Familiarity with tools like Git, SVN, Jenkins, Bamboo, Jira and Fiddler</li> <li>Knowledge of other JavaScript frameworks like JQuery, React and Angular</li> <li>Experience in log analysis using Elastic Search and Kibana</li> <li>Knowledge of AWS (Amazon Web Services) technologies</li> <li>Familiarity with eCommerce workflows and technologies</li> </ul> <p><strong>What’s in this for you?</strong></p> <p>Our platform is a key component of the entire customer journey. From the point of acquisition via trial and subscription licensing models, analyzing usage metrics to improve and evangelize user experience and providing in-product workflows for targeted messaging and purchasing. You will have an immediate impact on helping to grow Corel’s business while ensuring we deliver the best customer experiences.</p> <ul> <li>Flexible working hours with the ability to work where best suits your productivity.</li> <li>Working with a wide range of technologies making an impact on the long-term architecture of the platform.</li> <li>Exposure to the latest technology trends like technical SEO, and machine learning.</li> <li>Working with a global team specializing in even more technologies and workflows, giving you the opportunity to grow beyond your current area of expertise.</li> <li>A true fast passed environment with frequent new problems to solve. If problem solving is what drives you, you will excel at this position.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Django Framework"},{"name":"Atlassian Jira"},{"name":"MySQL"},{"name":"Linux"},{"name":"CI/CD"},{"name":"ansible/Chef"},{"name":"Terraform"},{"name":"Java"},{"name":"C++"},{"name":"PHP"},{"name":"AWS"},{"name":"Azure"},{"name":"Alibaba Cloud"},{"name":"Flask"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1736538","name":"Parallels","url":"https://api.hh.ru/employers/1736538?host=hh.ru","alternate_url":"https://hh.ru/employer/1736538","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/245891.jpg","90":"https://hhcdn.ru/employer-logo/1426237.jpeg","240":"https://hhcdn.ru/employer-logo/1426238.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1736538&host=hh.ru","trusted":true},"published_at":"2021-11-11T14:05:18+0300","created_at":"2021-11-11T14:05:18+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44201085","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44201085","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}