{"id":"44886600","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Product Designer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Smartcat is the operating system for the global translation industry. Our team believes that the world becomes ever-more connected and interdependent. The borders that prevent people from trading, working together, and exchanging knowledge and innovations erode over time. That is the future we want to live in. Our mission is to speed up the pace at which that happens, building the best platform for Connected Translation. We don’t believe automation will render language professionals obsolete. Instead, we place powerful software into the hands of the millions of people working to globalize their own industries, plug them into our global supply network, and enable continuous delivery of multilingual content. With tens of thousands of customers and hundreds of thousands of freelancers translating together on Smartcat, we are well on our way.</p> <p><strong>Design at Smartcat</strong></p> <p>The Design team works across many types of product initiatives at Smartcat — from our brand voice and websites to events, web and mobile products, primary qualitative and quantitative research, and even printed publications. And since Smartcat’s main audience is other people who make translations, we agonize over and take pride in crafting user-friendly and user-focused experiences.The Design team works across many types of product initiatives at Smartcat — from our brand voice and websites to events, web and mobile products, primary qualitative and quantitative research, and even printed publications. And since Smartcat’s main audience is other people who make translations, we agonize over and take pride in crafting user-friendly and user-focused experiences. </p> <p><strong>Senior Product Designer Mission</strong></p> <p>The Product Design team ensures Smartcat&#39;s products address meaningful, important problems, solving these problems in intuitive and innovative ways. Our team advocates for great products from a deep understanding of user needs, constantly raising the bar on consistency, usability, and delight. We do this through the practice of UX design, the development of design systems and tooling, product writing, and design research.</p> <p>We’re looking for a talented and experienced Senior Product Designer to help turn our mission from vision to reality. You&#39;ll design the product development lifecycle — from new disruptive ideas all the way to detailed interactions and polished visuals.</p> <p>We’re trying to make design a core foundation of our company&#39;s DNA. This means that you&#39;ll never have to justify the importance of design.</p> <p>Outcomes:</p> <ul> <li> <p>Act as a leader within the Product Design team, collaborating with other designers to make their work and the whole team better</p> </li> <li> <p>Work through design problems from beginning to end: translating research insights into ideas that form disruptive new products and features, then designing the workflows and detailed interactions to realize them</p> </li> <li> <p>Sketch and prototype ideas to quickly access viability, and design the fine grained details of interactions</p> </li> <li> <p>Iterate based on feedback from the whole team</p> </li> <li> <p>Work closely with engineers as they build and ship ideas</p> </li> <li> <p>Own the success or failure of their design work and initiate design and engineering sprints to improve shipped work</p> </li> </ul> <p><strong>Requirements:</strong></p> <ol> <li> <p>Experience designing digital products and systems, not just websites. You have helped ship products that solve real problems, and that people use.</p> </li> <li> <p>Experience designing experiences that people can access on any type of device: desktop, tablet, phone</p> </li> <li> <p>An appreciation of the entire product development process, from problem solving and system modelling, through to detailed UI, visual, and interaction design.</p> </li> <li> <p>Ability to design polished, high-fidelity mockups of your solutions using modern design tools such as Figma.</p> </li> <li> <p>Ability to create interactive prototypes using tools like Figma, Framer.</p> </li> <li> <p>Excellent communicator of design work and your rationale behind proposals</p> </li> <li> <p>Excellent self starter who can deeply collaborate with engineers</p> </li> <li> <p>Have 4+ years relevant design experience at a tech, product-driven company</p> </li> <li> <p>A data-driven approach. Ability to justify decisions using concrete metrics</p> </li> <li> <p>Integrity and full commitment</p> </li> <li> <p>Growth mindset</p> </li> <li> <p>Readiness to work in a highly intense startup environment requiring extreme focus, a strong sense of ownership, and persistence to breakthrough</p> </li> <li> <p>Openness to constructive feedback and the opinions and ideas of others</p> </li> </ol> <p><strong>Why joining Smartcat might be your best move so far</strong></p> <ul> <li> <p>The ongoing rise of the content economy is causing a massive shift in the language industry. All today’s megatrends — big data, artificial intelligence, machine learning — are converging in it at lightning speed. Smartcat’s disruptive business model taps into this $50b industry with a market network where buyers and suppliers connect, collaborate, and leverage our free-to-use workflow SaaS. The next decade will be the era of market networks and reinventing the $10 trillion service economy, and we’re pioneering this global transformation in all things language-related.</p> </li> <li> <p>You will enjoy building with us. You will drive changes in how an old-fashioned global language industry operates while improving how hundreds of thousands of people work, and millions of people exchange knowledge and ideas in the world.</p> </li> <li> <p>While the language industry is big and fragmented enough to keep us busy building a billion-dollar company in the next few years, we are already seeing how the network naturally expands to adjacent language and content-related verticals, expanding our TAM and making our journey even more exciting.</p> </li> <li> <p>We are a global team of 100+ enthusiastic people, with hubs in Boston, Amsterdam, Limassol, Moscow, and Hong Kong — and our users and partners are scattered all around the globe. We’re eager to succeed and transform the world of language services for the better. We grow aggressively while preserving our culture of empathy. As diverse as we are, we love working and having fun together, and we’re sure you’ll love working with us too.</p> </li> <li> <p>Smartcat is backed by Matrix Partners, FJ Labs, and other top VC firms focusing on SaaS and marketplace startups (you might recognize names like HubSpot, Zendesk, Uber, Stripe, RigUp and Quora in their portfolios). This helps us innovate at a fast pace and learn from top professionals in other industries.</p> </li> <li> <p>We are looking for someone who will become a part of the executive team and play a critical role in the most exciting part of our journey from a post-Series B startup to a company exceeding $1b in GMV. Our journey isn’t for the faint of heart. You need to be an extremely fast learner to bring value to our users and the industry as a whole. You need to see the big picture and execute strategies that significantly increase shareholder value over time. We need a sharp mind who can stay two steps ahead on the road with us. We’ve got lots of success to share if you’re ready for it.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"UX"},{"name":"Leadership Skills"},{"name":"Product Management"},{"name":"Microsoft Visual Studio"},{"name":"UI"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"3.64","name":"Дизайнер","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"professional_roles":[{"id":"34","name":"Дизайнер, художник"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3230136","name":"Smartcat","url":"https://api.hh.ru/employers/3230136?host=hh.ru","alternate_url":"https://hh.ru/employer/3230136","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2562701.png","240":"https://hhcdn.ru/employer-logo/2562702.png","original":"https://hhcdn.ru/employer-logo-original/530306.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3230136&host=hh.ru","trusted":true},"published_at":"2021-11-11T16:45:17+0300","created_at":"2021-11-11T16:45:17+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44886600","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44886600","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}