{"id":"44957000","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"PHP-разработчик","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Ведущий веб-сервис проверки и анализа российских юридических лиц и предпринимателей ищет в свою команду middle to senior PHP Developer, который будет работать как над агрегацией информации из различных источников, так и над функционалом сайта.</p> <p><strong>Особенности, которые встретятся вам в работе:</strong></p> <ul> <li>Во-первых, данных обычно много: в России зарегистрировано 11 млн. организаций и 16 млн. индивидуальных предпринимателей. База данных у нас занимает почти 3 Тб. Поэтому часто приходится специально размышлять над тем, как сделать так, чтобы всё не тормозило: оптимизировать структуру базы и SQL-запросы, профилировать PHP-код, эффективно использовать пересчёты в несколько потоков и т. п.</li> <li>Во-вторых, у нас нетривиальная предметная область: это не интернет-магазин, которые все похожи друг на друга, а государственные данные с соответствующими особенностями. Поэтому важно будет разобраться с множеством специфических аббревиатур, и с особенностями хранения данных.</li> <li>В-третьих, у нас есть активно развивающийся платный функционал, который тоже порою порождает различные технические вызовы. В частности, это касается проведения экспериментов по различным механикам привлечения, которые не должны никак затрагивать пользователей, не участвующих в экспериментах.</li> </ul> <p><strong>Опыт, который мы ценим:</strong></p> <ul> <li>Уровень — Middle to Senior</li> <li>Нам очень важно найти эксперта, который хорошо понимает, как код работает с высокой нагрузкой. Ежедневно к нам на сайт заходит более 700к пользователей, мы не останавливаемся на этом и активно развиваем продукт и нашу аудиторию.</li> <li>Вызовы, которые встречаются в работе с highload и open data сформировали команду сильных инженеров. Без фундаментального понимания разработки и методологичности мышления мы не могли бы решать уникальные задачи. Поэтому нам важно, чтобы вы понимали, что происходит при исполнении кода и SQL запросов.</li> <li>Мы очень ценим профессионализм в коммуникации – уважаем фидбек, конструктивный профессиональный диалог без растекания мысли по древу и многочасовых дейли. Нам важно найти коллегу, который разделяет такую культуру общения.</li> </ul> <p><strong>Must have инструменты, на которых у нас все построено:</strong></p> <ul> <li>PHP 7 (PSR-2, 3, 4, 7, 11, 15)</li> <li>MySQL/MariaDB 5.5 (база данных занимает почти 3 Тб данных, много быстрого чтения, чередующегося с массовыми обновлениями)</li> <li>Redis для кеширования данных</li> <li>Elasticsearch</li> <li>Git</li> </ul> <p><strong>Nice to have инструменты, знание которых будет приятным плюсом для нас:</strong></p> <ul> <li>Eloquent, Psalm</li> <li>OpenAPI</li> <li>nginx</li> <li>InfluxDB, Grafana, Telegraf</li> <li>Python</li> <li>CentOS</li> </ul> <p><strong>Что готова дать компания:</strong></p> <ul> <li>Гибкий график – вы можете работать в удобном для вас режиме (в том числе и удалённо), главное – быть с 12 до 18 на связи с командой в TeamSpeak.</li> <li>В конце первого года вас будет ждать годовая премия, а далее – квартальные премии. Мы ценим то, что из нашей команды за 5 лет ушло 2 инженера, и, чтобы отблагодарить сотрудников, сделали прогрессивный коэффициент бонусов, который зависит от времени работы в нашей команде.</li> <li>Работа с highload – ежедневно наш сервис посещает более 700К пользователей. Но на этом мы не останавливаемся, наша продуктовая команда ищет новые аудитории пользователей, а, значит, нагрузки будут только расти.</li> <li>Работа с уникальными задачами. Мы собираем open data и делаем так, чтобы эти данные были не только актуальными в любой момент, но еще и удобными для наших пользователей. Работа с open data несёт за собой вызовы: государственные данные порою требует изобретательности в методах работы с ними, чтобы извлечь из них максимум полезного. Причины просты – поставщики данных, как правило, не заботятся о том, чтобы эти данные было удобно использовать – у каждого ведомства своя логика упаковки и обработки данных.</li> <li>Мы всегда рады новым знаниям, помогающим решать наши непростые задачи, потому мы оплачиваем обучение, помогаем посещать конференции и семинары.</li> <li>У нас небольшая команда без бюрократии и фаундеры, которые слышат каждого. Любой человек может высказаться, что-то привнести и предложить – фаундеры прислушиваются и думают, как претворить все в жизнь.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"PHP"},{"name":"MariaDB"},{"name":"Elasticsearch"},{"name":"Git"},{"name":"Redis"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1068","name":"Cornerstone Russia","url":"https://api.hh.ru/employers/1068?host=hh.ru","alternate_url":"https://hh.ru/employer/1068","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1643847.jpeg","original":"https://hhcdn.ru/employer-logo-original/300368.jpg","90":"https://hhcdn.ru/employer-logo/1643846.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1068&host=hh.ru","trusted":true},"published_at":"2021-11-15T20:28:40+0300","created_at":"2021-11-15T20:28:40+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44957000","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44957000","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}