{"id":"46377556","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Principal Software Engineer, Cloud Platform","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":8000,"to":null,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>At Cube Dev, we are building a technology stack for modern analytics and our mission is to make it accessible to developers around the world.</p> <p>We are focused on bottom-up adoption, and most of our software is open-source. Cube, our flagship open-source product, has over 10,000 stars on GitHub and over 3,000 community members in Slack. It powers companies ranging from Apple, Intel, and Walmart to small Silicon Valley startups.</p> <p>Our business model is based on Cube Cloud, our paid enterprise cloud platform that helps deploy, optimize, and scale Cube apps. It&#39;s in early access while serving dozens of enterprise customers already. Cube Cloud will also have a free tier for our open-source users.</p> <p>We are a 15-person remote-first team distributed over the US, UK, and Eastern Europe with an HQ in San Francisco, funded by top-tier Silicon Valley venture funds that have previously invested in Redis, Hazelcast, Gradle, and other infrastructure software startups.</p> <p>Cube is used to build analytical APIs over trillion data point datasets in SQL databases (e.g., Postgres, ClickHouse) and data warehouses (e.g., Google BigQuery, AWS Athena, Snowflake). Such APIs serve requests with sub-second latency and high concurrency.</p> <p>Cube Cloud provides observability, reliability, and scalability for Cube applications. It helps enterprise customers run, monitor, and auto-scale Cube deployments under strict SLAs while decreasing time-to-market and reducing costs. Cube Cloud pairs with Cube just like BigQuery pairs with Google Cloud Platform or MongoDB Atlas pairs with MongoDB.</p> <p>We&#39;re determined to further enhance Cube Cloud and make it generally available later this year. That&#39;s why we&#39;re looking for a Principal Software Engineer to join the Cube Cloud team. You will contribute to Cube Cloud, help our enterprise customers succeed, serve as an entry point for the team, and work with our CTO to drive architectural and product decisions.</p> <p>During the first months, you&#39;ll be working on these features:</p> <ul> <li><strong>Cube APM.</strong> One of the main tech problems for Cube Cloud is to provide application performance monitoring analytics of Cube instances using Cube itself. Being purely a dogfooding problem, large-scale real-time analytics has a lot of challenges, most of which will be solved for the first time ever using the SQL approach.</li> <li><strong>Cube Cloud PaaS Infrastructure</strong>. Cube Cloud provides a platform as a service infrastructure to deploy Cube applications in production capacity at scale. Being based on AWS, GCP, Azure and other cloud providers it&#39;s a sophisticated cloud in cloud implementation with a lot of various infrastructure challenges.</li> <li><strong>Cube Store Service.</strong> Cube is used to serve analytics for trillions of data points with sub-second response times. To keep up-to-date with growing big data demands and serving speeds we’re developing our own database optimized for serving huge aggregated tables with latencies of several milliseconds. On-demand Cube Store service provides access to hundreds of cores for several milliseconds per query that allows processing terabytes of rollup rows.</li> </ul> <p>Requirements</p> <ul> <li>Expert in data structures and algorithms.</li> <li>Solid understanding of how databases work.</li> <li>Strong coding skills</li> <li>Experience working with the product team</li> <li>Expert in JavaScript and Node.js.</li> <li>Experience in building and managing high-load cloud infrastructure applications.</li> <li>Good communication skills.</li> <li>Fluent English.</li> <li>Previous startup experience or interest in working in a fast-moving company.</li> </ul> <p>Bonus points</p> <ul> <li>Experience with contributing to or the maintenance of an open-source project.</li> <li>Experience in data engineering, building analytics applications, or OLAP.</li> <li>Experience with Docker and k8s, AWS, GCP.</li> <li>C++, Rust, or any other low-level language experience.</li> <li>Understanding of how V8 works.</li> </ul> <p>This is a remote position. Any location is okay as long as we can expect you to be online till 1 pm PT. We can pay for your desk at the co-working space that you choose to work from. Down the road, we offer an optional relocation to our HQ in San Francisco, California with visa (H1-B or O-1) sponsorship. Also, we offer stock options in our US company.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"JavaScript"},{"name":"Node.js"},{"name":"data structures and algorithms"},{"name":"Databases"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4573853","name":"Cube Dev","url":"https://api.hh.ru/employers/4573853?host=hh.ru","alternate_url":"https://hh.ru/employer/4573853","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3938312.png","90":"https://hhcdn.ru/employer-logo/3938311.png","original":"https://hhcdn.ru/employer-logo-original/874359.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4573853&host=hh.ru","trusted":true},"published_at":"2021-11-23T14:18:49+0300","created_at":"2021-11-23T14:18:49+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=46377556","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/46377556","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}