{"id":"46377490","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Senior Software Engineer, Database Engineering (Cube Core)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":6000,"to":null,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>At Cube Dev Dev we are building a technology stack for modern analytics. If you are fascinated by the software that powers large technology companies but want the challenges and freedom that come with working in a small startup, then the job at Cube Dev is for you.</p> <p>We are a small and dedicated team in San Francisco, funded by top-tier SV investors, working on making advanced analytics infrastructure developed at large tech companies accessible to all developers around the world.</p> <p>We are focused on bottom-up adoption, and most of our software is open-source. At Cube Dev, you will be part of a vibrant community. Cube.js users often engage with the company on GitHub and Slack.</p> <p>Thousands of developers are using Cube to build analytics applications and we want to help them be successful. That’s why we&#39;re looking for a database engineer to join our Cube Core team to build state-of-the-art analytics data access technology.</p> <p>As an engineer of the Cube Core team, your main goal will be to build and maintain various parts of open-source Cube Core (https://github.com/cube-js/cube.js), community support in our Slack, as well as the development of Cube Cloud product.</p> <p><strong>Some of the problems you&#39;ll be working on:</strong></p> <ul> <li><strong>SQL generation and rewriting.</strong> Cube is a simple yet powerful way to organize SQL queries. The Cube way is to generate the best possible SQL query for a given database while abstracting all complex stuff from users and giving them full power of SQL at the same time. To solve this problem, Cube parses SQL queries written by users to understand the structure and rewrites them to apply performance optimizations.</li> <li><strong>Rollup DB.</strong> Cube is used to serve analytics for trillions of data points with sub-second response times. To keep up-to-date with growing big data demands and serving speeds we’re developing our own database optimized for serving huge aggregated tables with latencies of several milliseconds.</li> <li><strong>Cube APM.</strong> One of the main tech problems for Cube Cloud is to provide APM analytics of Cube instances using Cube itself. Being purely a dog food problem, large-scale real-time analytics has a lot of challenges, most of which will be solved for the first time ever using the SQL approach.</li> </ul> <p><strong>Requirements:</strong></p> <ul> <li>Expert in database algorithms and data structures: columnar vs row storage, SQL parsing, query planning, indexes, partitioning, join algorithms, filter pushdown optimizations, HLL.</li> <li>Expert in C++, Rust, or any other low-level language.</li> <li>Good communication skills.</li> <li>Fluent English.</li> <li>Previous startup experience or interest in working in a small fast-moving company.</li> </ul> <p><strong>Bonus points:</strong></p> <ul> <li>Development experience with JavaScript, React, Node.js.</li> <li>Expert in at least one of the high-level VM languages such as Node.js, Ruby, Python, Java, Scala, C#, or similar.</li> <li>Experience with contributing to or the maintenance of an open-source project.</li> <li>Experience in data engineering, building analytics applications, or OLAP.</li> <li>Experience with Docker and k8s, AWS, GCP.</li> </ul> <p>This is a remote position. Any location is ok, as long as we can expect that person to be online till 1 pm PT. We can pay for your desk at the co-working space you choose to work from. Down the road, we offer an optional relocation to our HQ in San Francisco, California with visa (H1-B or O-1) sponsorship. We offer stock options in our US company.</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Rust"},{"name":"Docker"},{"name":"Databases"},{"name":"Algorithms and Data Structures"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4573853","name":"Cube Dev","url":"https://api.hh.ru/employers/4573853?host=hh.ru","alternate_url":"https://hh.ru/employer/4573853","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3938312.png","90":"https://hhcdn.ru/employer-logo/3938311.png","original":"https://hhcdn.ru/employer-logo-original/874359.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4573853&host=hh.ru","trusted":true},"published_at":"2021-11-23T14:18:49+0300","created_at":"2021-11-23T14:18:49+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=46377490","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/46377490","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}