{"id":"46485596","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Big-Data and HPC Research Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>We are looking for software engineers to join the new and young team working on Huawei Platform for middleware distributed Telecom Data Analytical Processing in a High-Performance style. The main focus of the team is RnD in platform architecture, development and optimization of algorithms, processing approaches, and software components for efficient data processing. Team is fresh and your experience and ideas can play important role in our projects and research directions.</p> <p>As a team member, you&#39;ll focus on development of distributed processing environment and research ways for implementation of HPC features to build and contribute to the new generation processing platform of company products. We are looking for people who enjoy to try and test newest approaches, and share results. You&#39;ll be able to prepare solution from scratch, with no legacy and show the benefits of your ideas.</p> <p>All our projects are focused on implementation of great ideas for improvement of different parts of data processing. This is excellent opportunity to meet your points of interest with challenge to reach best possible result. You&#39;ll join our part of international RnD team with very close relations both in office and with remote team members.</p> <p><strong>What you’ll be doing?</strong></p> <p>Conducting both academic and applied front-edge research for our projects, achieving state-of-the-art benchmarking results in distributed computing advanced software technologies, including the following areas:</p> <ul> <li>High performance memory computing</li> <li>Next generation high performance network</li> <li>Intelligent Resource Scheduling and Allocation</li> <li>Approximate Computing</li> <li>Heterogeneous Computing</li> <li>Graph Computing</li> </ul> <p>The candidate will be responsible for investigating and surveying related research progress, development and implementation of processing algorithms, building concepts and MVP&#39;s world’s leading high load and HPC solutions, and implementing the prototypes of the proposed solutions</p> <ul> <li>Testing performance and efficiency, development and integration of analytical tools, monitoring for different distributed processing platforms</li> <li>Presenting results to the company’s product groups and at top conferences</li> <li>Learn all the time. The company encourages attending international conferences, and expects employees to stay on the cutting edge of technology.</li> <li>Collaborating with researchers from most famous Russian universities and research institutes</li> </ul> <p><strong>What we expect from you?</strong></p> <ul> <li>Experience in high load systems projects, parallel or distributed processing systems: Hadoop ecosystem, Spark, SQL on Hadoop, Streaming processing, OLAP.</li> <li>Descent level in Java or C++, Bash, performance tuning utilities, knowledge of MPI is a big plus</li> <li>MS/engineering degree in a computer science related discipline or 3+ years of relevant industry software development experience</li> <li>Strong knowledge of algorithms and algorithmic complexity theory</li> <li>Conversationally fluent English. A language certificate is not required, but ability to pass an interview in English is a must.</li> </ul> <p><strong>Which extra experience/skills will be your advantage?</strong></p> <ul> <li>Knowledge of any below mentioned fields: distributed / parallel / heterogeneous / memory / graph computing, high performance storage / network, resource allocation (i.e. VM resource packing optimization)</li> <li>Experience of working with NoSQL</li> <li>Experience of working on/with universities or research institutes</li> <li>Experience working for large multinational technology companies</li> <li>Track record of participating in recognized technical conferences (either as a speaker or a program committee member)</li> </ul> <p><strong>Working conditions and office location.</strong></p> <p>The company offers an excellent compensation for good candidates. We are ready to provide the best conditions for great software engineers.</p> <p>Flexible office working conditions.</p> <p>Our new A-class office is in Moscow center, right next to Smolenskaya metro station.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Java"},{"name":"C/C++"},{"name":"HPC"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"14.91","name":"Информатика, Информационные системы","profarea_id":"14","profarea_name":"Наука, образование"},{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2873","name":"HUAWEI","url":"https://api.hh.ru/employers/2873?host=hh.ru","alternate_url":"https://hh.ru/employer/2873","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3783339.png","240":"https://hhcdn.ru/employer-logo/3783340.png","original":"https://hhcdn.ru/employer-logo-original/835614.PNG"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2873&host=hh.ru","trusted":true},"published_at":"2021-11-15T11:14:33+0300","created_at":"2021-11-15T11:14:33+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=46485596","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/46485596","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}