{"id":"46897117","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"QA Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Ведущий веб-сервис проверки и анализа российских юридических лиц и предпринимателей ищет в свою команду <strong>QA Engineer</strong>, который вместе с коллегой будет отвечать за тестирование всего функционала сервиса.</p> <p><strong>Особенности, с которыми предстоит работать:</strong></p> <ul> <li>У нас много данных — 11 млн. юридических лиц и 16 млн. индвидуальных предпринимателей и множество информации о них — и не самая обычная предметная область, поэтому при тестировании мы сталкиваемся с самыми разнообразными случаями, некоторые из которых могут оказаться весьма неожиданными.</li> <li>Платный функционал сайта подразумевает довольно много различных вариантов, и некоторые сценарии могут быть непростыми. Также продуктовая команда часто запускает различные интересные эксперименты по привлечению пользователей.</li> <li>Сайтом ежедневно пользуется от 700 000 пользователей, которые нередко сообщают в нашу поддержку о странностях в работе сервиса. Благодаря им мы не раз находили и исправляли всякие сложные ошибки.</li> </ul> <p><strong>Опыт, который мы ценим:</strong></p> <ul> <li>Вы уже здорово ориентируетесь в ручном тестировании сайтов и web-приложений, умеете делать кроссбраузерное, функциональное, регрессионное, интеграционное тестирование</li> <li>Вы можете не только методично проверять соответствие поставленной задаче, но и понимать проблемы предметной области, которые она решает</li> <li>Мы очень ценим профессионализм в коммуникации – уважаем фидбек, конструктивный профессиональный диалог без растекания мысли по древу и многочасовых дейли. Нам важно найти коллегу, который разделяет такую культуру общения</li> </ul> <p><strong>Must have инструменты, на которых у нас все построено:</strong></p> <ul> <li><strong>Удалённая test-среда живёт на Linux</strong>, и для выкатки кода туда мы используем <strong>Git</strong>.</li> <li>Кроме того, нередко приходится смотреть в базу данных <strong>MySQL/MariaDB</strong>, чтобы убедиться, что все данные там записались правильно.</li> <li>Для тестирования кроссбраузерности мы используем <strong>Browserstack</strong>.</li> <li>У нас есть также <strong>автотесты на Javascript</strong> с использованием webdriver.io и mocha.</li> <li>Также для контроля вёрстки мы используем <strong>Backstop</strong>.</li> </ul> <p><strong>Nice to have инструменты, знание которых будет приятным плюсом для нас:</strong></p> <ul> </ul> <ul> <li>если вы уже работали с таск-трекинг системами (JIRA) и базой знаний (Confluence), хотя кто сейчас не работал</li> <li>опыт тестирования сложных систем и веб-приложений</li> <li>опыт написания автоматизированных тестов (у нас webdriver.io)</li> </ul> <p><strong>Что готова дать компания:</strong></p> <ul> <li>В конце первого года вас будет ждать годовая премия, а далее – квартальные премии. Мы ценим то, что из нашей команды за 5 лет ушло 2 инженера, и, чтобы отблагодарить сотрудников, сделали прогрессивный коэффициент бонусов, который зависит от времени работы в нашей команде.</li> <li>Из-за большого объёма данных вся разработка и тестирование происходят на удалённом сервере, поэтому работать можно откуда угодно — нужен только доступ в интернет.</li> <li>Гибкий график – вы можете работать в удобном для вас режиме (в том числе удаленно), главное – быть с 12 до 18 на связи с командой в TeamSpeak.</li> <li>Работа с highload – ежедневно наш сервис посещает более 700К пользователей. Но на этом мы не останавливаемся, наша продуктовая команда ищет новые аудитории пользователей, а, значит, нагрузка будет только расти.</li> <li>Работа с уникальными задачами. Мы собираем open data и делаем так, чтобы эти данные были не только актуальными в любой момент, но еще и удобными для наших пользователей. Работа с open data несёт за собой вызовы: государственные данные порою требует изобретательности в методах работы с ними, чтобы извлечь из них максимум полезного. Причины просты – поставщики данных, как правило, не заботятся о том, чтобы эти данные было удобно использовать – у каждого ведомства своя логика упаковки и обработки данных.</li> <li>У нас нет лишнего формализма, и если в процессе разработки или тестирования обнаруживаются неучтённые случаи, мы вместе с продуктовой командой выясняем, как лучше всего решить какую-то бизнес-задачу. Горизонтальная коммуникация хорошо налажена, и процессы происходят без бюрократии.</li> <li>Мы всегда рады новым знаниям, помогающим решать наши непростые задачи, потому мы оплачиваем обучение, помогаем посещать конференции и семинары</li> <li>Наш проект может стать для вас площадкой для начала работы с автотестами, если вы еще не писали их для коммерческих проектов, но хотели бы начать</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Atlassian Jira"},{"name":"Atlassian Confluence"},{"name":"Функциональное тестирование"},{"name":"Git"},{"name":"SQL"},{"name":"Node.js"},{"name":"Автоматизированное тестирование"},{"name":"Тестирование"},{"name":"Проведение тестирований"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.117","name":"Тестирование","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"124","name":"Тестировщик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1068","name":"Cornerstone Russia","url":"https://api.hh.ru/employers/1068?host=hh.ru","alternate_url":"https://hh.ru/employer/1068","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1643847.jpeg","original":"https://hhcdn.ru/employer-logo-original/300368.jpg","90":"https://hhcdn.ru/employer-logo/1643846.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1068&host=hh.ru","trusted":true},"published_at":"2021-10-27T13:35:30+0300","created_at":"2021-10-27T13:35:30+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=46897117","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/46897117","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}