{"id":"47414035","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Cloud Data Scientist (AWS, remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":300000,"to":null,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>ABOUT CLEARSCALE</strong></p> <p><strong>ClearScale LLC </strong>(headquartered in San Francisco, California, USA) - AWS Premier Consulting Partner has been offering a full range of professional cloud computing services for over 10 years, including architecture design, DevOps automation, refactoring and cloud-native applications development, integration, migration, solving all sorts of security issues (from just a security check to preventing cyber-attacks) and 24/7 technical support using the best advanced technologies.</p> <p>The list of our customers is diverse: from government companies (<strong>ClearScale</strong> is an official cloud partner of the state of California) and educational institutions (University of California, San Francisco) to well-known global brands (IBM, Samsung, GoPro, HP, Conde Nast, Carl Zeiss, etc.) The number of satisfied customers has been well over 850, some of which can be found on the company&#39;s website in the Case Studies section.</p> <p>Since the very foundation of the company, we work 100% remotely from various cities and countries. We work on a high trust basis within the company, therefore we do not monitor work being done via taking screen captures, webcams or log keyboard typing, as many other companies do. The professional standing of the engineers in our community is invaluable.</p> <p><strong>About the role</strong></p> <p><strong>ClearScale </strong>is looking for an individual who performs a Machine Learning Developer or Data Scientist role. The successful candidate should demonstrate the ability to build, train, tune, and deploy machine learning (ML) models.</p> <p><strong>About the project</strong></p> <p><strong>ClearScale</strong> is running various projects closely related to Machine Learning, Artificial Intelligence and Internet Of Things.<br />One of the projects is aiming at creation of valuable insights and forecasts for stock market investors and traders based on companies fundamentals, contracts data, news feed sentiment. It requires strong expertize in neural networks, NLP and various ML algorithms.<br />Others include recommendation engines for e-commerce companies as well as for public/private educational organizations.<br />These projects either startups started from the scratch either bring completely new techniques to the mature businesses.</p> <p><strong>Responsibilities</strong></p> <ul> <li>Select and justify the appropriate ML approach for a given business problem</li> <li>Design and implement scalable, cost-optimized, reliable, and secure ML solutions</li> <li>The ability to express the intuition behind basic ML algorithms</li> <li>Create data repositories for machine learning</li> <li>Identify and implement a data-ingestion solution</li> <li>Identify and implement a data-transformation solution</li> <li>Sanitize and prepare data for modeling</li> <li>Perform feature engineering (missing and unbalanced data, outliers)</li> <li>Analyze and visualize data for machine learning</li> <li>Train machine learning models</li> <li>Perform model tuning (learning rate, regularization techniques), hyperparameter optimization</li> <li>Evaluate machine learning models</li> <li>Deploy and operationalize machine learning solutions</li> </ul> <p><strong>Requirements</strong></p> <ul> <li> <p>Bachelor or Specialist/Masters in Computer Science, Statistics, Informatics, Information Systems or another quantitative field</p> </li> <li>2+ years of experience in <strong>Machine Learning/Data Science applications</strong> (classical and deep learning models, ensemble learning)</li> <li>2+ years of experience in <strong>Python ML</strong> frameworks (NumPy, SciPy, scikit_learn, Pandas, Jupyter, Matplotlib)</li> </ul> <p><strong>Would be a plus</strong></p> <ul> <li> <p>Knowledge of ANSI SQL (ability to write advanced analytical queries)</p> </li> <li>In-depth knowledge in one or more <strong>Machine Learning areas</strong>: Deep Learning, NLP, Recommender Systems, Reinforcement Learning</li> <li>In-depth knowledge of <strong>Tensorflow/Keras</strong></li> <li>In-depth knowledge of <strong>AWS SageMaker and one or more</strong> of the following related algorithms: Linear Learner, XGBoost, Seq2Seq, DeepAR, BlazingText, Object2Vec, Object Detection, Image Classification, Semantic Segmentation, Random Cut Forest, Neural Topic Model, Latent Dirichlet Allocation, K-Nearest-Neighbors, K-Means, Principal Component Analysis, Factorization Machines, IP Insights, Reinforcement Learning, Automated Model Tuning</li> <li>In-depth knowledge of one or more of the following <strong>AWS technologies</strong>: S3, Kinesis, Glue, Redshift, RDS, Aurora, DynamoDB, ElastiCache, Data Pipeline, Batch, DMS, Step Functions, Athena, QuickSight, EMR, SageMaker, Ground Truth, Comprehend, Translate, Transcribe, Polly, Rekognition, Forecast, Lex, Personalize, Textract, DeepRacer, DeepLens, IoT</li> <li>Hands-on experience with Apache Spark MLLib (Zeppelin)</li> <li>Hands-on experience with OpenCV</li> <li>Hands-on experience with advanced Python data frameworks (Seaborn, PyTorch, Dask)</li> </ul> <p><strong>Valid AWS certificates would be a great plus (not a must): </strong></p> <ul> <li>AWS Certified Solutions Architect – (Associate / Professional)</li> <li>AWS Certified DevOps Engineer – (Professional)</li> <li>AWS Certified SysOps Administrator – (Associate)</li> <li>AWS Certified Developer – (Associate)</li> </ul> <p><strong>We offer</strong></p> <p><strong># 1 Fair wage</strong></p> <p>- Fixed hourly rate in US dollars for the time worked on projects (fluctuate ruble exchange rate is actually being a plus during the last few years)</p> <p>- Full-time load, 40 hours per week. It’s your main place of work not a side job.</p> <p>- Payments on a clear schedule every 2 weeks.</p> <p>- Annual Hourly Rate Review - received appreciation from a client, passed a kewl AWS certificate, saved the world? We reward on the basis of facts, not a personal relation.</p> <p>- Reference program - many engineers came to the team on the recommendation of their friends and former colleagues and we have a reward for this.</p> <p><strong># 2 Independence</strong></p> <p>- From the location or office conditions because it is only your choice where exactly you want to work - from home, office, co-working space or outdoors in the forest with only one requirement - fast and stable internet. At the same time, our engineers do not work evenings or weekends because our focus is on the employee&#39;s local time.</p> <p>- From annoying co-workers with their small talks - we are a community of professional engineers, no BS.</p> <p>- From corruption and bureaucracy - we operate in an honest and competitive environment and are one of AWS&#39;s top 10 key partners.</p> <p><strong># 3 Professional Development</strong></p> <p>- Work with innovative Silicon Valley companies and traditional American companies at the cutting edge of digital transformation.</p> <p>- We work with the newest technologies in the AWS cloud and open-source tools, Jira, Confluence, Lucidchart, Slack.</p> <p>- Constant practice in writing and speaking English.</p> <p>- A Russian-speaking technical team sharing their expertise.</p> <p>- Paid AWS certification - we provide training material, set of paid time and pay for examinations.</p> <p>- Horizontal and vertical career growth - are you ready to be greater, faster, stronger? We keep growing and people keep growing with us.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"ML"},{"name":"AWS"},{"name":"ANSI SQL"},{"name":"NumPy"},{"name":"SciPy"},{"name":"scikit_learn"},{"name":"Pandas"},{"name":"Jupyter"},{"name":"Matplotlib"},{"name":"IoT"},{"name":"ElasticSearch"},{"name":"Spark MLLib"},{"name":"Zeppelin"},{"name":"Python"},{"name":"Seaborn"},{"name":"PyTorch"},{"name":"Dask"},{"name":"Machine Learning"},{"name":"sagemaker"},{"name":"Data Science"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1574063","name":"ClearScale","url":"https://api.hh.ru/employers/1574063?host=hh.ru","alternate_url":"https://hh.ru/employer/1574063","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/7789.png","90":"https://hhcdn.ru/employer-logo/1091270.png","240":"https://hhcdn.ru/employer-logo/1091271.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1574063&host=hh.ru","trusted":true},"published_at":"2021-10-25T17:20:00+0300","created_at":"2021-10-25T17:20:00+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=47414035","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/47414035","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}