{"id":"47445984","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior PHP developer (Verticals team)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":null,"to":300000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>YCLIENTS —<strong> </strong>успешная IT-компания, лидирующий игрок на рынке SaaS-платформ для онлайн-записи и автоматизации бизнеса в сфере услуг. На сегодняшний день клиентами YCLIENTS являются более 40 тысяч компаний в 80 странах. Ежемесячно на платформе совершается более 12 миллионов записей и 2.5 млн из них онлайн.<br />В штат компании входит более 350 молодых и амбициозных профессионалов, сотрудничество которых часто становится основой дружеского общения за пределами офиса.<br />На данном этапе YCLIENTS это абсолютный лидер среди платформ автоматизации для сферы Красоты. Однако мы ставим перед собой стратегическую цель развить успех и стать лидерами на других рынках, в других <strong>вертикалях</strong>.</p> <p>Для реализации этой амбициозной цели мы создали команду Вертикалей, которая сейчас направляет свои усилия чтобы покорить сферу спорта. Команда добавляет в продукт функционал, который должен помочь бизнесам из этой вертикали, таким как спортивные секции, студии йоги, танцев, боевых искусств и другим, стать эффективнее и прибыльнее.<br />Команда Вертикалей это высококлассная кросс-функциональная продуктовая команда состоящая из владельца продукта, тимлида, дизайнера, продуктового аналитика, backend разработчика, frontend разработчика и 3 QA инженеров.</p> <p> </p> <p><strong>Что нужно будет делать:</strong></p> <ul> <li> <p>Работать в продуктовой команде</p> </li> <li> <p>Разрабатывать высоконагруженные, масштабируемые и легко поддерживаемые приложения</p> </li> <li> <p>Написание тестов, поддержка технической документации</p> </li> <li> <p>Проведение код-ревью и ревью дизайна на соответствие архитектурным стандартам</p> </li> <li> <p>Принятие технических решений совместно с другими разработчиками</p> </li> <li> <p>Планирование процесса разработки, участие в командных scrum мероприятиях</p> </li> </ul> <p> </p> <p><strong>Мы ожидаем, что вы Back-End разработчик, который:</strong></p> <ul> <li> <p>Отлично знает PHP, MySQL</p> </li> <li> <p>Имеет опыт работы хотя бы с одним из популярных фреймворков</p> </li> <li> <p>Участвовал в командной работе, хорошо ориентируется в чужом коде</p> </li> <li> <p>Писал тесты (PHPUnit/Codeception/...) и понимает, почему они необходимы</p> </li> <li> <p>Хорошо знает как работает git, комфортно себя чувствует в *nix-консоли</p> </li> <li> <p>Позитивен, энергичен и открыт к новому, умеет аргументировать и договариваться</p> </li> </ul> <p> </p> <p><strong>Не обязательно, но будет плюсом, если вы</strong>:</p> <ul> <li> <p>Работали с брокерами сообщений (AMQP, в частности Rabbit MQ)</p> </li> <li> <p>Знаете и понимаете, какие существуют подходы к оптимизации приложений</p> </li> <li> <p>Разбираетесь в ClickHouse / ElasticSearch / Redis</p> </li> <li> <p>Имеете опыт работы в проектах с высокой нагрузкой</p> </li> <li> <p>Дружите с Docker</p> </li> <li> <p>Писали код по TDD</p> </li> <li> <p>Не останавливаетесь в личностном и профессиональном развитии, можете поделиться другими полезными компетенциями</p> </li> </ul> <p> </p> <p><strong>Как мы работаем:</strong></p> <ul> <li>Мы работаем по OKR (Objectives and Key Results). У нас есть стратегические цели всей компании на 3-5 лет и на ближайший год. А далее каждая команда определяет свои цели и метрики на каждый квартал, причем цели и метрики команды должны быть привязаны к целям компании. Достижение целей команды должно помочь компании достичь своих стратегических целей. После того как известны цели и метрики, мы формулируем список гипотез, за счет которых мы хотим повлиять на метрики, этот список гипотез мы скорим и приоритезируем и выстраиваем RoadMap, какую гипотезу в каком спринте мы будем проверять. В RoadMap мы добавляем не только продуктовые задачи, но и техдолг в соотношении 70 на 30.</li> <li>Сложившаяся Agile культура. Scrum/Kanban, двухнедельные итерации, ретроспективы.</li> <li>Много внимания уделяем DevOps и другим инженерным практикам. Стремимся придти к Trunk base development. Проводим дизайн ревью, максимально декомпозируем задачи, пишем тестовую документацию одновременно с разработкой, стремимся проводить синхронное code review в командах.</li> <li>Много внимания уделяем flow, чтобы быть эффективнее. У нас настроен и работает CI/CD через Gitlab, задачи синхронизированы с Jira.</li> <li>В R&amp;D у нас порядка 100 человек. Основу составляют кросс-функциональные команды примерно такого состава: тимлид, владелец продукта, дизайнер, аналитик, 2 backend разработчика, 2 frontend разработчика, 2-3 QA инженера. Таких команд у нас сейчас 7.</li> <li>Помимо продуктовых команд у нас есть команды:</li> <li>Инфраструктурных инженеров и разработчиков. Которые занимаются развертыванием, поддержкой и мониторингом наших продакшен, дев и тест окружений. В нашей инфраструктуре более 150 серверов.</li> <li>TestOps инженеров. Они занимаются тестовыми песочницами и E2E тестами и внедрением их в пайплайн. У нас написано более 500 E2E тестов которые выполняются параллельно в рамках пайплайнов за 5-6 минут.</li> <li>CX/UX исследователей. Они проводят CustDev, тестируют наши интерфейсы и макеты на реальных пользователях, исследуют рынок.</li> <li>Дата инженеры и аналитики. Они выстраивают ETL процессы для сбора данных и метрик. Это очень важно для построения data-driven продуктовой культуры.</li> </ul> <p><strong>Наш стэк:</strong> PHP 7.4, MySQL (Percona Server), Redis, ElasticSearch, ClickHouse, RabbitMQ</p> <p> </p> <p><strong>Условия:</strong></p> <ul> <li> <p>Полный рабочий день 5/2, возможно работать в удаленном формате</p> </li> <li> <p>Полностью белая з/п, гибкое время начала рабочего дня с широким диапазоном</p> </li> <li>Трудоустройство по ТК РФ</li> <li>Горизонтальный и вертикальный рост</li> <li>Ревью каждые полгода и постоянная индексация заработной платы</li> <li>Комфортабельный офис в пешей доступности от станции м. Достоевская, м. Новослободская, м. Менделеевская</li> <li>Полис добровольного медицинского страхования</li> <li>Корпоративные мероприятия, фрукты, овощи, кофе и печеньки, а также пицца каждую пятницу</li> <li>Техника на ваш выбор (MacBook / MacMini / Lenovo / Dell)</li> <li>Специальные предложения от партнеров и друзей YCLIENTS</li> </ul> <p>Собеседование у нас проходит в удаленном формате, где вы побеседуете с техническим директором, архитектором backend и тимлидом продуктовой команды (расчетное время 1,5 часа).</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"PHP"},{"name":"PHPUnit"},{"name":"MySQL"},{"name":"Redis"},{"name":"REST"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"793926","name":"YCLIENTS LLC","url":"https://api.hh.ru/employers/793926?host=hh.ru","alternate_url":"https://hh.ru/employer/793926","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/774854.png","240":"https://hhcdn.ru/employer-logo/3540308.png","90":"https://hhcdn.ru/employer-logo/3540307.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=793926&host=hh.ru","trusted":true},"published_at":"2021-11-09T11:38:05+0300","created_at":"2021-11-09T11:38:05+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=47445984","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/47445984","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}