{"id":"47631314","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Product Manager at Smartcat, Smartwords","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Smartcat is the operating system for the global translation industry. Our team believes that the world becomes ever-more connected and interdependent. The borders that prevent people from trading, working together, and exchanging knowledge and innovations erode over time. That is the future we want to live in. Our mission is to speed up the pace at which that happens, building the best platform for Connected Translation. We don’t believe automation will render language professionals obsolete. Instead, we place powerful software into the hands of the millions of people working to globalize their own industries, plug them into our global supply network, and enable continuous delivery of multilingual content. With tens of thousands of customers and hundreds of thousands of freelancers translating together on Smartcat, we are well on our way.</p> <p><strong>Mission</strong></p> <p>Smartcat develops a collaboration platform that brings together buyers of localization services (end customers) and vendors (localization agencies and freelance linguists). You will play a critical role in the most exciting part of our journey from a post-Series B startup to a company exceeding $1b in GMV. We&#39;re results-oriented, and we don&#39;t take this lightly: you must be a person who has a strong appetite for success, wants to grow fast, and motivates others to grow with you.</p> <p>Your personal mission will be to own the flagmanship product initiative, Smartwords (core set of technologies like translation memories, machine translation, glossaries and others, which are used to automatically process content in Smartcat), and ensure its adoption and growth. You will own the process of tracking usage data, defining product improvement hypotheses, working with designers and software engineers to plan both long-term roadmap and the day-to-day work, track the execution, and deliver results on time. You will have a unique opportunity to work on the verge of modern linguistic technologies and drive the whole language industry forward.</p> <p><strong>Your outcomes</strong></p> <ol> <li> <p>Within 3 months, define a clear product roadmap for Smartwords, and own it further.<br /></p> </li> <li> <p>Own the Smartwords growth objective and achieve 35+%* QoQ growth in Smartwords usage across corporate accounts.<br /></p> </li> <li> <p>Help develop Smartwords strategy, enriching its capabilities for processing and transforming natural languages in different forms and formats to bring more value to enterprise users. </p> </li> </ol> <p>* Personal OKRs are defined on a quarterly basis and are aligned with company-wide objectives.</p> <p><strong>Requirements</strong></p> <ul> <li> <p>Outstanding achievement as a product manager or product owner for B2C or B2B SaaS platforms with a focus on product-led growth.</p> </li> <li> <p>Knowledge of a localization industry, modern state of machine translation, ML/AI is a strong plus.</p> </li> <li> <p>At least 5 years of experience working as a product manager or a product owner.</p> </li> <li> <p>Fluent English and Russian, both written and spoken.</p> </li> <li> <p>Exceptional communication skills to interact with colleagues, customers, and partners.</p> </li> <li> <p>Growth-oriented mindset.</p> </li> <li> <p>Integrity, full commitment, and a strong sense of ownership.</p> </li> <li> <p>Experience working in a highly intense startup environment, requiring extreme focus, a sense of urgency, and persistence to break through.</p> </li> <li> <p>Openness to feedback and alternative opinions and ideas.</p> </li> <li> <p>Comfortable working with remote teams across time zones. </p> </li> <li> <p>Easy-going personality, high tolerance to cultural differences.</p> </li> </ul> <p><strong>Why joining Smartcat might be your best move so far</strong></p> <ul> <li> <p>The ongoing rise of the content economy is causing a massive shift in the language industry. All today’s megatrends — big data, artificial intelligence, machine learning — are converging in it at lightning speed. Smartcat’s disruptive business model taps into this $50b industry with a market network where buyers and suppliers connect, collaborate, and leverage our free-to-use workflow SaaS. The next decade will be the era of market networks and reinventing the $10 trillion service economy, and we’re pioneering this global transformation in all things language-related. </p> </li> <li> <p>You will enjoy building with us. You will drive changes in how an old-fashioned global language industry operates while improving how hundreds of thousands of people work, and millions of people exchange knowledge and ideas in the world. </p> </li> <li> <p>While the language industry is big and fragmented enough to keep us busy building a billion-dollar company in the next few years, we are already seeing how the network naturally expands to adjacent language and content-related verticals, expanding our TAM and making our journey even more exciting. </p> </li> <li> <p>We are a global team of 100+ enthusiastic people, with hubs in Boston, Amsterdam, Limassol, Moscow, and Hong Kong — and our users and partners are scattered all around the globe. We’re eager to succeed and transform the world of language services for the better. We grow aggressively while preserving our culture of empathy. As diverse as we are, we love working and having fun together, and we’re sure you’ll love working with us too. </p> </li> <li> <p>Smartcat is backed by Matrix Partners, FJ Labs, and other top VC firms focusing on SaaS and marketplace startups (you might recognize names like HubSpot, Zendesk, Uber, Stripe, RigUp and Quora in their portfolios). This helps us innovate at a fast pace and learn from top professionals in other industries.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Product Management"},{"name":"Английский язык"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"73","name":"Менеджер продукта"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3230136","name":"Smartcat","url":"https://api.hh.ru/employers/3230136?host=hh.ru","alternate_url":"https://hh.ru/employer/3230136","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2562701.png","240":"https://hhcdn.ru/employer-logo/2562702.png","original":"https://hhcdn.ru/employer-logo-original/530306.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3230136&host=hh.ru","trusted":true},"published_at":"2021-11-11T16:45:17+0300","created_at":"2021-11-11T16:45:17+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=47631314","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/47631314","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}