{"id":"47686394","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Customer Support Associate (Remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>AppFollow is an application management platform for app monitoring, ASO, and review processing.</strong> Our main goal is to ease the everyday routines of app developers, product managers, marketing teams, customer support etc. AppFollow is a platform we bring to our users all around the globe so they can become more productive and grow their app’s businesses using our products.</p> <p>AppFollow headquarters are based in Helsinki, but the whole team works remotely. At present, our company boasts a cadre of more than 80 experts operating from 10 countries, including Russia, Ukraine, Belarus, Finland, Ireland, United Kingdom, Poland, Czech Republic, Rumania and Kazakhstan.</p> <p><strong>About the Support team</strong></p> <p>The AppFollow Support team delivers solutions, troubleshoots issues, and provides an over-and-above positive experience for customers all over the world.</p> <p>Support Specialists are responsible for working directly with our customers to help them set up and use AppFollow, answer product questions, track user feedback, report and escalate issues to engineers, and act as the bridge between our customers and our Product, Sales, Customer Success, and Engineer teams.</p> <p>As a team who works directly with our community, you’ll be collecting and sharing user suggestions, as well as pain points, directly with the rest of the company.</p> <p><strong>About the Role</strong></p> <p>We’re looking for someone with experience in customer support and an excellent track record for creating a positive customer experience to help our growing Customer Support team!</p> <p>Reporting to the Customer Support Lead, you&#39;ll take care of 35-45 customers per day to ensure they get the reactive support they need to be successful using our product. While being a proactive support team, we identify what our customers are trying to do and offer the correct workflow solution and not just answer their immediate question.</p> <p>You will assist customers in real time in Zendesk chat, email, Zoom and Slack community, making decisions as to when a concern may need further escalation and answering customer questions. You&#39;ll also communicate with the other departments to provide a seamless customer experience. As you solve problems, you will communicate any relevant information to additional teams that may be impacted by these changes.</p> <p>We require weekend, holiday, and morning/evening availability: flexibility with your schedule is key! This role is 100% remote with 6-7 hours shifts range per day and the ability to work between 120-150 hours per month depending on the needs of the team.</p> <p>The working hours will be <strong>GMT +3 roughly 1pm – 8pm</strong> and <strong>4pm – 11pm</strong> schedule weekdays and at least 2 working weekends per month. Before that, the <strong>first 60 days will be 9am-6pm or 1pm-10pm GMT+3 Monday-Friday</strong> for virtual training and coaching.</p> <p><strong>Responsibilities</strong></p> <ul> <li>Respond to customer queries in a timely and accurate way through various channels: email, chat and Slack community;</li> <li>Maintain a positive, empathetic, and professional attitude toward customers at all times;</li> <li>Provide accurate, valid and complete information by using internal and external knowledge base;</li> <li>Identify customer needs and help customers use specific features;</li> <li>Know our products inside and out so that you can provide appropriate solutions, alternatives and recommend best practices within the time limits;</li> <li>Identify cases that need to be escalated and escalate effectively;</li> <li>Take the extra mile to engage customers;</li> <li>Analyze and report product malfunctions (for example, by testing different scenarios or impersonating users);</li> <li>Notify lead of any pressing / urgent issues needing attention or escalation;</li> <li>Follow up with customers to ensure their technical issues are resolved;</li> <li>Inform customers about new features and functionalities;</li> <li>Share feature requests and effective workarounds with team members;</li> <li>Provide feedback on the efficiency of the customer service process;</li> <li>Follow communication procedures, guidelines and policies;</li> <li>Contribute to team effort by accomplishing related results as needed;</li> <li>Attend daily and weekly team meetings to identify, discuss, and solve any ongoing projects, process improvement ideas, product features, etc.</li> <li>Update our external and internal databases with information about technical issues and useful discussions with customers;</li> <li>Collaborate with other departments including Product, Sales, Customer Success, Legal and Marketing;</li> <li>Working on ad-hoc projects (ex. participating in product webinars to answer attendee questions);</li> <li>Process forms, applications, and requests from customers;</li> <li>Assist in training junior Customer Support Representatives.</li> </ul> <p><strong>Job requirements</strong></p> <ul> <li> <p>2-3 year B2B customer support experience as a Customer Support Specialist or similar CS role;</p> </li> <li> <p>Natural at problem-solving with a huge range of customers using a complex product, it’s a crucial part of the job;</p> </li> <li> <p>Strong chat, email and online meeting (Zoom) contact handling skills with ability to explain concepts clearly, patience when handling tough cases;</p> </li> <li> <p>Fluent English;</p> </li> <li> <p>Culture fit - positive and uplifting attitude;</p> </li> <li> <p>Customer orientation and ability to adapt/respond to different types of characters;</p> </li> <li> <p>Experience working with email ticket systems like Zendesk and understanding CS metrics like CSAT, Average Reply Time, etc.;</p> </li> <li> <p>Data and technology driven, and able to learn new product features and systems in a fast paced environment;</p> </li> <li> <p>Ability to multi-task and prioritize, manage time effectively and with little or no supervision;</p> </li> <li> <p>Know how to keep track of your own tasks and nudge others whenever something looks stuck;</p> </li> <li> <p>Familiarity with the product development lifecycle.</p> </li> </ul> <p> </p> <p><strong>Bonus Points if you have</strong></p> <p> </p> <ul> <li> <p>Experience troubleshooting deep technical issues in the SaaS space;</p> </li> <li> <p>Experience in a startup environment, or tech industry field;</p> </li> <li> <p>Comfortable adapting quickly and openly to changes, and keen to always learn and apply these insights to your work;</p> </li> <li> <p>Have experience working remotely (and loved it);</p> </li> <li> <p>Speak other languages.</p> <p> </p> </li> </ul> <p><strong>Benefits we offer</strong></p> <ul> <li> <p>Full-time remote job. Though you’re always welcome to spend time with us in our office in Helsinki. Or to meet in a co-working with the colleagues who live in the same location as you</p> </li> <li> <p>Quarterly and annual bonuses based on achieving KPIs and your personal performance and extra efforts</p> </li> <li> <p>35 days of paid vacation. Take the time you need to stay charged. By prior agreement, you can have days off for special occasions, we are pretty flexible here</p> </li> <li> <p>Paid corporate meet-ups. We get together twice a year at various locations (St. Petersburg, Moscow, Helsinki, Riga etc.) to work and spend time together offline. We bear all the travel costs for your accommodation, flights, lodging, and other business travel expenses</p> </li> <li> <p>We compensate 50% of all of your education costs, including English courses</p> </li> <li> <p>Health insurance</p> </li> <li> <p>You’ll have executive-level visibility into how the company is running and performing</p> </li> <li> <p>We’re always ready to provide dedicated support and fast-track your on-boarding, give you the tools you need to be successful</p> </li> </ul> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Customer Support"},{"name":"Английский язык"},{"name":"Negotiation skills"},{"name":"Zendesk"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.211","name":"Поддержка, Helpdesk","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"93","name":"Переводчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2661894","name":"AppFollow","url":"https://api.hh.ru/employers/2661894?host=hh.ru","alternate_url":"https://hh.ru/employer/2661894","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/383138.jpg","90":"https://hhcdn.ru/employer-logo/1974810.jpeg","240":"https://hhcdn.ru/employer-logo/1974811.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2661894&host=hh.ru","trusted":true},"published_at":"2021-11-22T20:05:47+0300","created_at":"2021-11-22T20:05:47+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=47686394","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/47686394","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}