{"id":"48019534","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Delivery Architect","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Денисовский переулок","building":"26","description":null,"lat":55.766734,"lng":37.67652,"raw":"Москва, Денисовский переулок, 26","metro":{"station_name":"Бауманская","line_name":"Арбатско-Покровская","station_id":"3.17","line_id":"3","lat":55.772405,"lng":37.67904},"metro_stations":[{"station_name":"Бауманская","line_name":"Арбатско-Покровская","station_id":"3.17","line_id":"3","lat":55.772405,"lng":37.67904}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Our Company</strong></p> <p>Teradata (NYSE: TDC) is the leading multi-cloud data platform company for enterprise analytics, transforming how businesses work and people live through the power of data.</p> <p>At Teradata, we are leading the data era. As enterprises address today’s digital economy, they are faced with new competition and consumer expectations and are turning to data to power their future. Teradata has worked with the largest companies in the world for 40+ years, bringing our experience and expertise to support global enterprises with their most demanding, mission-critical, complex, and large-scale data needs. Teradata is recognized as a leader in the cloud, data, and analytics spaces by top analyst firms, Gartner and Forrester, and Fortune Magazine as well.</p> <p>Our connected multi-cloud data platform for enterprise analytics, Teradata Vantage™, is an extremely scalable, secure, and resilient offering that simplifies ecosystems by connecting data and making it easier to uncover insights from across the organization…regardless of where that data resides. With Vantage, we enable companies to modernize their data management, from start to scale. Every day, millions of users benefit from our open data platform. Empowering customers and partners to develop and build how they like, we enable hundreds of business outcomes and solutions, including improving customer experience and profitability, driving operational efficiency, realizing financial transformation, or achieving operational efficiency.</p> <p>As the world of data grows, we are the leader in enabling the future of connected businesses, powered by data intelligence. We are committed to delivering on this vision by following sustainable business practices and with a strong focus on diversity, equity, and inclusion. We believe that only by embracing diversity of identity, thought, background, expression, and perspective can we solve today’s challenges and reimagine tomorrow’s world.</p> <p> </p> <p>As a Delivery Architect within Data practice, you will be responsible for the solution design and implementation utilizing Company and 3rd party products leveraged with customer requirements.</p> <p> </p> <p><strong>Main Responsibilities:</strong></p> <p> </p> <ul> <li>Design and deliver a technical solution in accordance to an agreed specification and in co-operation with the customer and Company Centers of competence.</li> <li>Tech leading the delivery projects.</li> <li>Work closely with both customer and project management team to deliver the project within time.</li> <li>Participate in the follow up of the delivered products and solutions to enable the solution support and evolution.</li> <li>Contribute to knowledge sharing communities.</li> <li>Expected to travel internationally and sometimes on short notice with variable durations (up to 10% per year) – when the current travel restrictions are cancelled.</li> </ul> <p> </p> <p><strong>Requirements:</strong></p> <p> </p> <ul> <li>Education - Bachelor&#39;s degree in Engineering/Computer Science or equivalent.</li> <li>Pertinent Experience – 3+ years of experience in a finance or telecommunications environment where at least 2 of those years is in customer implementation or Integration services and/or consulting.</li> <li>Consultative behavior, result-driven and self-motivated.</li> <li>English skills: enough to participate in business meetings, technical classes and written communications.</li> <li>Proven experience in the solution implementation or engineering.</li> <li>Working knowledge of data modelling (both logical and physical).</li> </ul> <p> </p> <p><strong>Competences and skills:</strong></p> <p> </p> <p><strong>Technical</strong></p> <ul> <li>Knowledge of database technologies, Oracle or Teradata preferably.</li> <li>Data modelling and query optimization experience across relational and non-relational technologies.</li> <li>Process and design modelling using UML.</li> <li>Knowledge of scripting and other programming languages, like Python, Scala, shell, etc.</li> <li>Knowledge of the following markup languages and protocols is critical: XML, JSON</li> <li>Knowledge of Unix-like operating systems, Sun Solaris and Linux preferably</li> <li>Experience working within a Big Data Environment. For example, Hadoop, Kline, Hive, HBase, Spark.</li> <li>Experience working with an ETL or DI environment (like Informatica, SAS, Talend, Hitachi, Oracle, etc.) is an advantage.</li> <li>Experience in JAVA EE programming (like EJB3.0, Spring, Hibernate, JPA and GlassFish) is an advantage.</li> <li>Experience on web development (Struts, Java script, JSP, HTML, AJAX, JSON and SVG) is an advantage.</li> <li>Experience working with virtualization (VMware, Hyper-V) is an advantage.</li> </ul> <p> </p> <p><strong>Personal</strong></p> <ul> <li>Highly motivated to fulfill the goal within the customer environment and eager to contribute to the success of the company and the customer.</li> <li>Fluent spoken and written Russian are a must, fluent English and other languages are an advantage.</li> <li>Ability to share own knowledge and experience, mentoring skills.</li> <li>Excellent interpersonal and people management skills.</li> <li>Team player / Result Oriented.</li> <li>Ability to take on a leadership role in a team environment.</li> <li>High capability to drive, motivate and co-operate.</li> <li>Ability to examine situations from a system-level perspective.</li> <li>Ability to understand specific needs in which to create or alter solutions.</li> <li>Ability to work under stressful situations, meet tight deadlines and deliver services with high quality.</li> </ul> <p> </p> <p> </p> <p>Teradata is an equal opportunity employer in all aspects of our business. We are excited by the unique qualities, abilities, and perspectives each person brings, and candidates are considered on all the fundamentals they may bring to the role and the team.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Data modelling"},{"name":"Process Modelling"},{"name":"Unix"},{"name":"Big Data"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.3","name":"CTO, CIO, Директор по IT","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.420","name":"Администратор баз данных","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.744","name":"Другое","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"104","name":"Руководитель группы разработки"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"196122","name":"Teradata","url":"https://api.hh.ru/employers/196122?host=hh.ru","alternate_url":"https://hh.ru/employer/196122","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3308932.png","240":"https://hhcdn.ru/employer-logo/3308933.png","original":"https://hhcdn.ru/employer-logo-original/716954.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=196122&host=hh.ru","trusted":true},"published_at":"2021-11-22T12:08:14+0300","created_at":"2021-11-22T12:08:14+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48019534","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48019534","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}