{"id":"48149665","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Technical Support Specialist","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>dxFeed</strong> - это подразделением компании Devexperts, которое занимается предоставлением рыночных данных и сопутствующей финансовой информации банкам, брокерам, инвестиционным компаниям и другим профессиональным участникам рынка.</p> <p>Мы сотрудничаем с <strong>крупнейшими биржами мира</strong>, что позволяет нашим клиентам получать актуальную информацию о более чем <strong>3-х миллионах финансовых инструментов в режиме реального времени</strong>. Конечными пользователями наших сервисов на данный момент являются <strong>более 6 миллионов человек</strong>.</p> <p><strong>Команда dxFeed B2B Support </strong>занимается поддержкой экосистемы сервисов, предоставляющих клиентам сверхнадежный поток рыночных данных (Market Data). Команда <strong>расширяется</strong>, потому мы находимся в поисках единомышленников.</p> <p>Мы делимся на <strong>3 уровня поддержки</strong> в соответствии с пулом выполняемых задач, компетенций, уровнем ответственности и взаимодействуем не только с клиентами, но и с другими командами dxFeed: разработчиками, бизнес-аналитиками, финансовым и юридическим отделами, отделом продаж, техническими писателями. В ходе работы контактируем с провайдерами данных, решаем проблемы в смежных категориях.</p> <p><strong>Рабочий инструментарий и платформы:</strong></p> <ul> <li>Bash – скриптовые обвязки, управление, инфраструктура;</li> <li>Stash – доставка, сборка, версионирование;</li> <li>Jira, Confluence – управления задачами, дашборды, Kanban, отчетинг, тайм-трекинг, ведение документации;</li> <li>Grafana, ASCIIDOC – визуализация</li> <li>Zabbix – мониторинг;</li> <li>Twillio IVR, Amixr, Slack, SendGrid – эскалация инцидентов и коммуникация</li> </ul> <p><strong>Какие задачи предстоит решать:</strong></p> <ul> <li>сохранять ответственность за лицо компании, за техническое содержание и форму ответов в процессе решения клиентских проблем;</li> <li>работать в B2B Service Desk и ориентироваться на клиентское взаимодействие;</li> <li>решать заявки от технических специалистов заказчиков и внутренних клиентов (проекты и клиенты Devexperts аналогично работают с dxFeed через систему заявок);</li> <li>участвовать в процессах создания и улучшения инфраструктуры и рабочих процессов;</li> <li>оказывать консультативную помощь коллегам внутри/вне компании, вести заявки, коммуницировать с клиентами или провайдерами от лица компании, рассылать нотификации;</li> <li>поддерживать и писать внутреннюю документацию;</li> <li>заниматься рутинными задачами, напоминаниями, адвокатурой клиента: нам важно качественно решить проблему и получить за неё высокую оценку.</li> </ul> <p><strong>Must-have для успешной работы:</strong></p> <ul> <li>английский язык Upper-Intermediate и выше;</li> <li>умение грамотно, доходчиво объяснить свою мысль и правильно воспринимать информацию;</li> <li>исполнительность и реакция на входящий поток задач (тикеты, мониторинг, звонки, нотификации, чаты и т.п.), поиск решения из существующих, эскалация проблем при необходимости;</li> <li>способность работать в обстановке частой смены контекста;</li> <li>базовые навыки работы с консолью: умение найти/проверить конфигурацию компонента;</li> <li>знание основ Linux/Unix: конфиг в etc/, логи в log/, и т.п.</li> </ul> <p><strong>Дополнительными преимуществами будут:</strong></p> <ul> <li>хорошее понимание процесса разработки от запроса клиента до выкатки в прод, знание мест различных систем в нем;</li> <li>опыт работы с production-платформами и системами;</li> <li>опыт работы с иностранными клиентами;</li> <li>опыт работы в enterprise-компаниях продолжительное время;</li> <li>умение отстаивать свою позицию и предлагать идеи, которые улучшат работу всей команды, а, может быть, и всего мира.</li> </ul> <p>Мы открыты к диалогу и ставим личные достижения не ниже профессиональных - ваши личные преимущества могут быть не указаны выше, но будут не менее интересны для нас.</p> <p><strong>Цели, которые стоят перед нами:</strong></p> <ul> <li>построение клиентоориентированного и ориентированного на результат технического саппорта - мы стремимся к обеспечению наилучшего сервиса в финтехе;</li> <li>обеспечение высокой степени автоматизации рутинных процессов - мы хотим сосредоточить больше внимания на конкретных потребностях клиентов и проактивной поддержке;</li> <li>погружение в обширную область знаний и предметную область финансовых рынков - эту возможность дает сочетание работы технического саппорта с работой аналитиков, QA, инженеров и других отделов;</li> <li>приведение процессов предоставления сервиса к ITIL-based методологиям - считаем, что организация работы внутри обеспечивает внешний системный success.</li> </ul> <p><strong>Стек нашей разработки:</strong></p> <ul> <li>Backend: Java 8, AWS SDK;</li> <li>Misc: используем Jira для управления задачами, Maven как систему сборки проектов, реализуем CI/CD Bitbucket + Git как систему контроля версий, Junit4 + AssertJ + Mockito для тестов.</li> </ul> <p>Готовы вместе с нами сделать следующий шаг в вашей карьере?</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.211","name":"Поддержка, Helpdesk","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"121","name":"Специалист технической поддержки"}],"code":"REF40R","hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"52729","name":"Devexperts","url":"https://api.hh.ru/employers/52729?host=hh.ru","alternate_url":"https://hh.ru/employer/52729","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=52729&host=hh.ru","trusted":true},"published_at":"2021-11-15T08:25:00+0300","created_at":"2021-11-15T08:25:00+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48149665","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48149665","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}