{"id":"48217906","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Рублёвское шоссе","building":"28","description":null,"lat":55.747829,"lng":37.42562,"raw":"Москва, Рублёвское шоссе, 28","metro":null,"metro_stations":[]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Привет!</p> <p><strong>Мы VK Pay – умное приложение ваших денег.</strong></p> <p>Наша команда строит финтех-платформу, которая соединяет многомиллионную онлайн-аудиторию покупателей, что ищет выгоду от покупок - с тысячами продавцов, кто ищут современные способы привлекать и удерживать потребителя</p> <p><strong>О компании:</strong></p> <p>1. Мы строим и развиваем механизмы бесшовной интеграции платежных методов (таких как карта, бонусная программа, рассрочка) покупателя в сайт продавца - чтобы покупки всегда были удобными. Наш чекаут значительно повышает конверсии в покупку по сравнению с традиционными способами сбора платежей.</p> <p>2. Мы развиваем партнерские отношения с финансовыми организациями, чтобы процесс покупки был выгодным при оплате как своими, так и кредитными средствами. Мы эффективны в своих процессах, а значит можем переложить эту эффективность в лучшую цену, так как выигрываем на частоте совершаемых покупок.</p> <p>3. Мы строим умные механизмы таргетирования, чтобы потребитель всегда мог найти выгодное предложение продавца. Мы круглосуточно ищем для клиентов наиболее выгодные предложения от разных продавцов и наших банков-партнеров.</p> <p>Каждый месяц мы обслуживаем 35 млн операций более 18 млн своих клиентов и хотим стать самым удобным и безопасным механизмом выгодных расчетов.</p> <p>Нас порядка 450 сотрудников и мы ищем крутых коллег, которые подойдут нам как по скиллам, так и по личностным качествам. В нашей компании работают выходцы из ВКонтакте, Мэйл.ру, Яндекса, Алиэкспресс и других классных компаний. Наша команда, действительно, одна из самых крутых и амбициозных на рынке.</p> <p>Мы пользуемся возможностями больших компаний, которые являются нашими акционерами, но в нас силён дух стартапа, поэтому, никаких излишних бюрократических моментов, полное доверие и поддержка друг друга. Нам важна простота в коммуникациях, отсутствие подковёрных игр и чинопочитания. Часто нам приходит в голову идея и мы пилим её сразу же, понимая, что она супер крутая.</p> <p>У нас много партнеров: Aliexpress, Mail.Ru, МегаФон, Yota, фасилитаторы/агрегаторы типа PayOnline, Qiwi, Робокасса, Ecommpay, ArsenalPay и другие.</p> <p><br /><strong>Основной стек: </strong><br />Greenplum, Postgres, Apache NiFi, Apache Kafka, Qlik Catalog</p> <p><strong>Обязанности:</strong></p> <ul> <li>Проектирование и разработка ETL пайплайнов, а также витрин данных для моделирования и аналитики.</li> <li>Оптимизация процессов загрузки, преобразования данных, мониторинг сборки витрин.</li> <li>Предоставление экспертной поддержки по логике расчета витрин, атрибутов.</li> <li>Поддержка сопроводительной документации, развитие базы знаний.</li> </ul> <strong>Требования:</strong> <ul> <li>Знание SQL на продвинутом уровне (желательно в контексте Greenplum/Postgres).</li> <li>Опыт разработки витрин данных.</li> <li>Опыт выстраивания аналитических процессов от этапа сбора данных до конечного пользователя, системный подход.</li> <li>Понимание современных технологических стеков для работы с данными, умение выбирать наиболее оптимальные решения в рамках текущих ограничений.</li> <li>Внимание к деталям, внимательность.</li> <li>Высшее техническое или специальное образование.</li> <li>Не менее 2 лет работы в качестве Data Engineer/ETL Developer/ Data Analyst.</li> </ul> <p><strong>Что мы предлагаем:</strong></p> <ul> <li>Заработная плата выше рынка – готовы выслушать твои ожидания;</li> <li>Свободное время начала рабочего дня (в среднем, народ собирается с 10-12, но это не жёстко);</li> <li>Можно работать удалённо и посещать офис только в случае крайней необходимости или, по желанию, из офиса;</li> <li>Крутой офис класса «А» в 12 минутах ходьбы от метро Молодёжная с корпоративным трансфером каждые 15 минут;</li> <li>Фрукты, печеньки, кола, готовые завтраки, дошираки, крутая кофемашина с отличным кофе и куча других &quot;плюшек&quot;;</li> <li>Настольный теннис и футбол, шкаф с литературой, велопарковка и душ;</li> <li>Новые мощные MacBook Pro для комфортной работы;</li> <li>Медицинское страхование со стоматологией;</li> <li>Льготные условия кредитования и ипотеки;</li> <li>Мы любим, когда люди растут. Поэтому, мы компенсируем затраты на профильную литературу, отправляем наших ребят на онлайн и оффлайн конференции;</li> <li>Конечно же, полностью белое оформление согласно ТК РФ.</li> </ul> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"ETL"},{"name":"Kafka"},{"name":"Greenplum"},{"name":"Apache NiFi"},{"name":"Qlik Catalog"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.420","name":"Администратор баз данных","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5313148","name":"VK Pay","url":"https://api.hh.ru/employers/5313148?host=hh.ru","alternate_url":"https://hh.ru/employer/5313148","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3771883.png","240":"https://hhcdn.ru/employer-logo/3771884.png","original":"https://hhcdn.ru/employer-logo-original/832750.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5313148&host=hh.ru","trusted":true},"published_at":"2021-11-15T11:08:28+0300","created_at":"2021-11-15T11:08:28+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48217906","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48217906","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}