{"id":"48276696","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data privacy engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Ленинградский проспект","building":"36с10","description":null,"lat":55.788515,"lng":37.567482,"raw":"Москва, Ленинградский проспект, 36с10","metro":null,"metro_stations":[]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><em><strong>BUYK</strong> launched a fast-driven delivery service of goods in New York, USA</em></p> <p><em>Our team now is over 200 professionals in Russia and USA and our plans are to multiply these numbers by the end of the year.</em></p> <p><em>We are now looking for a result-driven Data privacy engineer to set up the processes of data policy implementation within the product development and release cycles.</em></p> <p><strong>Key tasks:</strong></p> <ul> <li>Develop and implement solutions to ensure privacy policies are correctly implemented. The implementations should advance compliance with legal forms of data use as well as support business use of data.</li> <li>Work to align advanced technologies and Privacy by Design principles from the first stages of development and ensure that the data use meets established regulatory compliance needs.</li> <li>Collaborate with data product development teams creating new uses of data that employ privacy features.</li> <li>Interacting with internal privacy program managers, product development teams, legal, compliance, governance and data protection teams.</li> <li>Analyze, design and program software enhancements for new data streams with a goal of developing technical solutions and systems to help mitigate privacy vulnerabilities and prevent potential future privacy risks.</li> <li>Responsible for assisting with the management of the data privacy, data protection, data usability, performance and the integrity of the privacy solution.</li> <li>Using current programming language and technologies, creates a solid design, writes code, completes programming, and performs testing and debugging of applications as well as completes documentation and procedures for installation and maintenance.</li> <li>Interact with users to define system requirements and/or necessary modifications to new or existing software.</li> <li>Interface with other developers and architects in implementing big data solutions that enable the business to be data driven while protecting the data assets.</li> <li>Interface with usability team to ensure user-facing privacy controls are usable</li> <li>Use data anonymization, pseudonymization and encryption to develop systems that preserve and improve privacy protections.</li> <li>Guide the development of new privacy products and features.</li> <li>Identify areas of improvement in local practices relative to managing data privacy.</li> <li>Performs regular privacy assessments of operational processes, identifying, and mitigating risks across the company through effective tools, training and guidance</li> <li>Communicates program progress, escalations, and issue analysis to key stakeholders</li> <li>Acts as key interface to data science and analytics communities both within and outside of the organization</li> </ul> <p><strong>Our expectations:</strong></p> <ul> <li>Excellent analytical and problem solving skills.</li> <li>Excellent communication skills (verbal and written), ability to influence without authority.</li> <li>Ability to balance risks in ambiguous and complex situations.</li> <li>Demonstrated teamwork and collaboration skills, in particular in leading or contributing to global and multi-functional teams.</li> <li>Highly motivated to contribute and grow within a complex area of emerging importance.</li> <li>Experience or understanding of software applications design tools and languages</li> <li>Understanding of design for software applications running on multiple platforms.</li> <li>Understanding of testing, coding and debugging procedures.</li> <li>Demonstrated working knowledge of software engineering fundamentals.</li> <li>Competent in the interpretation of numeric data, an understanding of statistical principles.</li> <li>Data literacy: finding and managing data, cleansing data, manipulating data.</li> <li>Ability to perform operations on large datasets</li> <li>BS or MS degree in computer science, computer engineering, information systems, privacy engineering or related field of study.</li> <li>CIPT, CDPSE, CISSP or other relevant certification</li> <li>Strong software development skills.</li> <li>Excellent communication and presentation skills and the ability to effectively communicate designs, proposals, and results; and negotiate options at management levels</li> <li>5 years&#39; experience in privacy/data protection or a graduate degree or concentration in privacy engineering</li> </ul> <p><strong>What we offer:</strong></p> <p>- All the usual benefits and compensations: VHI (stomatology incl), annual bonus</p> <p>- An opportunity to deal with the high-level and great motivated professionals</p> <p>- A chance to implement and to enhance a new service for the US market to improve the life being of people</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Project management"},{"name":"Analytical skills"},{"name":"Software Development"},{"name":"Risk management"},{"name":"GDPR"},{"name":"CIST"},{"name":"Data Privacy"},{"name":"CDPSE"},{"name":"CISSP"},{"name":"Data literacy"},{"name":"Privacy by design"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.110","name":"Компьютерная безопасность","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.270","name":"Сетевые технологии","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.274","name":"Системы автоматизированного проектирования","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"10","name":"Аналитик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5403422","name":"Buyk","url":"https://api.hh.ru/employers/5403422?host=hh.ru","alternate_url":"https://hh.ru/employer/5403422","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5403422&host=hh.ru","trusted":true},"published_at":"2021-10-25T14:55:19+0300","created_at":"2021-10-25T14:55:19+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48276696","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48276696","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}