{"id":"48498853","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Middle QA Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Задачи:</strong></p> <ul> <li> <p>Тестировать iOS и Android приложения в связке с фитнес трекерами и умными часами.</p> </li> <li> <p>Проверять импорт и обработку данных из Apple Health, Google Fit, Samsung Health и др источников.</p> </li> <li> <p>Испытывать алгоритмы анализа данных, сверять генерируемые UI тексты с ТЗ и здравым смыслом.</p> </li> <li> <p>Инспектировать настройки админки и их корректность в пользовательском опыте.</p> </li> <li> <p>Проводить эксплораторное, регрессионное, функциональное и юзабилити тестирование.</p> </li> <li> <p>Создавать и обновлять документацию, тест-кейсы и тест-планы.</p> </li> </ul> <p><strong>Требования:</strong></p> <ul> <li> <p>У тебя есть год+ опыта тестирования мобильного приложения на iOS или Android.</p> </li> <li> <p>Тебе приходилось тестировать Back-end: prod\\staging, настройки админки, дэшборды.</p> </li> <li> <p>Умеешь находить в логах важное. Знакомы с debugging proxy для анализа http запросов, например с Charles или аналогов. Если не знаешь - наши ребята подскажут.</p> </li> <li> <p>Если знаешь как писать SQL запросы — сильный плюс, если нет - научим читать, а потом и писать.</p> </li> <li> <p>Умеешь писать и поддерживать тест-кейсы, хорошо владеешь теорией тестирования и знаешь, как создать оптимальные варианты тестов.</p> </li> <li> <p>Владеешь таблицами, например Google Sheets: ориентируешься в базовых функциях, форматировании, формулах.</p> </li> <li> <p>Будет здорово, если у тебя есть фитнес трекер или часы и ты в теме цифрового ЗОЖ.</p> </li> </ul> <p>P.S. Если ты подходишь лишь под некоторые из требований выше или наоборот, как говорится, overqualified, то всё равно - подавай анкету. Мы гибкие в предлагаемых условиях и куда важнее результат тестового, чем традиционный опыт по резюме.</p> <p><strong>Условия:</strong></p> <ul> <li> <p>Welltory — приложение №1 в России про здоровье. 3M+ юзеров, 40k ☆☆☆☆☆ оценок, core audience - США. Среди коллег: учёные + data science, разработка продукта, редакция контента, маркетинг и поддержка. Пользователи говорят, что мы меняем их жизни к лучшему, наши данные тоже. Работать с нами — это плюс в карму, об этом приятно рассказать друзьям.</p> </li> <li> <p>Будешь работать в QA направлении: тимлид, команда регрессионного тестирования, команда функционального тестирования, команда автоматизации и ты, наш новый QA инженер ❤️. Также в твоём распоряжении будут удобные инструменты для работы и коллеги, которые всегда подскажут, если ты чего-то не знаешь.</p> </li> <li> <p>В команде QA мы выкатили сотни релизов, наваяли тысячи кейсов. Нам приходится проверять пульс у помидора, имитировать сон в рабочее время, замедлять сердце с помощью дыхания и лежать на полу, чтобы сделать ортопробу. Мы лично оттестировали все рекомендации по облегчению похмелья.</p> </li> <li> <p>Мы американская компания, платим net. Отпуска и отгулы не ограничены и не контролируются. У тебя будет гибкий график и свобода физического местонахождения.</p> </li> <li> <p>Хорошо работающие процессы. Еженедельные спринты для всех команд. Подробнее посмотреть тут https://twitter.com/ppravdin/status/1035520362807734274</p> </li> <li> <p>Ты окажешься в команде заряженных и очень профессиональных людей, снабдим прикольными гаджетами и обеспечим все условия для роста.</p> </li> <li> <p>Про компанию, про то, кто мы и чем занимаемся, куда идем и какие задачи решаем, вы можете послушать в подкастах наших фаундеров — Павла Правдина (https://podcasts.google.com/feed/aHR0cHM6Ly93d3cudWhud2lkYXRhLmNvbS9kZW4tb2YtcmljaD9mb3JtYXQ9cnNz/episode/NWY0YTNhNGE5NjZiOGQ0OGYyNjllZDk0OjVmNWRmOWM3NmJhOWMzMjJiMWMwOTFlZDo2MDgxNTYxMDlmNDVjZDc0Njc2MzgyMGU) и Евгении Смородниковой (https://www.youtube.com/watch?v=6o6JbMzVkko).</p> </li> <li> <p>Удаленка или офис в Петербурге, ходить туда не обязательно, но знайте — там очень уютно: виды на крыши Петроградки, работающий камин, мини-апарт-отель для наших сотрудников из других городов и стран.</p> </li> <li> <p>Компания не торгует данными пользователей, не зарабатывает ни на каких «партнерствах», не занимается скрытой рекламой и прочим беспощадным ecommerce. Мы работаем для наших пользователей, они платят нам деньги, точка.</p> </li> </ul> <p><strong>Дополнительно:</strong></p> <p>Чтобы подать заявку на вакансию — заполните анкету и выполните тестовое задание по ссылке https://welltory.typeform.com/to/BEHr7knH</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Работа в команде"},{"name":"Charles"},{"name":"Kanban"},{"name":"TestRail"},{"name":"Zephyr"},{"name":"Atlassian Jira"},{"name":"Asana"},{"name":"Redmine"},{"name":"Trello"},{"name":"soft skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.117","name":"Тестирование","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"124","name":"Тестировщик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2416804","name":"Welltory","url":"https://api.hh.ru/employers/2416804?host=hh.ru","alternate_url":"https://hh.ru/employer/2416804","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/789298.png","240":"https://hhcdn.ru/employer-logo/3598084.png","90":"https://hhcdn.ru/employer-logo/3598083.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2416804&host=hh.ru","trusted":true},"published_at":"2021-11-23T16:09:44+0300","created_at":"2021-11-23T16:09:44+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48498853","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48498853","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}