{"id":"48814275","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Business analyst","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>We are looking for an experienced Business Analyst / Project manager who will strengthen the Operational Effectiveness team in leading cross-functional business-process improvement and automation initiatives aimed to support Xometry EU departments in rocketing company growth.</strong></p> <p><strong>With us, you will get extremely hands-on experience in the emerging industry 4.0 environment by managing projects with very short time-to-business-value. You will be supported by a highly professional and motivated team of professionals and be embraced with highly respectful and multicultural corporate culture gently combining the best of Russian and European worlds.</strong></p> <p><strong>Who are we?</strong></p> <p><strong>Xometry is the world’s largest on-demand production platform that is disrupting the manufacturing industry. Through our platform, companies have the chance to easily request and obtain individual quotations to meet their production needs. Our international network of over 6,000 production partners enables us to offer a wide range of processing technologies: CNC processing, sheet metal processing, 3D printing and others. We deliver the final parts after a strict quality assurance process and our customers can always track the status of their requests. Xometry’s customers include BMW, Bosch, Dell Technologies, General Electric and NASA.</strong></p> <p><strong>The platform</strong></p> <p><strong>The platform (ERP system for internal business processes + Customer front + Suppliers front) is built 100% in-house and tightly integrated with many 3rd party cloud-based services (e.g. Pipedrive, Zendesk, Slack, Retool, Looker and much more). Currently, the European Technology team is 17 people in size and we prefer keeping it small and blazing fast. We serve all European business operations which are independent of the US business served by another tech team of ~80. We are building the uber-like platform for manufacturing, deploying updates almost every working day, so there is a lot of interesting work to be done.</strong></p> <p><strong>Responsibilities</strong></p> <ul> <li> <p><strong>Manage several business-process improvement initiatives, providing full-cycle service: </strong></p> <ul> <li> <p><strong>Identifying process-related issues, performing team members interviewing, data analysis alone or with data analytics team support</strong></p> </li> <li> <p><strong>Defining solutions and agreeing with stakeholders.</strong></p> </li> <li> <p><strong>Implementing changes (including trainings for team members, on-the-go process/product adjustments and documentation)</strong></p> </li> <li> <p><strong>Providing further support and continuous improvement processes.</strong></p> </li> <li> <p><strong>If needed, taking active part in process automations (setting-up business requirements/ active participation in setting up technical requirements, testing products etc.)</strong></p> </li> <li> <p><strong>If needed, taking active part in business development negotiations and managing relations with engaged counterparties (e.g. delivery services providers).</strong></p> </li> <li> <p><strong>If needed, take part in the recruitment process. </strong></p> </li> </ul> </li> <li> <p><strong>Support Management in strategic and tactical decision-making/ take active part in implementation of subsequent initiatives, sometimes temporarily taking over tactical management responsibilities. </strong></p> </li> <li> <p><strong>Play the role of a cross-functional integration agent and mediator, who is aware of different areas of company operations and therefore able to find holistic problems solutions optimal at company level. To do so, you will closely interact with Business departments as customers (Sales/ Operations / Partner network management / Finance) and with IT Product and Data-analytics team as peers and support.</strong></p> </li> </ul> <p><strong>Successful candidate has</strong></p> <ul> <li> <p><strong>Combined Technical and Entrepreneurial mindset and (at least) bachelor degree in technical or economy science.</strong></p> </li> <li> <p><strong>3+ years of experience in business analysis and project management with proven records of successfully achieved goals in business-improvements in growing digital businesses IS A MUST.</strong></p> </li> <li> <p><strong>Product and business sense. Strong advantage will be industrial experience or long-term project deployment in at least one of the following areas:</strong></p> <ul> <li> <p><strong>Uber-like on-demand marketplace services </strong></p> </li> <li> <p><strong>ERP or similar systems integrations</strong></p> </li> </ul> </li> <li> <p><strong>Strong communication and interpersonal skills to exercise power without authority.</strong></p> </li> <li> <p><strong>Strong presentation and training skills. </strong></p> </li> <li> <p><strong>Understanding principles of unit economy, user behaviour analysis, finding insights and presenting outcomes to the management.</strong></p> </li> <li> <p><strong>Confident knowledge of mathematics and basic knowledge of mathematical statistics. Technical experience in data analysis with SQL and Python will be a plus.</strong></p> </li> <li> <p><strong>Understanding basics of web development tech stack, programming background is also a plus.</strong></p> </li> <li> <p><strong>Team player mentality experienced in cross-functional teams, sufficient English for an international company.</strong></p> </li> <li> <p><strong>Ready to work in a startup environment with continuously evolving goals.</strong></p> </li> </ul> <p><strong>Languages</strong></p> <ul> <li> <p><strong>Russian full proficiency (must)</strong></p> </li> <li> <p><strong>English full proficiency (must) </strong></p> </li> <li> <p><strong>German and/or any other European language - is a plus</strong></p> </li> </ul> <p><strong>Work conditions</strong></p> <ul> <li> <p><strong>Russian speaking remote team in a large international company.</strong></p> </li> <li> <p><strong>Successful startup (120 people in Europe) inside the world market leader (450 people in total).</strong></p> </li> <li> <p><strong>Home Office full-time / a long-term contract as Individual Entrepreneur.</strong></p> </li> <li> <p><strong>Relocation to Munich is possible in a 2-year perspective.</strong></p> </li> <li> <p><strong>Compensation (fixed in euro) is negotiable with each candidate.</strong></p> </li> </ul> <p> </p> <p><strong>Examples of problems to be solved:</strong></p> <p><strong>Operational Processes Optimization</strong></p> <p><strong>Our sales depend on customer satisfaction, which depends on on-time supply production with no claims. It consequently depends on operational processes, which in this order depends on Manufacturers network coherent cooperation. </strong></p> <p><strong>Task: Identify bottlenecks and critical success factors in operational business processes and design a system of preventive controls to avoid customer claims/delays. </strong></p> <p><strong>Remote Quality control</strong></p> <p><strong>Quality is the must in our business, and we secure it by additional quality control of produced parts in our own Quality laboratory. But due to exponential growth, we can not afford to check every part for the sake of economy and time efficiency. </strong></p> <p><strong>Task: re-engineer the process which at target state will within exponential growth of production will keep limited operational costs without sacrificing high quality standards. </strong></p> <p><strong>Sales-to-Ops Service Level Agreement</strong></p> <p><strong>It is a never ending story of how to sell more with lower prices, faster production and tighter deadlines. And to adjust it every time the business environment changes.</strong></p> <p><strong>Task: setting up a framework of service-level-agreement for various types of customers/orders that enables providing stable and expectable levels of service, corrective feedback loop, sustainable resource planning and continuous improvement. </strong></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Project management"},{"name":"SQL"},{"name":"Английский язык"},{"name":"Customer Service"},{"name":"ERP Implementation"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"12.251","name":"Реинжиниринг бизнес процессов","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.331","name":"Управленческое консультирование","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.92","name":"Информационные технологии","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.197","name":"Организационное консультирование","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.280","name":"Стратегия","profarea_id":"12","profarea_name":"Консультирование"},{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3592447","name":"Xometry Europe GmbH","url":"https://api.hh.ru/employers/3592447?host=hh.ru","alternate_url":"https://hh.ru/employer/3592447","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3364673.png","90":"https://hhcdn.ru/employer-logo/3364672.png","original":"https://hhcdn.ru/employer-logo-original/730897.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3592447&host=hh.ru","trusted":true},"published_at":"2021-11-19T07:28:44+0300","created_at":"2021-11-19T07:28:44+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48814275","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48814275","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}