{"id":"48817572","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Head of Talent Acquisition / Recruiting Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Quadcode</strong> is an international IT company developing software for the trading and investment industry. Our clients are brokerage companies and financial institutions.</p> <p>We have 7 years of experience, and during that time, 50 million traders have appreciated the benefits of our products.</p> <p>The Quadcode team consists of more than 750 professionals working in our offices in Russia, Cyprus, Australia and Gibraltar (the Russian team in St. Petersburg consists of more than 450 professionals). 70% of our employees are developers. We write in Go, PHP, C++, Scala, Python, and Java. We practice microservice architecture and respect Agile.</p> <p>We are on the hunt for an experienced people leader to join us, who will bring top talents to the teams and create technical and hiring processes that deliver at scale.<br /><br />Recruiting is a core strategic driver of our company’s success. The<strong> Head of Talent Acquisition</strong> will be responsible for managing two teams of talent sourcers and recruiters, who share a common passion for hiring the best talents, creating memorable candidate experiences, and solving tricky challenges in partnership with our Engineering, Product, and other leads.</p> <p>We are a fast-moving and ever-evolving organization, but you’ll need to introduce longer-term strategies to make sure we are always in the position to identify who our teams needs, as well as when, and where they will have the most impact. You’ll partner with our VP Engineering and other leads to define how recruitment works at Quadcode. This will include elements of our employer brand initiatives, planning and hiring processes, salaries, and onboarding.</p> <p> </p> <p><strong>Responsibilities</strong></p> <ul> <li>Oversee the engagement, management, and development of high-performing teams in a fast-paced and ambitious environment.</li> <li>Assume responsibility for setting team performance goals and metrics, timelines, and a formal tracking process to measure and manage progress.</li> <li>Liaise closely with Product, Engineering, and Business leaders to influence and deliver a quality assessment and candidate experience through all aspects of the recruitment funnel.</li> <li>Act as a talent advisor for technology recruiting and sourcing, while also developing the continuous company and talent mapping in key tech areas.</li> <li>Ensure that every candidate has a positive and engaging experience through all stages of the interview process.</li> <li>Maintain data integrity and report recruiting metrics (we use Huntflow ATS + Tableau).</li> <li>Collaborate with our partners and other leaders within the organization to strategize different ways to build talent pipelines and execute tactical research, referral generation, events, and sourcing campaigns.</li> </ul> <p><strong>Requirements</strong></p> <ul> <li>5+ years of full-cycle recruiting experience, ideally in a top-tier software company with an excellent engineering talent bar.</li> <li>3+ years experience leading technical recruitment function.</li> <li>Proven experience in identifying and engaging senior-level candidates.</li> <li>Experience using talent market insights and data to influence decisions within leadership groups and cross-functional teams.</li> <li>Demonstrated track record of building working relationships with leaders and cross-functional partners.</li> <li>Strong coaching and mentoring skills.</li> <li>Passion and understanding of technology.</li> <li>Excellent verbal and communication skills.</li> <li>Fluency in Russian and English level B2+ (Upper-Intermadiate+) – essential.</li> </ul> <p><strong>Our Offer as your future employer:</strong></p> <ul> <li>You can choose the format of work – remote or in the office (St. Petersburg).</li> <li>Very attractive financial package that will match your competence and experience.</li> <li>Extended Benefit Package: VMI with dental and travel insurance, lunches compensation, gifts for birthdays, anniversaries, corporate gym, English language courses and other corporate benefits.</li> <li>The opportunity to attend conferences and courses at the company&#39;s expense – we support the continued development of our employees.</li> <li>Flexible processes, flexible hours, a democratic atmosphere towards people.</li> <li>Opportunities for professional growth – we have huge ambitions and it is important that our employees grow with us.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"6.254","name":"Рекрутмент","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"},{"id":"6.319","name":"Управление персоналом","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"},{"id":"6.247","name":"Развитие персонала","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"}],"professional_roles":[{"id":"69","name":"Менеджер по персоналу"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1876072","name":"Quadcode","url":"https://api.hh.ru/employers/1876072?host=hh.ru","alternate_url":"https://hh.ru/employer/1876072","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/883666.png","240":"https://hhcdn.ru/employer-logo/3975364.png","90":"https://hhcdn.ru/employer-logo/3975363.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1876072&host=hh.ru","trusted":true},"published_at":"2021-11-19T21:23:26+0300","created_at":"2021-11-19T21:23:26+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48817572","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48817572","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}