{"id":"48921780","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Business Technology Analyst","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":null,"to":300000,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>This position is responsible for connecting business stakeholders with high impact technology solutions (from our internal technology Product Lines or external capabilities), managing local technology delivery and supporting the Business Technology Leader (BTL) to shape Product Line strategy development.</p> <p>Playing a hands-on role putting technology into practice, she/he defines business requirements for market needs, carries out business analysis for regional MVPs evolving in a market, scales out regional solutions and delivers local market-led projects using technology.</p> <p>While the role will have a domain focus on <em>data and analytics </em>to provide an expert point of contact, the role focus is on business problems and opportunities which will require a broad understanding of our business and solutions landscape to bring about end-to-end business process solutions.</p><br /><strong>Key responsibilities:</strong> <ul> <li>Be a technology partner, working with business stakeholders to identify unmet needs, propose IT solutions, and assist management in the development of business cases and project charters;</li> <li>Be a business analyst, leading the technical discovery process for potential projects, scoping needs, gathering requirements and producing functional specifications for a solution build, based on regional and global standards, using our agile rRDM methodology (rapid Requirements Definition &amp; Management);</li> <li>Build deep market knowledge by forming internal partnerships with the business (developing deep insights into their needs) and external partnerships with e.g. start-ups, academics (to build health technology market knowledge);</li> <li>Explore &amp; experiment with business-led IT projects and external technology developments to scope and rapidly pilot new single-market specific solutions, identifying solutions worth scaling up within the regional Product Lines. Collaborate with Product Line teams to build and test regional MVPs when selected as a ‘lead market’;</li> <li>Manage the delivery of local projects, collaborating with the business &amp; Product Line teams to localise regional company requirements/solutions and drive effective change management by involving the right people at the right time;</li> <li>Represent IT with external partners and customers and consult on selection and approval of third-party service providers;</li> <li>Ensure technology projects are built and documented in accordance with the strict compliance regulations of company and healthcare, including information security, privacy and GxP as required;</li> <li>Take a regional view on technology solutions, building a good understanding of business practice in other countries through a network of IT colleagues, in order to leverage or create harmonised solutions where possible;</li> <li>Proactively match business needs with existing company technology capability, by showcasing local/regional best practice with key stakeholders, encouraging adoption of core systems and harmonised process and highlighting value in a business context;</li> <li>Shape Product Line roadmaps by identifying opportunities/gaps where company Technology can deliver, influencing internally and externally to drive Product Line strategy execution;</li> <li>Support the Business Technology Leader to challenge the business and encourage innovation, whilst managing business expectations.</li> </ul> <strong>Key requirements:</strong> <ul> <li>Degree in Computer Science/Business Information Systems, Engineering or related discipline;</li> <li>Solid experience in delivering data &amp; analytics solutions and platforms in pharma;</li> <li>Certification in Business Analysis (e.g. ISEB Business Analysis Diploma) and Project Management (e.g. PRINCE2, APMP) areas is beneficial;</li> <li>Current or very recent role is business facing;</li> <li>Expert in data &amp; analytics technology components, including data management capabilities, data flow architectures, data visualisation platforms like Qlik, dataiku etc;</li> <li>Good understanding of technical capabilities under data science process and data security and integrity;</li> <li>10+ years relevant experience, of which 5 years are business facing IT related;</li> <li>Proven track record of delivery in complex, ambiguous and changing environments, adhering to essential regulatory and compliance guidelines;</li> <li>Able to influence across a range of business roles and stakeholder seniorities;</li> <li>Effective team working;</li> <li>Ability to build effective relationships with customers, matrix teams, suppliers, partners etc.;</li> <li>Clear written and verbal communication skills;</li> <li>Good at facilitating workshops and meetings, and negotiating;</li> <li>Genuine passion for technology, understanding how things work and for applying technology to bring value to businesses/customers;</li> <li>Continuous learner, able to demonstrate a familiarity with current trends e.g. AI, Quantum computing, Docker/Kubernetes etc;</li> <li>Capable to take a “hands-on approach” to experiment and try things if needed;</li> <li>Can communicate effectively with technical and non-technical stakeholders at different levels;</li> <li>Clear thoughts expression in Russian and English business language.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Agile Project Management"},{"name":"Project management"},{"name":"Английский язык"},{"name":"MS PowerPoint"},{"name":"Business Analysis"},{"name":"Qlik"},{"name":"Business intelligence"},{"name":"Business Intelligence Systems"},{"name":"Business Strategy"},{"name":"PRINCE2"},{"name":"Business English"},{"name":"Business Planning"},{"name":"Analytical skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2009","name":"Antal Russia","url":"https://api.hh.ru/employers/2009?host=hh.ru","alternate_url":"https://hh.ru/employer/2009","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/430509.png","90":"https://hhcdn.ru/employer-logo/2164106.png","240":"https://hhcdn.ru/employer-logo/2164107.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2009&host=hh.ru","trusted":true},"published_at":"2021-10-18T12:32:15+0300","created_at":"2021-10-18T12:32:15+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48921780","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48921780","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}