{"id":"48924705","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"PandaOmics Global Product Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"Insilico Medicine develops software that leverages generative models, reinforcement learning (RL), and other modern machine learning techniques for the generation of new molecular structures with specific properties. Insilico Medicine also develops software for the generation of synthetic biological data, target identification, and the prediction of clinical trials outcomes. The company integrates two business models; providing AI-powered drug discovery services and software through its Pharma.AI platform and developing its own pipeline of preclinical programs. The preclinical program is the result of pursuing novel drug targets and novel molecules discovered through its platforms. Since its inception in 2014, Insilico Medicine has raised over $52 million and received multiple industry awards. Insilico Medicine has also published over 100 peer-reviewed papers and has applied for over 25 patents.<br /><br />PandaOmics is a web-based tool specifically designed to empower pharma drug and target discovery pipelines. PandaOmics combines omics, text and chemistry databases in a single solution available online at https://insilico.com/pandaomics<br /><br />One of the core features of PandaOmics is a target ID tool. It utilizes the information relevant to a particular disease from multiple publicly available sources including omics-based network methods, 3D structure availability, information on the known inhibitors and drugs, clinical trials, grants, patents and scientific publications and outputs the ranked list of therapeutic target hypotheses along with the supporting evidence.<br /><br /><strong>Job Description</strong><br /><br />The company is seeking to find a Product Manager to coordinate the development and marketing efforts rolling out PandaOmics worldwide. The person will coordinate development efforts in Russia, Taiwan and Hong Kong, interface the scientists and licensing, and establish partnership relations in the top academic institutions, biotech and pharmaceutical companies.<br />Pubmed Record: https://www.ncbi.nlm.nih.gov/pubmed/?term=insilico%2Bmedicine<br /><br /><strong>What you will be doing:</strong> <ul> <li>Lead PandaOmics product strategy. Develop customer/product requirements, drawing from the field, customer feedback, and internal Bioinformatics/Application scientist teams, and evaluate trade-offs</li> <li>Create and manage release plans, deeply understand and manage dependencies</li> <li>Coordinate and align with cross-functional teams (software engineering, bioinformatics, QA, sales and BD, product design), leverage strong leadership, planning, communication, and collaboration skills.</li> <li>Communicate technical problems and solutions clearly to all levels and roles across the company</li> <li>Ensure we deliver impactful, well-supported, customer-friendly products</li> <li>Interact with the key customers, present the tool to external and internal stakeholders</li> </ul> <strong>Knowledge, Skills And Experience Required</strong> <ul> <li>Expertise in bioinformatics, biology, genomics, or a related field (Advanced scientific or computer science degree is preferred). At least basic understanding of the therapeutic target discovery process is required.</li> <li>Experience in delivering software products.</li> <li>Ability to manage competing priorities, balance short term and long term trade-offs, and efficiently meet timelines; focus on execution and ability to drive work to completion.</li> <li>Excellent communication skills, both oral and written (English).</li> <li>Design sense and ability to understand and empathize with customers.</li> <li>Structured and analytic thought process; experience translating data into actions.</li> <li>Experience working with the pharma customers. Candidates with proven experience of pharmaceutical dealmaking will be prioritized</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Product Management"},{"name":"bioinformatics"},{"name":"Presentation skills"},{"name":"Английский язык"},{"name":"Public Speaking"},{"name":"Product Marketing"},{"name":"Machine Learning"},{"name":"Analytical skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"14.37","name":"Биотехнологии","profarea_id":"14","profarea_name":"Наука, образование"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2009224","name":"Insilico Medicine","url":"https://api.hh.ru/employers/2009224?host=hh.ru","alternate_url":"https://hh.ru/employer/2009224","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/520577.png","240":"https://hhcdn.ru/employer-logo/2523786.png","90":"https://hhcdn.ru/employer-logo/2523785.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2009224&host=hh.ru","trusted":true},"published_at":"2021-11-23T13:15:13+0300","created_at":"2021-11-23T13:15:13+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48924705","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48924705","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}