{"id":"48943258","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Senior Tech (IT) Recruiter","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":197550,"to":null,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>ABOUT THE ROLE</strong></p> <p>We are looking for an exceptionally driven and experienced Technical Recruiter to hire across Tech at Revolut. From Backend Engineers to Data Scientists, you will be constantly challenged to think creatively in order to drive hiring results. You will work closely with technical leaders, hiring managers and the recruitment team to plan and execute innovative hiring strategies, helping bring the worlds top A-Players to Revolut. We need someone who is results driven and has the drive to Get It Done, no matter the challenge.</p> <p> </p> <p>**This role can be Moscow-based or fully Remote</p> <p><strong>WHAT YOU&#39;LL BE DOING</strong></p> <ul> <li>Hiring our technical A-Players across Revolut</li> <li>Own the full cycle recruiting process including sourcing, interviewing and closing candidates</li> <li>Work directly with our technical experts and stakeholders to bring the best candidates to the pipelines</li> <li>Contribute to the development of interview, on-boarding and training processes</li> <li>Build and own the strategy to recruit at a high volume and fast pace</li> </ul> <p><strong>WHAT YOU’LL NEED</strong></p> <ul> <li>Agency or relevant In-House experience in building tech teams (at least 4-5 years)</li> <li>Deep understanding of the Tech hiring landscape and complexity of global talent markets</li> <li>Ability to communicate effectively and concisely with candidates and the interview team throughout the hiring process</li> <li>Results driven with proven experience recruiting top talent at scale</li> <li>Ability to set priorities and take action facing competing demands</li> <li>Love for problem solving: work with data to make strategic and tactical decisions</li> </ul> <p> </p> <p> </p> <p><strong>A little about us</strong>…When Revolut was founded in 2015, we had a vision to build a sustainable, digital alternative to traditional big banks. Our mission now is to help our customers improve their financial health, empower them to have more control, and promote financial cohesion across the communities in which we operate. Launching into 2020 with 10 million Personal customers and over a quarter of a million Business customers only reinforced our belief in the vast need across the world for better financial services. As our customer base has boomed in the last year, we’ve expanded our team to match that growth. We started 2019 with several hundred employees; we closed it out with 2000.</p> <p> </p> <p><strong>What we’re looking for</strong>…Revolut is being scaled up by people all around the world who share our vision. We’re looking for people who align with our five core values: we believe that we Get it Done because we Think Deeper and are strongly rooted in the Dream Team. We Never Settle hence why we always Deliver Wow. You want to join a community forward thinking people - we are here for you. We believe in empowering our Revoluters in their work, giving them autonomy and ownership of what they do. We want everyone at Revolut to own their story and their successes - working with us means you’re not just another cog in the machine.</p> <p> </p> <p><strong>The benefits</strong></p> <p>• Competitive salary</p> <p>• Quarterly bonuses based on performance</p> <p>• Roll with a free Revolut Metal subscription</p> <p>• All the latest technology you need to deliver excellent work</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Recruitment"},{"name":"Business Strategy"},{"name":"Английский язык"},{"name":"IT Recruitment"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"6.254","name":"Рекрутмент","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"},{"id":"5.106","name":"Коммерческий банк","profarea_id":"5","profarea_name":"Банки, инвестиции, лизинг"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2167982","name":"Revolut","url":"https://api.hh.ru/employers/2167982?host=hh.ru","alternate_url":"https://hh.ru/employer/2167982","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/707852.png","90":"https://hhcdn.ru/employer-logo/3272524.png","240":"https://hhcdn.ru/employer-logo/3272525.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2167982&host=hh.ru","trusted":true},"published_at":"2021-11-20T19:41:03+0300","created_at":"2021-11-20T19:41:03+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48943258","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48943258","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}