{"id":"48962536","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Support Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Требования</strong></p> <ul> <li> <p>Тебе нравится общаться с людьми, решать проблемные вопросы и приносить пользу. Ты постоянно развиваешь в себе эмпатию, эмоциональный интеллект и рациональное мышление.</p> </li> <li> <p>У тебя все хорошо с письменной коммуникацией на русском и английском языках: ты умеешь объяснять сложные вещи простыми словами; составлять краткие, но исчерпывающие гайды; излагать мысли последовательно и грамотно.</p> </li> <li> <p>Ты умеешь гуглить, выделять главное в большом объеме информации, делать выводы на основе данных. Не боишься задавать вопросы, самостоятельно принимать решения, ставить привычные процессы под сомнение и придумывать новые.</p> </li> <li> <p>Дополнительный плюс — опыт работы в службе поддержки, SMM, комьюнити менеджменте или смежных областях.</p> </li> </ul> <p>Если тебе интересна эта вакансия, но ты подходишь лишь под некоторые из требований выше или, наоборот, чувствуешь себя overqualified, — все равно подавай анкету. Мы гибкие в предлагаемых условиях, и для нас куда важнее результаты тестового, чем традиционный опыт по резюме.</p> <p><strong>Задачи</strong></p> <ul> <li> <p>Текстом отвечать на обращения пользователей (чат, email, соцсети).</p> </li> <li> <p>Отвечать на отзывы пользователей в App Store и Google Play.</p> </li> <li> <p>Проводить первичные расследования проблем пользователей (анализ пользовательских действий, поведения приложения, логов); работать с инструментами аналитики и админками внутренних систем.</p> </li> <li> <p>Анализировать пользовательский опыт, улучшать и дополнять справочные материалы для пользователей (на русском и английском языках).</p> </li> <li> <p>Структурировать обратную связь от пользователей и передавать информацию продуктовой команде; формулировать кейсы на основе данных, ставить четкие и понятные задачи по улучшению пользовательского опыта в другие команды.</p> </li> <li> <p>Пополнять и обновлять внутреннюю базу знаний.</p> </li> <li> <p>Улучшать рабочие процессы, тестировать и внедрять инструменты автоматизации.</p> </li> </ul> <p><strong>Условия</strong></p> <ul> <li> <p>Welltory — приложение №1 в России про здоровье. 3M+ пользователей, 40k+ ☆☆☆☆☆ оценок, core audience в США. Твоими коллегами будут команды science и data science, продуктовой разработки и тестирования, контента, маркетинга. Пользователи говорят, что мы меняем их жизни к лучшему. И наши исследования это подтверждают. Работать с нами — это плюс в карму, об этом приятно рассказывать друзьям.</p> </li> <li> <p>Мы американская компания, платим net, работаем с ИП. У тебя будет гибкий график и свобода физического местонахождения. А также свобода в выборе дней для «перезагрузки» — days off не ограничены и предоставляются за счет компании.</p> </li> <li> <p>Ты будешь работать в команде поддержки пользователей. Саппорт в Welltory — это не только 40k+ обработанных обращений в мобильном чате и 12k+ ответов на отзывы в сторах. Еще мы влияем на развитие приложения через сбор и анализ пользовательского фидбека (в нашем продукте есть фичи, разработку которых инициировал саппорт), улучшаем пользовательский опыт через создание help-системы и предрелизное тестирование новых фич, помогаем университетам проводить научные исследования. Сейчас в команде тимлид и три саппорт-инженера. И мы очень ждем четвертого — тебя!</p> </li> <li> <p>Мы не любим бюрократию, ценим хорошо работающие процессы и не боимся их менять. Гарантируем политику прозрачности со стороны фаундеров с ежеквартальной отчетностью обо всех важных аспектах жизни компании.</p> </li> <li> <p>Ты окажешься в команде заряженных и очень профессиональных людей, которым не все равно. В твоем распоряжении будут удобные инструменты и коллеги, которые всегда готовы ответить на вопросы и прийти на помощь. Ты поймешь, что рассказывать о факапах — не страшно, а инициатива — не наказуема. Ты узнаешь, как по одной жалобе проверять проблему на массовость, зачем саппорту пользоваться софтом для дизайнеров и какой вопрос стоит задавать себе в любой (даже понятной) ситуации.</p> </li> <li> <p>Про компанию, про то, кто мы и чем занимаемся, куда идем и какие задачи решаем, можно послушать в подкастах наших фаундеров — Павла Правдина и Евгении Смородниковой</p> </li> <li> <p>Компания не торгует данными пользователей, не зарабатывает ни на каких «партнерствах», не занимается скрытой рекламой и прочим беспощадным ecommerce. Мы работаем для наших пользователей, они платят нам деньги, точка.</p> </li> <li> <p>У нас есть офис в Петербурге. Ходить туда необязательно, но он очень уютный: виды на крыши Петроградки, работающий камин, мини-апарт-отель для приезжающих в гости сотрудников из других городов и стран.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Грамотная речь"},{"name":"Работа с большим объемом информации"},{"name":"Техническая поддержка"},{"name":"Asana"},{"name":"Atlassian Jira"},{"name":"Kanban"},{"name":"Soft skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.211","name":"Поддержка, Helpdesk","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"121","name":"Специалист технической поддержки"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2416804","name":"Welltory","url":"https://api.hh.ru/employers/2416804?host=hh.ru","alternate_url":"https://hh.ru/employer/2416804","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/789298.png","240":"https://hhcdn.ru/employer-logo/3598084.png","90":"https://hhcdn.ru/employer-logo/3598083.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2416804&host=hh.ru","trusted":true},"published_at":"2021-10-19T12:13:19+0300","created_at":"2021-10-19T12:13:19+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48962536","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48962536","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}