{"id":"48996826","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"DevOps Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Ленинградское шоссе","building":"16Ас2","description":null,"lat":55.821573,"lng":37.498725,"raw":"Москва, Ленинградское шоссе, 16Ас2","metro":{"station_name":"Войковская","line_name":"Замоскворецкая","station_id":"2.30","line_id":"2","lat":55.818923,"lng":37.497791},"metro_stations":[{"station_name":"Войковская","line_name":"Замоскворецкая","station_id":"2.30","line_id":"2","lat":55.818923,"lng":37.497791}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>As the tech firm that created the mobile world, and with more than 54,000 patents to our name, we’ve made it our business to make a mark. When joining our team at Ericsson you are empowered to learn, lead and perform at your best, shaping the future of technology. This is a place where you&#39;re welcomed as your own perfectly unique self, and celebrated for the skills, talent, and perspective you bring to the team. Are you in?</p> <p>Come, and be where it begins.</p> <p> </p> <p><strong>Our Great Opportunity!</strong></p> <p>Ericsson is growing! Now we are looking for a proactive, dynamic and competent senior DevOps engineer for the open position in Moscow with the following skills and experience levels.</p> <p> </p> <p><strong>You will</strong></p> <ul> <li>Implement integrations requested by customers</li> <li>Deploy updates and fixes</li> <li>Provide Level 2 technical support</li> <li>Develop automation tools to improve build and delivery efficiency</li> <li>Develop software to integrate with internal back-end systems</li> <li>Perform root cause analysis for production errors</li> <li>Investigate and resolve technical issues</li> <li>Develop scripts to automate visualization</li> <li>Design procedures for system troubleshooting and maintenance</li> <li>Developing tools and process to drive and improve customer experience</li> <li>Mentor and groom juniors and get job done</li> </ul> <p> </p> <p><strong>To be successful in the role you must have</strong></p> <ul> <li>Bachelors in Engineering (B.E/ B.Tech in IT/Telecom)</li> <li>6-8 years of experience working in DevOps role Technical Skills:</li> <li>Good hands-on knowledge of Configuration Management and Deployment tools like – Puppet, Ansible, Chef, Terraform etc.</li> <li>Work experience in container orchestration services especially Dockers, Kubernetes</li> <li>Significant experience with Windows and Linux operating system environments</li> <li>Experience with infrastructure scripting solutions such as PowerShell or Python</li> <li>Knowledge of one cloud platform (AWS, Azure, GCP)</li> <li>Knowledge of best practices and IT operations in an always-up, always-available service</li> <li>Experience with or knowledge of Agile software development methodologies</li> <li>Experience in Big data technologies (HDFS, Apache Hadoop, Apache Spark),</li> <li>Experience in DB technologies (SQL and NoSQL)</li> <li>Experience with tools and concepts related to data and analytics, ETL, reporting tools, data governance, data warehousing, structured and unstructured dataH</li> </ul> <p>Non-Technical Skills:</p> <ul> <li>Very good English level</li> <li>Excellent oral and written communication skills with a keen sense of customer service</li> <li>Excellent problem-solving and troubleshooting skills</li> <li>Organized person with great documentation skills</li> <li>Ability to communicate up and down in his hierarchy</li> <li>Negotiation and conflict resolution</li> </ul> <p> </p> <p><strong>What´s in it for you?</strong></p> <p>Here at Ericsson, our culture is built on over a century of courageous decisions. With us, you will no longer be dreaming of what the future holds – you will be redefining it. You won’t develop for the status quo, but will build what replaces it. Joining us is a way to move your career in any direction you want; with hundreds of career opportunities in locations all over the world, in a place where co-creation and collaboration are embedded into the walls. You will find yourself in a speak-up environment where empathy and humanness serve as cornerstones for how we work, and where work-life balance is a priority. Welcome to an inclusive, global company where your opportunity to make an impact is endless.</p> <p> </p> <p><strong>What happens once you apply? </strong></p> <p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p> <p>Do you believe that an organization fostering an environment of cooperation and collaboration to execute with speed creates better business value? Do you value a culture of humanness, where fact based decisions are important and our people are encouraged to speak up? Do you believe that diverse, inclusive teams drive performance and innovation? At Ericsson, we do.</p> <p>We provide equal employment opportunities without regard to race, color, gender, sexual orientation, transgender status, gender identity and/or expression, marital status, pregnancy, parental status, religion, political opinion, nationality, ethnic background, social origin, social status, Indigenous status, disability, age, union membership or employee representation and any other characteristic protected by local law or Ericsson’s Code of Business Ethics.</p> <p> </p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"PowerShell"},{"name":"Hadoop"},{"name":"Linux"},{"name":"Terraform"},{"name":"Английский язык"},{"name":"3PP"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.277","name":"Сотовые, Беспроводные технологии","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.295","name":"Телекоммуникации","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"76","name":"Ericsson","url":"https://api.hh.ru/employers/76?host=hh.ru","alternate_url":"https://hh.ru/employer/76","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/785757.png","240":"https://hhcdn.ru/employer-logo/3583920.png","90":"https://hhcdn.ru/employer-logo/3583919.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=76&host=hh.ru","trusted":true},"published_at":"2021-10-20T11:36:57+0300","created_at":"2021-10-20T11:36:57+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=48996826","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/48996826","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}