{"id":"49026674","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Sales Consultant Russia (m/f/d)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>WHAT WE DO AT PLANRADAR</strong></p> <p>We’re digitising construction and real estate projects in more than 60 countries worldwide. As a B2B SaaS provider, we’re bringing a software solution to industries that are vital to the way we all live – yet they’re often behind the curve when it comes to technology. We relish that challenge because when we partner with a client, the impact on their business is larger than they ever imagined.</p> <p>In March 2020, PlanRadar raised €30 million in Series A funding to help launch the next stage of our company’s growth. We’re an award-winning scale-up with big plans for global expansion, and Russia is a key piece of that puzzle. We’re on the hunt for experts who know the region inside out and can help us make an impact.</p> <p><strong>YOUR PLACE IN THE TEAM</strong></p> <p>PlanRadar might be an Austrian company but we strive to provide a local experience for each of our customers. As a member of our Sales team for Russia, you’ll be based out of our modern office in the heart of Moscow. We’re situated right in the center of town, close to the best of what the city has to offer: great restaurants, bars, music and more.</p> <p>As a vital part of our Sales team, there’s a lot of room for creativity and personal development, with training available to help you reach your full potential. There’s space to test your ideas and to collaborate with your colleagues from other regions and departments. Your role also comes with a competitive salary and an uncapped performance-related bonus.</p> <p>PlanRadar promises an inclusive, engaging and exciting place to work. We are inquisitive minds who challenge the status quo, with a drive to change our client’s industry for the better. Our people matter the most, and we regularly conduct surveys and implement changes to ensure our benefits and the way we work reflects the culture that we promote. If you’re courageous and ready for a new adventure, join PlanRadar!</p> <p><strong>WHAT YOU‘LL GET TO DO </strong></p> <p>As a Sales Consultant for Russia, you will be building our customer base in one of our most exciting regions. You’ll take on warm customer leads generated in-house and will develop and execute the sales process. From acquisition to presentation to closing, you’ll be at the forefront of our growth throughout the region. Over time, you’ll become an expert on the product and on the needs of your customers. While collaborating with other departments, you’ll develop your own style of pitching and negotiating, taking into account our diverse customer segments.</p> <p>This is a fantastic opportunity for someone craving ownership and eager to have a huge impact on a fast growing scale-up in the B2B SaaS space!</p> <p><strong>Among other things you will</strong></p> <ul> <li>Actively contact leads and execute the sales process in a creative and professional way</li> <li>Drive the acquisition of new B2B customers and develop our existing customers in the region (developers, construction and engineering companies, architects, property owners and facility managers)</li> <li>Conduct product demonstrations (online and face 2 face) and help potential clients to onboard the software</li> <li>Have a sharp understanding of data when reporting results</li> <li>Are responsible for achieving sales targets and revenue</li> <li>Bring a responsible, accurate and results-driven working style to the team</li> </ul> <p><strong>Who you are</strong></p> <ul> <li>Our ideal candidate has a proven track record in sales and enjoys pitching, presenting and negotiating deals</li> <li>You have a Bachelor or Master&#39;s degree preferably related to business, management, IT or Engineering sector</li> <li>You should be sociable, sales-oriented and flexible</li> <li>You love to learn and can motivate yourself to achieve within a busy B2B Sales team</li> <li>You have experience with (or are interested in) the IT, construction or real estate industries</li> <li>You have excellent spoken and written Russian language skills and a good understanding of business English</li> <li>You’re very comfortable working with PCs and are quick to pick up new software</li> </ul> <p><strong>WHAT WE OFFER</strong></p> <ul> <li>Room for personal and professional development</li> <li>Challenging and diversified line of action</li> <li>Working in a fast-growing company with international customers and investors</li> <li>Office in the center of Moscow</li> <li>Motivated and agile team with a common vision</li> <li>Performance-related career system with competitive and progressive base salary</li> <li>Uncapped bonus based on a success-related bonus scheme depending on net sales received</li> <li>Support from an experienced buddy during the onboarding phase</li> <li>Ongoing external sales training by experienced coaches</li> <li>Additional benefits like team events, free drinks &amp; snacks, …</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Teamplayer"},{"name":"Английский язык"},{"name":"Sales Skills"},{"name":"Presentation skills"},{"name":"Business English"},{"name":"MS Outlook"},{"name":"MS PowerPoint"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.112","name":"Компьютерные программы","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.306","name":"Торговый представитель","profarea_id":"17","profarea_name":"Продажи"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4490420","name":"PlanRadar","url":"https://api.hh.ru/employers/4490420?host=hh.ru","alternate_url":"https://hh.ru/employer/4490420","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4490420&host=hh.ru","trusted":true},"published_at":"2021-11-23T09:38:55+0300","created_at":"2021-11-23T09:38:55+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49026674","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49026674","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}