{"id":"49027226","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Sales Manager (O&G, Digital)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>GE (NYSE:GE) drives the world forward by tackling its biggest challenges. By combining world-class engineering with software and analytics, GE helps the world work more efficiently, reliably, and safely. GE people are global, diverse and dedicated, operating with the highest integrity and passion to fulfill GE’s mission and deliver for our customers</p> <p><strong>Responsibilities:</strong></p> <p>• Establish a deep understanding of customers’ business needs by creating value to customers for our Digital solution footprint. Solicit new business and / or retain and penetrate existing business in order to drive growth.<br />• Develop and execute an Account Playbook that formalizes the “go high / go low” strategy for the Enterprise account. Where applicable, develop a joint Governance process with executive sponsorship that aligns along the following pillars – Commercial, Product/Technology, Implementation and Support.<br />• Develop a world-class account management strategy Develop a value selling framework for GED Digital business in O&amp;G and Chemicals — tailor deal lifecycle, deliverables, required resources, technology support, maturity model, sales methodology etc., all focused on meeting the Customer and shareholder objectives.<br />• Develop and drive the strategic growth vision and objectives, including participating in essential operating rhythm processes with product management, engineering and services. Implement the execution framework on identified opportunities, which includes the orders forecasting to deal closure.<br />• Establish, cultivate and maintain customer relations at appropriate decision-maker levels. Lead the development of sales opportunities and coordinate with the business lines sales support groups.<br />• Drive Commercial process improvements and leverage tools for growth (SFDC, etc). Analyzes sales pipeline and maintains an array of opportunities to ensure that sales goals are achieved<br />• Actively grow and maintain a multi-year account plan that will be shared globally with parts of our business including Marketing, Product Management, Sales, Professional Services, and the Development teams to ensure coordination across the business.<br />• Ensuring a Professional Sales Experience for customers during all aspects of sales process and touch points including: Formal meeting agendas, formal follow-up stating sequence of events and next steps in writing, and issue resolution in a timely fashion.<br />• Formulates the winning proposals based on a cohesive strategy that leverages deep knowledge of O&amp;G industry, customer and GE product.</p> <p><strong>Requirements:</strong></p> <p>• Bachelor’s Degree in business, science, engineering, technology or related discipline.<br />• 7+ years’ experience in software sales, management consulting, or strategic planning in O&amp;G, with proven track record of value selling.<br />• Proactively identifies trends via data analysis and makes strategic recommendations as appropriate.<br />• Manage account relationships to proactively identify and address client needs and converts competitive installs to GED solutions; Seen by client as strategic partner who brings values and solutions to address clients’ business needs.<br />• Languages: Candidate should be able to speak, read, and write in Russian and English.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Business Development"},{"name":"Project management"},{"name":"Presentation skills"},{"name":"Strategic Planning"},{"name":"Sales Skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.625","name":"Решения по автоматизации процессов","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.324","name":"Управление продажами","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.149","name":"Менеджер по работе с клиентами","profarea_id":"17","profarea_name":"Продажи"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"228","name":"GE (General Electric Company)","url":"https://api.hh.ru/employers/228?host=hh.ru","alternate_url":"https://hh.ru/employer/228","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2230228.png","90":"https://hhcdn.ru/employer-logo/2230227.png","original":"https://hhcdn.ru/employer-logo-original/447065.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=228&host=hh.ru","trusted":true},"published_at":"2021-10-21T09:51:01+0300","created_at":"2021-10-21T09:51:01+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49027226","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49027226","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}