{"id":"49038575","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Sales / Account Executive (SaaS)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>ApprovalMax</strong> is an innovative cloud approval workflow system that enables spend control and optimization for organizations of all sizes. We are hiring an experienced Sales / Account Executive to help us provide the first class support for our customers. If you&#39;re a dedicated, ambitious, easy-going person with great communication skills, ApprovalMax is an excellent place to grow your career.</p> <p>You are a driven and enthusiastic individual who is experienced in selling b2b SaaS solutions. You will be at ease operating across the entire sales cycle, with a strong emphasis on new business sales. As Account Executive,<strong> you will be challenged with driving substantial growth of our product across the Australia/New Zealand Geographies and part of Asia (working hours as per Ausrtalian and New Zealand time zones)</strong>. You will exceed your targets by driving new opportunities from first interaction to closing and creating and maintaining a good sales pipeline to ensure achievement. You will be responsible for all inbound traffic of big leads on your territory but your main focus will be on growing revenue based on different outbound activities. Key to your success in the role will be delivery against monthly, quarterly and annual targets with a strong focus on accurate forecasting and pipeline management.</p> <p>As Account Executive, you will report directly to the Head of Sales and day to day you will be supported by our Business Development, Marketing, Customer Success and Sales Engineering teams in pursuit of your overarching goal to land and subsequently expand customer accounts.</p> <p> </p> <p><strong>Responsibilities:</strong></p> <ul> <li>Create and manage a strategic territory plan that includes activities for quota attainment</li> <li>Initiate telephone, email, LinkedIn, Zoom contact with existing and potential customers, qualify opportunities, cold calling as needed.</li> <li>Make research to find possible customers and continue with detailed research of customers to find needed people.</li> <li>Maximize coverage within the defined region</li> <li>Ensure and maintain sales forecasting data in the sales reporting system to allow for opportunity management and reporting.</li> <li>Drive revenue and contribute to the continued growth of ApprovalMax through consistently achieving individual and team quotas</li> <li>Maintain and promote a successful and positive work environment</li> <li>Stay abreast of current industry trends, competitors, and current/new company products and services.</li> <li>Other duties as assigned</li> </ul> <p><strong>Requirements:</strong></p> <ul> <li>3+ years’ experience and proven track record of accomplishment in selling IT solutions, preferably SaaS</li> <li>Previous experience in the areas of finance solutions is desirable</li> <li>Fully fluent in English in a business context</li> <li>Strong interest in the ApprovalMax business Domain with keen focus on market trends and customer needs.</li> <li>Good organizational skills, a self-starter who has experience in managing multiple initiatives simultaneously, passion for start-up like environment.</li> <li>Ability to acquire in-depth knowledge of a client’s business, identifying challenges and opportunities as well as how to position solutions to address those needs</li> <li>Demonstrates deep product and industry knowledge including market trends and competitive intelligence</li> <li>Exceptional written, verbal, and interpersonal communication skills with stakeholders</li> <li>Superior presentation skills.</li> <li>Proven ability to manage sales with multiple decision makers.</li> <li>Proven record of building and managing a sales pipeline and achieving/exceeding quota.</li> <li>Proven record of matching customers’ needs with solutions.</li> </ul> <p> </p> <p><strong>We offer:</strong></p> <ul> <li>Remote work for a German-based international company</li> <li>Employment in a very fast growing dynamic company</li> <li>Modern energetic multicultural environment</li> <li>Interesting people, an excellent team of professionals</li> <li>Extensive opportunities for professional growth and career development</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Sales Management"},{"name":"Market Research"},{"name":"Business Development"},{"name":"Negotiation skills"},{"name":"Sales Forecasting"},{"name":"SaaS"},{"name":"Customer Relationship Management"},{"name":"Account Management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.225","name":"Продажи","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.246","name":"Развитие бизнеса","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3135379","name":"ApprovalMax","url":"https://api.hh.ru/employers/3135379?host=hh.ru","alternate_url":"https://hh.ru/employer/3135379","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2345937.png","90":"https://hhcdn.ru/employer-logo/2345936.png","original":"https://hhcdn.ru/employer-logo-original/476021.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3135379&host=hh.ru","trusted":true},"published_at":"2021-11-23T11:20:08+0300","created_at":"2021-11-23T11:20:08+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49038575","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49038575","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}