{"id":"49068646","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"IT Infrastructure Manager [Remote]","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Our company is Cloud Linux Inc. - the maker of the #1 OS for web-hosting providers. We develop our products -- CloudLinux OS, KernelCare, Imunify360, and Imunify Email -- using the most innovative technologies. Our products are used by thousands of companies around the world, including Dell, GoDaddy, IBM, Zoom, and many others.</p> <p>If you want to apply your expertise and well-honed skills in the field of IT and:</p> <ul> <li>are driven by passion to Linux,</li> <li>thrive on solving the most complex security challenges</li> <li>want a unique opportunity to grow and contribute</li> <li>in an exciting and rewarding environment</li> </ul> <p>then we want to meet you!</p> <p><strong>Your impact</strong></p> <ul> <li>Develop and lead the team of IT engineers to carry out the support for internal staff and global systems. Organize and prioritize work to ensure critical issues are being addressed in an acceptable timeframe and in compliance with internal SLA&#39;s.</li> <li>Purchase efficient and cost-effective technological equipment and software. Communicate with the vendors, oversee the budget.</li> <li>Manage the infrastructure operations and lead the team of DevOps experts to manage the CloudLinux RND tools (software, hardware, OS, peripherals).</li> <li>Responsible for managing, planning, coordinating, and monitoring of Service functions, personnel, and software.</li> <li>Managing Jira system for tracking incidents, problems, change, assets, and knowledge base; addressing any issues; and making recommendations for improvement.</li> <li>Maintain the security of the infrastructure at the level of certification requirements</li> </ul> <p><strong>Your tool box</strong></p> <ul> <li>5+ years of operational experience in RND support and in IT Infrastructure.</li> <li>3+ years of IT management experience including communication with hardware vendors and data centers</li> <li>Deep understanding of supporting Linux platform (on premise and cloud)</li> <li>RND-focused, with an ability to understand and manage engineers expectations.</li> <li>Demonstrated management and decision-making skills concerning Information Technology policies, processes, and procedures.</li> <li>Experience in making SLA’s, OKR’s, and reports for metrics to make data-driven decisions.</li> <li>Project Management experience running projects from planning to completion. Track record of completing tasks and/or projects within budget and on schedule.</li> <li>Very strong verbal and written communication skills, including ability to communicate and collaborate effectively with diverse groups of people.</li> <li>Understanding of overall business and IT strategy and ability to develop solutions with management at all levels.</li> <li>Ability to build trust with internal stakeholders on all technical levels.</li> <li>Strong organizational and time management skills with the ability to manage multiple tasks and projects in a high-pressure environment.</li> <li>Ability to troubleshoot and support/drive issues to resolution, root cause analysis with strong analytical/problem-solving abilities.</li> <li>Experience in a remote IT environment and in managing remote team members.</li> <li>Self-driven and highly passionate about providing excellent service.</li> <li>Drive for excellence in own work, learning, and cooperation with end-users/colleagues/employees.</li> </ul> <p><strong>What is for you?</strong></p> <ul> <li>A great opportunity for professional development within the young and fast-growing company</li> <li>Interesting and challenging projects</li> <li>Knowledge-Exchange</li> <li>Remote work with long-term employment on a full-time basis under contract</li> <li>High-level compensation based on the product impact reviews</li> <li>Compensation in US dollars</li> <li>Flexible working hours</li> <li>Paid 24 vacation days per year and sick leaves</li> <li>Partially medical insurance</li> <li>Days off on national holidays</li> <li>English educational programs (Lingua-Leo online course &amp; Speaking Club);</li> <li>individual coach sessions;</li> <li>ability to study and attend seminars and training according to the request;</li> <li>co-working and gym/sports compensations (according to the company policy);</li> <li>the opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul> <p>Let’s make it a win-win for you and CloudLinux. Do not put off until later - apply today and our team will gladly welcome you.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Project management"},{"name":"Linux"},{"name":"Английский язык"},{"name":"Atlassian Jira"},{"name":"Time management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"116","name":"Специалист по информационной безопасности"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1245452","name":"Cloud Linux","url":"https://api.hh.ru/employers/1245452?host=hh.ru","alternate_url":"https://hh.ru/employer/1245452","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1614523.png","90":"https://hhcdn.ru/employer-logo/1614522.png","original":"https://hhcdn.ru/employer-logo-original/293033.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1245452&host=hh.ru","trusted":true},"published_at":"2021-11-22T15:19:41+0300","created_at":"2021-11-22T15:19:41+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49068646","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49068646","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}