{"id":"49083083","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Head of Demand Generation and Growth","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Smartcat </strong>is the operating system for the global translation industry. Our team believes that the world becomes ever-more connected and interdependent. The borders that prevent people from trading, working together, and exchanging knowledge and innovations erode over time. That is the future we want to live in. Our mission is to speed up the pace at which that happens, building the best platform for Connected Translation. We don’t believe automation will render language professionals obsolete. Instead, we place powerful software into the hands of the millions of people working to globalize their own industries, plug them into our global supply network, and enable continuous delivery of multilingual content. With tens of thousands of customers and hundreds of thousands of freelancers translating together on Smartcat, we are well on our way.</p> <p><strong>Head of Demand Generation and Growth Mission</strong></p> <p>The job’s mission is to drive outbound marketing activities. You’ll be responsible for generating traffic from paid and unpaid sources, presenting our products in ways that will strengthen our brand and boost sales. Creative and quantitative thinker familiar with various acquisition techniques and concepts such as lead generation, ABM marketing, and sales sequences.</p> <p><strong>Your outcomes are:</strong></p> <ul> <li> <p>33% QoQ growth in online acquisition. You should be able to create plans and execute them in order to capture leads across all channels, including paid and unpaid, leading to quarter-on-quarter exponential growth in product qualified leads.</p> </li> <li> <p>Monitoring and reporting campaign performance with granular tracking across relevant KPIs, including but not limited to impressions, clicks, web visitors, video views, collateral downloads, qualified leads, initial sales conversations, and revenue.</p> </li> <li> <p>Optimize digital marketing campaigns across multiple channels with compelling messages working in close collaboration with content creators.</p> </li> </ul> <p><strong>Requirements:</strong></p> <ol> <li> <p>At least 3 years of experience in B2B SaaS marketing with lead generation responsibilities.</p> </li> <li> <p>Experience in creating and executing SEO strategies. SEO for marketplaces and blogs is a huge advantage.</p> </li> <li> <p>Deep experience in implementing and experimenting with new lead generation tactics and funnel development using such tools as Linkedin Ads, Google Ads, Facebook. Experience with Baidu, Yandex, and other local search engines is an advantage.</p> </li> <li> <p>Experience in outbound: email marketing, Linkedin, Wechat.</p> </li> <li> <p>A data-driven approach to business. Ability to justify decisions using models and metrics</p> </li> <li> <p>Experience working in a highly dynamic startup environment, where you can make big things happen by turning thoughts into action.</p> </li> <li> <p>Experience working with remote teams.</p> </li> <li> <p>Integrity and full commitment.</p> </li> <li> <p>Growth mindset.</p> </li> <li> <p>Openness to constructive feedback and the opinions and ideas of others.</p> </li> </ol> <p><strong>Why joining Smartcat might be your best move so far</strong></p> <ul> <li> <p>The ongoing rise of the content economy is causing a massive shift in the language industry. All today’s megatrends — big data, artificial intelligence, machine learning — are converging in it at lightning speed. Smartcat’s disruptive business model taps into this $50b industry with a market network where buyers and suppliers connect, collaborate, and leverage our free-to-use workflow SaaS. The next decade will be the era of market networks and reinventing the $10 trillion service economy, and we’re pioneering this global transformation in all things language-related.</p> </li> <li> <p>You will enjoy building with us. You will drive changes in how an old-fashioned global language industry operates while improving how hundreds of thousands of people work, and millions of people exchange knowledge and ideas in the world.</p> </li> <li> <p>While the language industry is big and fragmented enough to keep us busy building a billion-dollar company in the next few years, we are already seeing how the network naturally expands to adjacent language and content-related verticals, expanding our TAM and making our journey even more exciting.</p> </li> <li> <p>We are a global team of 100+ enthusiastic people, with hubs in Boston, Amsterdam, Limassol, Moscow, and Hong Kong — and our users and partners are scattered all around the globe. We’re eager to succeed and transform the world of language services for the better. We grow aggressively while preserving our culture of empathy. As diverse as we are, we love working and having fun together, and we’re sure you’ll love working with us too.</p> </li> <li> <p>Smartcat is backed by Matrix Partners, FJ Labs, and other top VC firms focusing on SaaS and marketplace startups (you might recognize names like HubSpot, Zendesk, Uber, Stripe, RigUp, and Quora in their portfolios). This helps us innovate at a fast pace and learn from top professionals in other industries.</p> </li> <li> <p>We are looking for someone who will become a part of the executive team and play a critical role in the most exciting part of our journey from a post-Series B startup to a company exceeding $1b in GMV. Our journey isn’t for the faint of heart. You need to be an extremely fast learner to bring value to our users and the industry as a whole. You need to see the big picture and execute strategies that significantly increase shareholder value over time. We need a sharp mind who can stay two steps ahead on the road with us. We’ve got lots of success to share if you’re ready for it.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Digital Marketing"},{"name":"B2B Marketing"},{"name":"Английский язык"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"3.318","name":"Управление маркетингом","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"},{"id":"3.98","name":"Исследования рынка","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"},{"id":"3.8","name":"PR, Маркетинговые коммуникации","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3230136","name":"Smartcat","url":"https://api.hh.ru/employers/3230136?host=hh.ru","alternate_url":"https://hh.ru/employer/3230136","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2562701.png","240":"https://hhcdn.ru/employer-logo/2562702.png","original":"https://hhcdn.ru/employer-logo-original/530306.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3230136&host=hh.ru","trusted":true},"published_at":"2021-11-11T16:45:17+0300","created_at":"2021-11-11T16:45:17+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49083083","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49083083","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}