{"id":"49080800","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Consultant (Implementation / PLM)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":100000,"to":185000,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":{"city":"Moscow","street":"Dubininskaya ulitsa","building":"57с1","description":null,"lat":55.720307,"lng":37.636715,"raw":"Moscow, Dubininskaya ulitsa, 57с1","metro":{"station_name":"Павелецкая","line_name":"Замоскворецкая","station_id":"2.101","line_id":"2","lat":55.729741,"lng":37.638693},"metro_stations":[{"station_name":"Павелецкая","line_name":"Замоскворецкая","station_id":"2.101","line_id":"2","lat":55.729741,"lng":37.638693},{"station_name":"Серпуховская","line_name":"Серпуховско-Тимирязевская","station_id":"9.37","line_id":"9","lat":55.726548,"lng":37.624792}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Deliver IT solution (Centric 8 Agile) deployment projects on time, per schedule per responsible technical and business goals of company (e.g. out-of-the-box – OOTB configurations, customer business process mapping, and best practice advocacy).</p> <p>Participate in pre-sales activities</p> <p>Involved in possible consulting activities</p> <p>Key Responsibilities:</p> <ul> <li>Provide technical leadership and support to pre-sales and implementation teams in designing and delivering Centric 8 Solutions focused on the Retail.</li> </ul> <p>· Apparel &amp; Footwear Industry and fast moving consumer goods (FMCG) and High-Fashion market.</p> <p>· Manage deployment projects per Centric’s Agile deployment methodology, delivering customer solution model per out-of-the-box Centric 8 (PLM) use cases and configuration points and Centric’s Agile processes.</p> <ul> <li>Conduct customer business process analysis, information modelling, mapping to Centric 8 configurations and interface control definitions with related systems to be integrated, data and process conversion from legacy PDM systems, provide customer guidance on process-system alignment practices, desk top procedures, process-system validation and training and on-going customer care.</li> </ul> <p><em>Specialist skills in system integration, IT tuning, optimization, and installation in enterprise environments.</em></p> <p>Acquire and disseminate FMCG domain and system integration best practices and provide customer scenario details to guide product development, QA, Customer Support groups as needed.</p> <p>Key Activities:</p> <ul> <li>Coordinate and collaborate with customer implementation team and Centric teams to ensure a successful and referenceable delivery.</li> </ul> <p>· Analyze customer business process requirements as a basis to propose Centric 8 (OOTB) Solutions.</p> <p>· Consult, deploy, tune, configure, optimize and install Centric software stack within customer’s IT environment, with a focus on enterprise high availability and system integration dimensions.</p> <p>· Produce written specifications (i.e. UML models, Centric 8 configurations) to capture business process requirements for proposed solutions and configuration activities.</p> <p>· Analyse requirements and design solutions to address customer business scenarios within the product scope.</p> <p>· Ensure clear understanding of customer’s technology requirements; provide support for Proposal and Project teams, provide technical leadership and vision to win and deliver large-scale, complex solutions.</p> <p>· Develop and document Data/Object Model to meet customers’ requirements.</p> <p>· Identify, delegate and execute project tasks including installing and configuring software, deployment training, data migration and deployment support.</p> <p>· Mentor other consultants during the delivery of Centric Software based solutions.</p> <p>· Provide input into future solution functionality, implementation methodology and configuration standards.</p> <ul> <li>Ensure that quality software engineering processes and Agile practices are followed.</li> </ul> <p>POSITION MINIMUM REQUIREMENTS</p> <ul> <li>Bachelors or Master’s Degree, preferably in Computer Science, MIS, Engineering, or similar.</li> </ul> <p>· Minimum of 2 years’ experience with involvement in real-world PLM and enterprise system integration deployments in domain</p> <p>· Experience with FMCG, Apparel and Luxury markets and industry best practices and change management considerations</p> <p>· Proven project management experience as evidenced by successful project delivery</p> <p>· Strong and confident Customer Facing / consulting skills.</p> <p>· <em>Experience in software installation, IT troubleshooting and optimization – Database (SQL Server, Oracle), Application Server (JBoss), experience with load balancing and clustering environments. Skills in performance tuning, optimization, and troubleshooting relative to the software stack web environment.</em></p> <ul> <li>Good English language skills</li> </ul> <p> </p> <p>TECHNICAL COMPETENCIES</p> <ul> <li>Experience with modelling methods and techniques (e.g. UML) and enterprise process and information modelling and modelling in general</li> </ul> <p>· Experience with Windows operating systems</p> <p>· Experience deploying and configuring Web Applications</p> <p>· Experience with web standards and XML,CSS, HTML and JavaScript</p> <p>· Experience with SQL, relational database systems (Oracle and MSSQL)</p> <p>· Experience in enterprise scale usability, performance and enterprise delivery system considerations (J2EE), and enterprise system integration (with ERP).</p> <p>· <em>Experience deploying, tuning and optimizing enterprise scale applications for High Availability performance – e.g. Application Server (JBoss) and Database (SQL Server, Oracle) experience with load balancing and clustering environments</em></p> <p>· MS Office tools including MS Project and Visio, and related scripting languages</p> <p>· Expertise in core technologies including: document management, PLM, system integration, data and process migration and conversion, security and access control, enterprise scalability and performance management, general project management, change management, and customer/ supplier collaboration processes.</p> <ul> <li>Expertise and domain knowledge of the Apparel industry and or Global Product Sourcing and FMCG processes and industry best practices; familiar with authoring tools and practices in domain (e.g. Adobe Creative Suite, OptiTex, etc.).</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"MS SQL"},{"name":"XML"},{"name":"CSS"},{"name":"JavaScript"},{"name":"PLM"},{"name":"Product Lifecycle Management"},{"name":"Управление проектами"},{"name":"Oracle Pl/SQL"},{"name":"Retail"},{"name":"Fashion"},{"name":"Presentation skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"12.251","name":"Реинжиниринг бизнес процессов","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.331","name":"Управленческое консультирование","profarea_id":"12","profarea_name":"Консультирование"},{"id":"12.92","name":"Информационные технологии","profarea_id":"12","profarea_name":"Консультирование"},{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"128908","name":"Accentis CIS","url":"https://api.hh.ru/employers/128908?host=hh.ru","alternate_url":"https://hh.ru/employer/128908","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=128908&host=hh.ru","trusted":true},"published_at":"2021-10-22T17:30:43+0300","created_at":"2021-10-22T17:30:43+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49080800","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49080800","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}