{"id":"49199934","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"DevOps Tech Lead (AWS, Remote, USD)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>ClearScale</strong> (headquartered in San Francisco, California, USA) - AWS Premier Consulting Partner has been offering a full range of professional cloud computing services for <strong>over 10 years</strong>, including architecture design, DevOps automation, refactoring and cloud-native applications development, integration, migration, solving all sorts of security issues (from just a security check to preventing cyber-attacks) and 24/7 technical support using the best advanced technologies.</p> <p>The list of our customers is diverse: from government companies (<strong>ClearScale</strong> is an official cloud partner of the State of California) and educational institutions (University of California, San Francisco) to well-known global brands (IBM, Samsung, GoPro, HP, Conde Nast, Carl Zeiss, etc.) The number of satisfied customers has been well over 850, some of which can be found on the company&#39;s website in the Case Studies section.</p> <ul> <li>We were the <strong>third company</strong> to gain a new <strong>AWS competence:</strong> <strong>Applied AI and Machine Learning Operations (MLOps)</strong>. Less than <strong>15 partners</strong> have this competency!</li> <li>We have confirmed status in the <strong>Database Freedom program</strong> (total less than<strong> 20 companies </strong>in)</li> <li>Proven expertise as a <strong>Managed Services Provider </strong>(total less than<strong> 16 companies</strong> in). This means that ClearScale can perform a full cycle consultancy and service: from audits, system or software development to the 24/7. You can read more about us on the company page - <strong>Managed Services.</strong></li> </ul> <p>Since the very foundation of the company, we work<strong> 100% remotely</strong> from various cities and countries. We work on a high trust basis within the company, therefore we do not monitor work being done via taking screen captures, webcams or log keyboard typing, as many other companies do. The <strong>professional reputation</strong> of our employees is of the <strong>highest value</strong>.</p> <p><strong>Responsibilities</strong></p> <ul> <li>Provide technical leadership for distributed DevOps engineering group;</li> <li>Be responsible for the technical part of successful project delivery as well as architecture proof;</li> <li>Establish effective communication and collaboration with the client and contractors;</li> <li>Analyze requirements and make/review estimates for scope of the work;</li> <li>Create / specify / review architecture designs related to infrastructure and DevOps;</li> <li>Provide tasks to DevOps engineers, check execution and quality standards;</li> <li>Solve complex problems during project implementation;</li> <li>Report to Systems Engineering director on a weekly basis;</li> </ul> <p> </p> <p><strong>Required skills and experience</strong></p> <ul> <li>Experience with <strong>AWS cloud platform</strong>: EC2, VPC, IAM, S3, ECS/EKS, RDS, Lambda and others</li> <li>Experience with <strong>DevOps tools</strong>: CloudFormation/Terraform, Jenkins, Ansible and others</li> <li>Hands-on experience with <strong>Linux/Windows, containers, databases, scripting</strong></li> <li>Ability to work with distributed teams to provide technical <strong>guidance and leadership</strong></li> <li>Excellent <strong>written and verbal</strong> communication skills. Ability to communicate directly with peers, managers, and clients while leading the team</li> <li>Solid understanding of the common challenges with <strong>migrations and modernizations</strong>, the ability to choose the right path based on previous experience</li> <li>Experience of the <strong>full software development lifecycle</strong>: from requirements gathering and functional specification authoring to development, testing and delivery</li> <li>Extensive experience working with l<strong>arge distributed infrastructures</strong></li> <li>Awareness about security standards (<strong>PCI DSS, HIIPA</strong>)</li> <li>Ability to work in a varied, fast-paced environment;</li> <li><em><strong>Desired Technical Certifications (not а must)</strong></em> <ul> <li><em>AWS Certified Solutions Architect Associate / Professional;</em></li> <li><em>AWS Certified SysOps Associate / DevOps Professional;</em></li> </ul> </li> </ul> <p><strong>What we offer</strong></p> <p><strong># 1 Fair wage</strong></p> <ul> <li>Fixed hourly rate in USD</li> <li>Full-time, 40 hours per week contract. It’s your main and permanent place of work, not a freelance job</li> <li>Payments every 2 weeks</li> <li>Annual Hourly Rate Review: received client&#39;s appreciation, obtained an AWS certificate, saved the world?The reward is based on facts, not on a personal attitude</li> <li>Reference program: many engineers joined the team by the recommendation from their friends and former colleagues and we have a reward for this.</li> </ul> <p><strong># 2 Independence </strong></p> <ul> <li>from the office location or office conditions because it&#39;s only up to you where you want to work from - home, office, co-working or outdoors in the woods. The only requirement - fast and reliable internet. At the same time, our engineers do not work evenings or weekends: we focus on your local timezone</li> <li>from any annoyance or big team buzz - we are the community of professional engineers, valuing each others&#39; time and effort</li> <li>from corruption and bureaucracy - we operate in an honest and competitive environment and we are one of the AWS&#39;s top 10 key partners.</li> </ul> <p><strong># 3 Professional Development</strong></p> <ul> <li>Work with innovative Silicon Valley companies and traditional American companies at the cutting edge of digital transformation</li> <li>We work with the newest technologies in AWS cloud and open-source tools, Jira, Confluence, Lucidchart, Slack</li> <li>Constant practice at writing and speaking in English</li> <li>The team which is willing to share its experience</li> <li>Paid AWS certification: we provide training material, paid time off and examination itself</li> <li>Horizontal and vertical career growth - are you ready to be greater, faster, stronger? We keep growing and people keep growing with us</li> <li>A nice bonus if you accept our offer quickly</li> </ul> <ul> <li>Paid education time off</li> <li>English lessons compensation</li> <li>Easy and non-surveillance time tracking</li> <li>Work in the community of passionate professionals with international clients</li> <li>A nice bonus if you accept our offer quickly</li> </ul> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Linux"},{"name":"SQL"},{"name":"Bash"},{"name":"NoSQL"},{"name":"Docker"},{"name":"Kubernetes"},{"name":"Jenkins"},{"name":"AWS"},{"name":"Terraform"},{"name":"CI/CD"},{"name":"Python"},{"name":"Ansible"},{"name":"Английский язык"},{"name":"Amazon EC2"},{"name":"Big Data"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.273","name":"Системный администратор","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1574063","name":"ClearScale","url":"https://api.hh.ru/employers/1574063?host=hh.ru","alternate_url":"https://hh.ru/employer/1574063","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/7789.png","90":"https://hhcdn.ru/employer-logo/1091270.png","240":"https://hhcdn.ru/employer-logo/1091271.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1574063&host=hh.ru","trusted":true},"published_at":"2021-10-27T20:37:32+0300","created_at":"2021-10-27T20:37:32+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49199934","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49199934","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}