{"id":"49232792","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior DevOps Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Минск","street":"проспект Победителей","building":"106","description":null,"lat":53.939577,"lng":27.478845,"raw":"Минск, проспект Победителей, 106","metro":{"station_name":"Немига","line_name":"Автозаводская","station_id":"63.422","line_id":"63","lat":53.905615,"lng":27.55415},"metro_stations":[{"station_name":"Немига","line_name":"Автозаводская","station_id":"63.422","line_id":"63","lat":53.905615,"lng":27.55415}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>About Us</strong></p> <p>At IHS Markit, we are building a software solution that connects data in revolutionary ways, illuminating answers that were previously impossible to find and empowering our clients to envision<strong> </strong>the future, so they can determine the best course of action in the present. We are disrupting the current digital transformation landscape with state-of-the-art AI developed by a passionate team explore and push the boundaries of digital transformation technologies.</p> <p>Our development team architect and design high-availability, scalable, and fault tolerant systems that are decoupled and easy-to-maintain. A core part of our development philosophy revolves around Microservices and the DevOps model. All our new products are developed using a microservice architecture, are containerized, and are then deployed on container management systems such as Kubernetes. The developers on our teams subscribe to a DevOps model where time-to-market functions as a vital measure of our performance, productivity, and success. We are committed to stay ahead of the curve and we are always looking at new technologies that can enhance our product offerings.</p> <p> </p> <p><strong>Position Summary</strong></p> <p>IHS Markit is seeking an experienced, driven, DevOps Engineer based in Denver, CO who will report to the Assistant Director of Software Development for our currently unreleased digital transformation solution. The DevOps engineer is responsible for build-out, configuration, deploy, scale, orchestration, and monitoring to support infrastructure and our release pipeline for global commercial software platforms. You are in possession of a passion for container-based technologies, immutable infrastructure, and continuous delivery practices in deploying global, commercial software. You are also committed to collaboration and open to new and innovative ideas, technologies, processes of work. Furthermore, as a key member of our agile development team, this DevOps role brings expertise in IT best practices and operations.</p> <p>We believe in a method of working dynamically and collaboratively that supports freedom and responsibility, wherein the “you build it, you run it” philosophy is one that we value, promote, and enact on a daily basis. Our teams work in close collaboration with each other and we emphasize idea-sharing to foster productivity.</p> <p>The candidate must exhibit a passion for learning new diverse tools and technologies. The candidate must also be comfortable in driving Continuous Integration / Deployment initiatives, internally, and in the cloud.</p> <p> </p> <p><strong>Job Responsibilities</strong></p> <ul> <li> <p>Support the automation and streamlining of our infrastructure, operations and deployment processes. Champion for infrastructure as code.</p> </li> <li> <p>Support and maintain helm-based deployments and infrastructure for our Kubernetes clusters.</p> </li> <li> <p>Develop and maintain tooling and automation-based monitoring of production environments to provide proactive alerts on system health and reliability.</p> </li> <li> <p>Possess entry level background in Linux / Windows servers administration and have an ability to demonstrate bash shell and PowerShell CLI scripting.</p> </li> <li> <p>Assist in developing our microservice strategy, including design, technology decisions, and implementation. Container based services, experience with Docker and Docker-based deployment frameworks.</p> </li> <li> <p>Participate in the software development process as defined by the Agile Scrum process. This includes participating in the requirements gathering process. Experience with Rally Software is a plus.</p> </li> <li> <p>Troubleshoot and resolve root cause issues in our dev, test, and production environments.</p> </li> <li> <p>Serve as team member role in on-time, high quality delivery of products through the entire application lifecycle.</p> </li> </ul> <p> </p> <p><strong>Desired Qualities</strong></p> <ul> <li> <p>Degree in Computer Science, related field or equivalent experience.</p> </li> <li> <p>At least 2 years of experience in a similar DevOps and/or IT role.</p> </li> <li> <p>Passion for DevOps – enthusiasm for new technologies and their potential to make an impact.</p> </li> <li> <p>A bias to action – a willingness to “jump right in” with an emphasis on producing results.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Kubernetes"},{"name":"Bash"},{"name":"Linux"},{"name":"Docker"},{"name":"Английский язык"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"841087","name":"IHS Global","url":"https://api.hh.ru/employers/841087?host=hh.ru","alternate_url":"https://hh.ru/employer/841087","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1817851.png","90":"https://hhcdn.ru/employer-logo/1817850.png","original":"https://hhcdn.ru/employer-logo-original/343896.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=841087&host=hh.ru","trusted":true},"published_at":"2021-10-28T22:31:30+0300","created_at":"2021-10-28T22:31:30+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49232792","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49232792","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}