{"id":"49330119","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Product Manager at Smartcat, Machine Learning","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Smartcat is the operating system for the global translation industry. Our team believes that the world becomes ever-more connected and interdependent. The borders that prevent people from trading, working together, and exchanging knowledge and innovations erode over time. That is the future we want to live in. Our mission is to speed up the pace at which that happens, building the best platform for Connected Translation. We don’t believe automation will render language professionals obsolete. Instead, we place powerful software into the hands of the millions of people working to globalize their own industries, plug them into our global supply network, and enable continuous delivery of multilingual content. With tens of thousands of customers and hundreds of thousands of freelancers translating together on Smartcat, we are well on our way.</p> <p><strong>Mission</strong></p> <p>Smartcat develops a collaboration platform that brings together buyers of localization services (end customers) and vendors (localization agencies and freelance linguists). You will play a critical role by creating ML technology able to replace human work of matching jobs and people capable of delivering it. Additionally you will create:<br />- advanced tools for customization of Machine Translation service for particular customers<br />- and multiple analytical instruments providing business insights to the company management helping to improve business quality.<br />It will become a part of our journey from a post-Series B startup to a company exceeding $1b in GMV. We&#39;re results-oriented, and we don&#39;t take this lightly: you must be a person who has a strong appetite for success, wants to grow fast, and motivates others to grow with you.</p> <p><strong>Your outcomes for the first 3 months will be</strong></p> <ol> <li> <p>Install and customize successful technology for matching of particular translation jobs and appropriate translators. KPI - first 25 customers have successfully used this technology and reported good quality of the performed jobs. The % of low quality performed jobs does not exceed 10%.</p> </li> <li> <p>Work out approaches for customization of machine translation service for a particular customer and make the first prototype of it.</p> </li> </ol> <p>* Personal OKRs are defined on a quarterly basis and are aligned with company-wide objectives.</p> <p><strong>Requirements</strong></p> <ul> <li> <p>Outstanding achievement as a product manager or product owner for B2C or B2B SaaS platforms with a focus on product-led growth.</p> </li> <li> <p>Knowledge of Machine learning approaches and techniques. Experience in organizing ML based projects with successful output</p> </li> <li> <p>Ability to work with engineering team</p> </li> <li> <p>Experience in making customers interviews to specify the project output and ensure customer satisfaction</p> </li> <li> <p>Fluent English and Russian, both written and spoken.</p> </li> <li> <p>Growth-oriented mindset.</p> </li> <li> <p>Experience working in a highly intense startup environment, requiring extreme focus, a sense of urgency, and persistence to break through.</p> </li> <li> <p>Openness to feedback and alternative opinions and ideas.</p> </li> <li> <p>Comfortable working with remote teams across time zones.</p> </li> <li> <p>Easy-going personality, high tolerance to cultural differences.</p> </li> </ul> <p><strong>Why joining Smartcat might be your best move so far</strong></p> <ul> <li> <p>The ongoing rise of the content economy is causing a massive shift in the language industry. All today’s megatrends — big data, artificial intelligence, machine learning — are converging in it at lightning speed. Smartcat’s disruptive business model taps into this $50b industry with a market network where buyers and suppliers connect, collaborate, and leverage our free-to-use workflow SaaS. The next decade will be the era of market networks and reinventing the $10 trillion service economy, and we’re pioneering this global transformation in all things language-related.</p> </li> <li> <p>You will enjoy building with us. You will drive changes in how an old-fashioned global language industry operates while improving how hundreds of thousands of people work, and millions of people exchange knowledge and ideas in the world.</p> </li> <li> <p>While the language industry is big and fragmented enough to keep us busy building a billion-dollar company in the next few years, we are already seeing how the network naturally expands to adjacent language and content-related verticals, expanding our TAM and making our journey even more exciting.</p> </li> <li> <p>We are a global team of 100+ enthusiastic people, with hubs in Boston, Amsterdam, Limassol, Moscow, and Hong Kong — and our users and partners are scattered all around the globe. We’re eager to succeed and transform the world of language services for the better. We grow aggressively while preserving our culture of empathy. As diverse as we are, we love working and having fun together, and we’re sure you’ll love working with us too.</p> </li> <li> <p>Smartcat is backed by Matrix Partners, FJ Labs, and other top VC firms focusing on SaaS and marketplace startups (you might recognize names like HubSpot, Zendesk, Uber, Stripe, RigUp and Quora in their portfolios). This helps us innovate at a fast pace and learn from top professionals in other industries.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Machine Learning"},{"name":"Product Management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"73","name":"Менеджер продукта"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3230136","name":"Smartcat","url":"https://api.hh.ru/employers/3230136?host=hh.ru","alternate_url":"https://hh.ru/employer/3230136","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2562701.png","240":"https://hhcdn.ru/employer-logo/2562702.png","original":"https://hhcdn.ru/employer-logo-original/530306.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3230136&host=hh.ru","trusted":true},"published_at":"2021-11-11T16:45:17+0300","created_at":"2021-11-11T16:45:17+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49330119","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49330119","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}