{"id":"49345561","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Front-End Developer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":{"id":"1751001-1751001-tech","name":"Arrival. Technology"},"contacts":null,"description":"<p>At Arrival, our team is creating best-in-class electric vehicles using a radical new method of design and production. We work with some of the world&#39;s leading businesses and governments to achieve our goal of redefining mobility and transport ecosystems, transforming how people and goods travel and enhancing urban environments for all communities.</p> <p>Innovation, rapid development and testing help us to push the boundaries. Our New Method takes our portfolio of patented technologies created in-house, and combines it with assembly in Arrival Microfactories. It’s a groundbreaking approach, leading to products with maximum functionality, peak efficiency, and an elevated experience – at a much more competitive price than other electric vehicles, and even fossil fuel vehicles.</p> <p>We’re recognised by LinkedIn as the top UK startup of 2020, and recently announced plans to list on the Nasdaq with an expected valuation of $5.4bn.</p> <p><strong>The product</strong><br /><br />Arrival is building modern electric vehicles, which by the fact - complex computer systems on the wheels. Such complex systems generate a huge amount of data, which we collect to design components and vehicles for efficiency, reliability and safety, test and validate solutions, track vehicles health and behaviour while lifecycle, investigate incidents and issues and proactively detect faults.<br />Our team is building Monitoring &amp; Diagnostics Platform which will enable many of our teams to leverage the data and extract insights from it, prevent faults and reduce vehicle downtime.<br /><br /><strong>The role</strong></p> <p>We are looking for talented engineer who can take maintainer’s role in UI Kit project, which plays important role in our WebApps build processes, as contains base UI building blocks. You will be responsible for guidance of contributions from other teams, define requirements and priorities, internal project structure, prepare releases and align works between all whose who interested in UI Kit.</p> <p>Another big activity will be work with our systems architects &amp; developers on diagnostic app, which will be integrated into our Monitoring &amp; Diagnostic Cloud Portal as well as into Vehicle Portal, which lives inside a vehicle. This app allows our engineers to perform their daily tasks on integration, support and monitoring by providing access to vehicle data and visualisation UI.</p> <p><strong>Responsibilities</strong></p> <ul> <li>Work on project technical requirements with platform owners and apps leads.</li> <li>Work with UI/UX design, developers and teams to bring and keep project quality level on the top.</li> <li>Work on core components and project infrastructure as developer.</li> <li>Communication with developers who uses UI Kit.</li> <li>Create and maintain optimal release pipelines for project with help of DevOps team.</li> </ul> <p><strong>Requirements</strong></p> <ul> <li>3+ years hands on experience in web apps development.</li> <li>Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.</li> <li>Understanding of the differences between multiple target platforms: desktop, embedded, mobile.</li> <li>Good understanding of ReactJS and its core principles.</li> <li>Experience with popular ReactJS workflows (such as Flux/Redux).</li> <li>Familiarity with RESTful APIs.</li> <li>Familiarity with modern front-end build pipelines and tools.</li> <li>Ability to understand business requirements and translate them into technical requirements.</li> <li>Excellent problem-solving and communication skills.</li> </ul> <p><strong>What we offer:</strong></p> <ul> <li>A knowledge-intensive culture and the chance to help develop a unique product.</li> <li>Grants for sports and fitness and English lessons.</li> <li>Medical insurance from your first week.</li> <li>Lunch and snacks in the office.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"JavaScript"},{"name":"ReactJS"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1751001","name":"ARRIVAL LTD","url":"https://api.hh.ru/employers/1751001?host=hh.ru","alternate_url":"https://hh.ru/employer/1751001","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/669101.png","240":"https://hhcdn.ru/employer-logo/3117537.png","90":"https://hhcdn.ru/employer-logo/3117536.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1751001&host=hh.ru","trusted":true},"published_at":"2021-11-12T11:01:47+0300","created_at":"2021-11-12T11:01:47+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49345561","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49345561","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}