{"id":"49359954","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Technical Sales Specialist","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Красногорск","street":"бульвар Строителей","building":"4к1","description":null,"lat":55.814462,"lng":37.385412,"raw":"Красногорск, бульвар Строителей, 4к1","metro":{"station_name":"Мякинино","line_name":"Арбатско-Покровская","station_id":"3.181","line_id":"3","lat":55.823342,"lng":37.385214},"metro_stations":[{"station_name":"Мякинино","line_name":"Арбатско-Покровская","station_id":"3.181","line_id":"3","lat":55.823342,"lng":37.385214}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Why Work at Lenovo?</strong></p> <p>Here at Lenovo, we believe in smarter technology for all, so we spend our time building a society that’s brighter and more inclusive. And we go big. No, not big—huge.</p> <p>We’re a US$60 billion revenue Fortune Global 500 company serving customers in 180 markets around the world. Focused on a bold vision to deliver smarter technology for all, we are developing world-changing technologies that power (through devices and infrastructure) and empower (through solutions, services and software) millions of customers every day and together create a more inclusive, trustworthy and sustainable digital society for everyone, everywhere.</p> <p> </p> <p>The one thing that’s missing? Well… you...</p> <p> </p> <p><strong>Description and Requirements</strong></p> <p>Technical Sales Specialist will proactively expand adoption of Lenovo solutions within defined territory (customer set) by driving relationships at technical level, both internally and externally, to influence positive change, be trusted advisor. You will consult closely with customers to ensure their satisfaction and return on investment of Lenovo solutions. You will closely work with sales responsible for the same customer set, be one team for identifying and directly addressing all business and technical issues impacting customer success.</p> <p><strong>Organization</strong></p> <ul> <li>You will report to Sr Sales Engineer Manager, ISG Russia.</li> </ul> <p> </p> <p><strong>Key Responsibilities</strong></p> <ul> <li>Cover all technical needs of customers and business partners</li> <li>Direct customer contact point for technical needs, best practices and customer handling guidance.</li> <li>Map Lenovo solutions to the customer’s unique business and technical requirements to ensure strategic long term value</li> <li>Conduct and deliver technical configuration, performance and best practice analysis for each assigned account.</li> <li>Advise on operating and maintaining an optimized solution environment.</li> <li>Proactively provide guidance on features/functionality and operational efficiencies to maximize ROI.</li> <li>Understand the customer’s relevant business challenges while functioning as a trusted advisor for “best practices” and drive adoption of Lenovo solutions within your assigned accounts</li> <li>Escalation point of contact for customers in sales and support activities</li> <li>Manage and own competing requests across multiple client engagements</li> <li>Provide clear and constructive product feedback to Lenovo product management teams based on customer use-cases and requirements</li> <li>Maintain high-level technical knowledge of core Lenovo solutions and future product direction</li> </ul> <p> </p> <p><strong>Essential Requirements</strong></p> <ul> <li>Fluent at English and Russian language</li> <li>Bachelor’s degree or a minimum of 3+ years’ experience with Enterprise environments.</li> <li>3+ years enterprise experience with data center hardware and software technologies. Knowing and understanding all current DC trends.</li> <li>Demonstrated ability and experience in customer-facing positions as a technology consultant (preferably with a management consulting, IT vendor or professional services organization)</li> <li>Must be a fast learner with the ability to explain technical concepts to a variety of audiences and deliver Lenovo tech solution.</li> <li>Solid technical background in at least 3 of the following areas: data center infrastructure, operating systems, desktop deployments, mobility, networking, security, virtualization, system administration and technical architecture; preferably with industry certifications</li> <li>Business acumen and problem-solving skills with the ability to influence change at all levels</li> <li>Excellent communication, presentation and interpersonal skills including the ability to interact, communicate and build relationships with all levels of personnel from administrators to CxO levels</li> </ul> <p> </p> <p><strong>What we will offer?</strong></p> <ul> <li>An open and stimulating environment within one of the most forward-thinking IT companies</li> <li>Flat structures and fast decision-making processes</li> <li>A modern and flexible way of working to combine personal and professional life</li> <li>An international team with a high focus on diversity</li> <li>Attractive compensation package</li> </ul> <p> </p> <p><em>We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any federal, state, or local protected class.</em></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Presentation skills"},{"name":"Английский язык"},{"name":"Negotiation skills"},{"name":"Time management"},{"name":"MS PowerPoint"},{"name":"Analytical skills"},{"name":"Business English"},{"name":"Sales Skills"},{"name":"Sales Management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.269","name":"Телекоммуникации, Сетевые решения","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.111","name":"Компьютерная техника","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.112","name":"Компьютерные программы","profarea_id":"17","profarea_name":"Продажи"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"150884","name":"Леново","url":"https://api.hh.ru/employers/150884?host=hh.ru","alternate_url":"https://hh.ru/employer/150884","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2325093.png","90":"https://hhcdn.ru/employer-logo/2325092.png","original":"https://hhcdn.ru/employer-logo-original/470810.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=150884&host=hh.ru","trusted":true},"published_at":"2021-11-21T17:46:50+0300","created_at":"2021-11-21T17:46:50+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49359954","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49359954","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}