{"id":"49360002","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Marketing Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>About BlaBlaCar</strong></p> <p>BlaBlaCar is the world’s leading carpooling platform, created with one dream in mind: leveraging technology to fill the millions of empty seats on the road. We offer long- and short-distance carpooling as well as a bus marketplace, with the mission to become the go-to marketplace for shared road mobility.</p> <p>Today, our community counts over 100 million travelers in 22 countries, creating a smarter, friendlier and carbon-saving transport network. Every year, our community saves 1.6 million tons of CO2e by sharing the road, equivalent to the CO2 emissions generated by Paris traffic in a year. But it doesn’t stop here – our team of 250+ engineers is developing innovative algorithms to further unlock the potential of shared travel and multiply its impact.</p> <p>We’re looking for people to join our journey – people who care, who are driven by impact and innovation, and who want to thrive in a fast-paced entrepreneurial environment. We offer a flexible workplace where we count on each other to take initiative. So join the ride – we can’t wait to see where it takes you.</p> <p><strong>BlaBlaCar is looking for a Marketing Manager to join its regional marketing team. What you will directly contribute to:</strong></p> <ul> <li>Developing and driving integrated marketing campaigns primarily in online channels (Online video, online special projects), including both creative development and media planning;</li> <li>Developing and executing partner marketing activities. Co-promo with bus carriers/stations and partners from other industries;</li> <li>Finding and managing online channels for acquisition of new passengers and drivers, working with affiliate marketing partners;</li> <li>Driving local CRM activities</li> </ul> <p><strong>Qualifications - What you will need to be successful (importance in descending order):</strong></p> <ul> <li>3+ years of work experience in online marketing</li> <li>Conducted online campaigns which changed the brand perception</li> <li>Strong project management skills - proven ability to drive projects in a matrix organization. Ability to impact without authority</li> <li>Strong data and analytical skills</li> <li>Skilled in online and performance marketing. Knowledge of key ad platforms, familiar with online marketing metrics; experienced user of analytical instruments</li> <li>Ability to work with creative teams, to develop high-quality creative briefs. Creative sensibility</li> <li>Presentation skill - ability to simply present complex ideas</li> <li>Fluent in English and Russian</li> </ul> <p><strong>Optional skills (nice to have):</strong></p> <ul> <li>Experience in online marketing for C2C marketplaces/classifieds is a plus</li> <li>Developed and executed CRM initiatives, understanding key principles for CRM</li> </ul> <p><strong>A few practical details about the role:</strong></p> <p> </p> <ul> <li>Start: As soon as you are ready!</li> <li>Location: Moscow, hybrid</li> <li>Compensation: Competitive package based on experience</li> <li>Contract: Permanent contract</li> </ul> <p><strong>What we offer all of our employees:</strong></p> <ul> <li>A start-up spirit that fosters agility, teamwork, and impact</li> <li>Challenging career opportunities in a high-growth and fast-paced environment</li> <li>The choice between the latest Mac or PC equipment</li> <li>Free carpooling to experience our value “Think it. Build it. Use it.”</li> <li>Annual BlaBlaBreak which takes us all for an unforgettable weekend</li> <li>Weekly BlaBlaTalks when we learn from each other</li> <li>Weekly Tech Demos</li> <li>And many more to check out on BlaBlaCar.com/dreamjobs</li> </ul> <p><strong>What is next:</strong></p> <p>If you are ready to join our exciting journey, please apply below without forgetting to upload your resume in English (PDF format) nor to answer our questions in English as well. Kindly note that only complete applications will be reviewed by our hiring team and that all your information will be kept confidential.</p> <p>You can expect us to review your application within the following 3 weeks. If your application fits our requirements, we will invite you to complete an online test. If you pass the test, a video interview, several on-site interviews, and a business case will follow.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Leadership Skills"},{"name":"Project management"},{"name":"Presentation skills"},{"name":"B2C Marketing"},{"name":"Digital Marketing"},{"name":"Business English"},{"name":"Analytical skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.137","name":"Маркетинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"37","name":"Директор по маркетингу и PR (CMO)"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1460422","name":"BlaBlaCar","url":"https://api.hh.ru/employers/1460422?host=hh.ru","alternate_url":"https://hh.ru/employer/1460422","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2568157.png","240":"https://hhcdn.ru/employer-logo/2568158.png","original":"https://hhcdn.ru/employer-logo-original/531670.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1460422&host=hh.ru","trusted":true},"published_at":"2021-11-21T17:49:44+0300","created_at":"2021-11-21T17:49:44+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49360002","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49360002","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}