{"id":"49369192","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Product manager (global product)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<em>A software company that has built a global print cloud is looking for a Product manager. </em> <p><em>You will be part of international Product team. You&#39;ll work closely with engineering teams to guide product development and to secure its efficient implementation. You&#39;ll be the link between business, technology and user experience.</em></p> <p><em>Working on multiple tasks at a fast pace is business as usual. The ideal candidate is a hands-on customer-obsessed problem solver, who wants to exceed expectations, is eager to learn and improve.</em></p> <p><strong>What you will be doing:</strong></p> <ul> <li>Maximize business value in product launches.</li> <li>Analyze the market and find opportunities to make the product unique.</li> <li>Define the strategy of product&#39;s development.</li> <li>Be the voice of the user inside the business and gather product requirements. Working very closely with customers to understand what we build and why.</li> <li>Owning an ambitious roadmap.</li> <li>Become a lead of cross-functional teams of developers, content specialists, and designers to build a cutting-edge product on an innovative platform.</li> <li>Complete the projects on time and with excellence.</li> <li>Develop a detailed project plan, track progress and minimize risks.</li> <li>Create and maintain comprehensive project documentation.</li> </ul> <p><strong>Requirements:</strong></p> <p>In order to be successful in this role, you will need to have a start-up mentality. You are committed to excel with energy and endurance. You are quick on your feet and have a strategic perspective that others rely on. You have superior organizational skills, high integrity and great follow-through on tasks. You don’t get overwhelmed easily and prioritize ruthlessly. You are flexible, fearless, and excited to help build something awesome and share it with the world.</p> <ul> <li>At least 3-5 years of relevant work experience on Product management positions.</li> <li>Fluent English.</li> <li>Experience in e-commerce will be an advantage.</li> <li>Experience in product management a focus on software products and technologies.</li> <li>Work experience in project management within Agile.</li> <li>Knowledge of multiple functional areas such as product management, engineering, UI, sales, customer support, finance or marketing.</li> <li>You are technical enough to ask engineers good questions about architecture and product decisions alike.</li> <li>Excellent problem-solving, organizational and analytical skills, with the ability to evolve product strategy based on research, data and industry trends.</li> <li>Work experience in high-growth entrepreneurial international companies is a plus.</li> </ul> <p><strong>Benefits:</strong></p> <ul> <li>Company offers a rare opportunity to change the world in such that everyone around you can use the services you&#39;ve been part of building. They&#39;re not just another social web application; they&#39;re improving one of the world&#39;s largest industries.</li> <li>Team offers you a chance to be part of a truly amazing journey in a company that sets very high targets and works hard to achieve them. You will be able to work with smart, motivated and engaged co-workers from all over the world, in an intense and very energetic environment.</li> <li>You will have a tangible impact on the way that they operate and expand their business. Working with some of the most ambitious colleagues out there you will have a ground floor opportunity to put all your experience and know-how to the test while learning at a speed you thought was impossible before joining.</li> <li>As a team continue to grow they want you to grow with them and for the right candidate, there is no limit to where this opportunity might take you.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Analytical skills"},{"name":"Product Marketing"},{"name":"Product Management"},{"name":"Start-up project"},{"name":"Teambuilding"},{"name":"Business Development"},{"name":"Project management"},{"name":"Business English"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"3.150","name":"Менеджмент продукта (Product manager)","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"professional_roles":[{"id":"73","name":"Менеджер продукта"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"913195","name":"DigitalHR","url":"https://api.hh.ru/employers/913195?host=hh.ru","alternate_url":"https://hh.ru/employer/913195","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/113626.png","90":"https://hhcdn.ru/employer-logo/995342.png","240":"https://hhcdn.ru/employer-logo/995343.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=913195&host=hh.ru","trusted":true},"published_at":"2021-11-04T12:44:19+0300","created_at":"2021-11-04T12:44:19+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49369192","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49369192","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}