{"id":"49371288","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Account Associate","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>The BlaBlaCar ProMarketPlace team in Russia</strong> is looking for an <strong>Account Associate </strong>to join our team. We are looking for individuals who are interested in broadening their experience in b2b account management. In this role you will work with BlaBlaCar bus partners, plus work on projects across the whole company, mostly related to B2B Sourcing, Sales support, and Business Development. In this position you will have the unique opportunity to contribute to developing a new business of BlaBlaCar. We are looking for someone who has the grit and motivation to join our entrepreneurial adventure to digitize the market that currently operates offline.</p> <p> </p> <p><strong>What you will directly contribute to:</strong></p> <ul> <li>Expansion of inventory supply on the platform</li> <li>Championing relationship with partners (bus carriers, agents) in Russia ans CIS, in order to capture its needs and maximize results of the partnership; be the voice of the partner regarding product needs to understand how we can grow their business with us;</li> <li>Supporting creation and improvement of processes, policies, procedures and business strategies;</li> <li>Discovering, leading and converting business opportunities to support growth and development;</li> <li>Filling and monitoring activities in CRM (Salesforce);</li> <li>Performing data gathering, market research, competition analysis and data analysis for strategic decision-making and stakeholders reporting;</li> <li>Partnering with global teams (Marketing, operations, product, tech, data science, and finance);</li> <li>Tracking and ensuring successful system integrations, unit testing, bug reporting and product enhancements;</li> <li>Monitoring and ensuring the success of the process of reporting and payments for partners;Managing the flow of accompanying documents documents and materials.</li> </ul> <p> </p> <p><strong>Your background:</strong></p> <ul> <li>Experience in account management, business analysis, business development, inside sales, management/strategic consulting, or project management</li> <li>Previous experience with B2B Partnerships (at startups or <strong>bus market</strong> is a plus)</li> <li>Bachelor degree needed. Degree in Engineering, Economics, Business Administration is a plus</li> </ul> <p> </p> <p><strong>Your hard skills:</strong></p> <ul> <li>Religious data leading through CRM</li> <li>Strong knowledge of marketplace model and OTA Principles</li> <li>Ability to work with data to define priorities, actionable insights, and present results - excellent skills to build outstanding presentation and spreadsheets</li> <li>Ability to create persuasive storytellings and improvise</li> <li>Ability to structure solutions for complex problems</li> <li>Fluent English, with both formal written and verbal proficiency</li> </ul> <p> </p> <p><strong>Your soft skills:</strong></p> <ul> <li>A self starter, keen, ambitious and hungry to get results</li> <li>Comfortable and experienced speaking with clients, dealing with issues and generating positive outcomes</li> <li>Strong communication skills and ability to present in a clear, structured and concise manner to all levels</li> <li>Ability to think strategically with orientation to details and organization</li> <li>Belief in the value of participating in, and contributing to a collaborative team environment</li> <li>Resilience: ability to learn from failure, capacity to bounce back and work with high levels of uncertainty</li> <li>Ability to change and work in a fast paced environment with high tasks&#39; volume, variety and velocity</li> <li>Be humble, structured, motivated by innovation and a relentless doer</li> <li>Demonstrable experience of upselling and generating volume growth from existing clients</li> </ul> <p> </p> <p><strong>Your future benefits:</strong></p> <ul> <li>Tailor-made remote policy: from 2 days per week to full remote (to be discussed with the Talent Acquisition Manager during the first call).</li> <li>A fair and competitive salary package</li> <li>Employee Stock Ownership plan</li> <li>Relocation package and visa sponsorship to welcome you wherever you are currently based</li> <li>Parental policy</li> <li>Trainings and career development programs</li> </ul> <p> </p> <p><strong>What we have to offer:</strong></p> <p><strong>An international environment:</strong> over 35 nationalities across 7 countries: Brazil, France, Germany, Poland, Russia, Spain, Ukraine</p> <p><strong>Opportunities to learn</strong>: onboarding weeks, weekly team-all BlaBlaTalks to learn about what other teams are up to, International Weeks to mingle with other offices, regular Q&amp;A sessions with our leadership, honest discussions about our company KPIs, ‘Fail, Learn, Succeed’ moments where we destigmatize and share moments of failure with others.</p> <p><strong>Innovation</strong>: Coding Nights to pitch ideas outside our roadmap and make development dreams come true, weekly Product &amp; Tech Demos and blogs to share engineering stories, access to top conferences across Europe.</p> <p><strong>Impact</strong>: building a product that has a real impact on society and the environment, and sharing an office culture that prioritizes low-waste and eco-friendly practices.</p> <p><strong>People-first:</strong> wind down from work at our BlaBlaShows, BlaBlaBreak retreats, weekly breakfasts and afterworks (when the sanitary conditions permit it) or meme battles on Slack.<strong> Shared company principles</strong> that guide us in our everyday decision-making and bring us closer to our goal. Find out more about our BlaBlaPrinciples.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Analytical skills"},{"name":"Negotiation skills"},{"name":"Presentation skills"},{"name":"Business Development"},{"name":"Sales Management"},{"name":"B2B Marketing"},{"name":"Английский язык"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.333","name":"Услуги для бизнеса","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.751","name":"Другое","profarea_id":"17","profarea_name":"Продажи"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1460422","name":"BlaBlaCar","url":"https://api.hh.ru/employers/1460422?host=hh.ru","alternate_url":"https://hh.ru/employer/1460422","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2568157.png","240":"https://hhcdn.ru/employer-logo/2568158.png","original":"https://hhcdn.ru/employer-logo-original/531670.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1460422&host=hh.ru","trusted":true},"published_at":"2021-11-22T15:08:46+0300","created_at":"2021-11-22T15:08:46+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49371288","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49371288","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}