{"id":"49387535","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Senior QA Automation Engineer (to Canada)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":7000,"to":null,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>About Behavox</strong></p> <p>Behavox is shaping the future for how businesses harness their most important raw material - data. Our mission is bold: Organize enterprise data into actionable information that protects and promotes the business growth of multinational companies around the world.</p> <p>From managing enterprise risk and compliance to maximizing revenue and value, our data operating platform presents a widespread opportunity to build multilingual, AI/ML-based solutions that activate data for every function within a global enterprise.</p> <p>Our approach is unique, and it’s validated by our customers who tell us to keep forging ahead because no one else is aggregating, analyzing, and acting on data to uncover opportunities or solve problems quite the way we are.</p> <p>We are looking for fearless innovators who have an insatiable appetite for building what no one has built before.</p> <p><strong>About the Role</strong></p> <p>Product Engineering is an essential part of theTechnology team. We focus on technical design, implementation and delivery of complex data intensive applications which are mission-critical for our clients.</p> <p>As a <strong>QA Automation Engineer</strong>, you will be a part of an engineering team responsible for one of our products. You will partner up with the product management, design and other engineering teams to solve complex technical problems and deliver outstanding products to our clients, on time.</p> <p>This is a great opportunity for the right Talented individuals who are looking to:</p> <p>1. Be on a growing team in a company with complex tech at a good time to join if you are looking for an opportunity to be a key person and build up something almost from scratch<br />2. Work closely with an engineering team to learn about new technologies and tools being used at Behavox<br />3. Have a variety of responsibilities that can be flexible based on interests, strengths, and needs of the team</p> <p><strong>What You&#39;ll Bring</strong></p> <ul> <li>5+ years of experience applying best practices in software development and testing</li> <li>Strong coding skills in TypeScript, JS, Python (Java/Groovy a plus), pytest &amp; behave frameworks</li> <li>Hands-on knowledge of working with DevOps procedures and tools (CI/CD, Jenkins)</li> <li>Experience with setting up and improving automated testing using Cypress/Cucumber</li> <li>Experience with test data management, test case management, parallelisation of test execution</li> <li>Upper-Intermediate+ English skills</li> </ul> <p><strong>What You&#39;ll Do</strong></p> <ul> <li>Develop and execute test plans for back-end services and front-end UI</li> <li>Create effective test strategies for the mission-critical services developed within the Technology department to improve on products quality</li> <li>Ensure continuous testing and monitoring of functionality, accuracy, performance, and stability of all components</li> <li>Drive the development of automated tests and automation frameworks</li> <li>Contribute to development of infrastructure and processes for scalable testing on both internal and production environments</li> </ul> <p><strong>What We Offer</strong></p> <ul> <li>A truly global mission with a passionate community in locations all over the world</li> <li>Huge impact and learning potential as our aspirations require bold innovation</li> <li>Highly competitive compensation with 100% bonus pay already integrated</li> <li>Benefits include fully covered health coverage for employee and family</li> <li>Generous time-off policy and flexible work schedule</li> <li><em><strong>Great relocation package and Work Permit Sponsorship for the candidate and his family (relocation to our main R&amp;D center in Montreal is a MUST)</strong></em></li> </ul> <p><strong>About Our Process</strong></p> <p>We take Talent very seriously and we are building a community of extraordinary individuals working together in very high performing teams. We also know that the best Talent always has options so we believe that the process has to be a two way assessment - the company AND the candidate assessing the business needs alignment, the career next step alignment, and the cultural alignment.<br /><br />During the process we will begin by exploring the core factors regarding salary and location along with core experience and skills and values alignment. We will then deep dive explore the critical technical competencies we have identified for the role, and then we will deep dive in behavioral competencies.<br /><br />The most aligned candidate will then be asked to do a practical work task simulation activity so we can make sure that you will enjoy the kind of work the role requires, and this task will typically be presented and discussed with a group of colleagues and managers.</p> <p><em><strong>Please apply with your CV and cover letter in English. Our recruitment team won&#39;t be able to review the CVs in Russian. Please note that relocation to Canada is required</strong></em></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Jenkins"},{"name":"Английский язык"},{"name":"Java"},{"name":"JavaScript"},{"name":"Typescript"},{"name":"Cypress"},{"name":"Pytest"},{"name":"Behave"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.117","name":"Тестирование","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"124","name":"Тестировщик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1767241","name":"Behavox","url":"https://api.hh.ru/employers/1767241?host=hh.ru","alternate_url":"https://hh.ru/employer/1767241","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/820950.jpg","240":"https://hhcdn.ru/employer-logo/3724688.jpeg","90":"https://hhcdn.ru/employer-logo/3724687.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1767241&host=hh.ru","trusted":true},"published_at":"2021-11-21T06:13:26+0300","created_at":"2021-11-21T06:13:26+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49387535","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49387535","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}