{"id":"49481347","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Middle QA engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Middle QA Engineer в Rusprofile</p> <p>О проекте <strong>Rusprofile</strong></p> <p> </p> <p><strong>Rusprofile</strong><strong> — это проект, который помогает разного размера бизнесам изучать своих контрагентов.</strong> Наша задача — искать в открытых источниках актуальные юридические данные и предоставлять их в удобном виде с аналитикой и выводами. У продукта много кейсов использования, среди прямых клиентов можно найти специалистов самых разных профессий — бухгалтеров, юристов, страховых агентов, менеджеров по безопасности, закупкам, продажам, собственников бизнеса и даже преподавателей университетов.</p> <p> </p> <p>Больше о продукте можно найти на нашем сайте.</p> <p> </p> <p>О технологиях</p> <p>Проект разрабатывается и тестируется исключительно удалённо из-за большого объёма данных — база данных занимает почти 3 Тб. Это накладывает некоторую специфику на процесс работы. <strong>Удалённая test-среда живёт на Linux</strong>, и для выкатки кода туда мы используем <strong>Git</strong>. Кроме того, нередко приходится смотреть в базу данных <strong>MySQL/MariaDB</strong>, чтобы убедиться, что все данные там записались правильно. Для тестирования кроссбраузерности мы используем <strong>Browserstack</strong>. У нас есть также <strong>автотесты на Javascript</strong> с использованием webdriver.io и mocha. Также для контроля вёрстки мы используем <strong>Backstop</strong>.</p> <p>Как построена работа</p> <p>Процесс построен вокруг Scrum-практик — двухнедельные итерации с планированием в начале, ежедневным стендапом и ревью и ретроспективой в конце. Релизы мы делаем примерно раз в неделю. С разработкой тесно взаимодействует менеджер проекта, который формулирует большую часть задач, и два продакт-менеджера, отвечающие за разные направления.</p> <p>Задачами мы управляем через Jira, документацию держим в xWiki и Confluence, переписываемся в Slack. Ежедневно с 12 до 18 наша команда находится в голосовом канале в TeamSpeak.</p> <p>В разработке у нас также есть стадии анализа, код-ревью, тестирования и приёмочного тестирования — время от времени мы пересматриваем workflow, чтобы он соответствовал реальности. Мы уделяем внимание качеству кода, и если нет времени сделать хорошо сразу, то обязательно заводим задачу на рефакторинг. Разработка всегда открыта к новшествам, если они решают больше проблем, чем создаёт сложностей их внедрение. Так, например, мы успешно запустили статический анализ кода в уже большом и давно работающим коде: это было непросто, но затраты уже многократно окупились.</p> <p>О команде</p> <p>Команда Rusprofile — это:</p> <p>- основатели Илья и Дима, которые когда-то вместе заканчивали факультет вычислительной математики и кибернетики МГУ. Все время после университета занимались своими проектами, среди которых Rusprofile — основной.</p> <p>- 12 инженеров с академичным пониманием разработки во главе с СТО Мишей Иглицким, среди которых уже есть 2 QA-инженера. Команда инженеров активно растет и в ближайшее время вырастет до ± 17 человек.</p> <p>- бизнес-ориентированные менеджеры и дизайнеры продукта.</p> <p>Кого мы ищем</p> <p>Мы ищем <strong>Middle QA Engineer</strong>, который вместе с коллегой будет отвечать за тестирование всего функционала сервиса. Особенности, с которыми предстоит работать:</p> <p>- У нас много данных — 11 млн. юридических лиц и 16 млн. индвидуальных предпринимателей и множество информации о них — и не самая обычная предметная область, поэтому при тестировании мы сталкиваемся с самыми разнообразными случаями, некоторые из которых могут оказаться весьма неожиданными.</p> <p>- Платный функционал сайта подразумевает довольно много различных вариантов, и некоторые сценарии могут быть непростыми. Также продуктовая команда часто запускает различные интересные эксперименты по привлечению пользователей.</p> <p>- Сайтом ежедневно пользуется от 700 000 пользователей, которые нередко сообщают в нашу поддержку о странностях в работе сервиса. Благодаря им мы не раз находили и исправляли всякие сложные ошибки.</p> <p>Опыт, который мы ценим</p> <p>- Уровень — <strong>Middle</strong></p> <p>- Вы уже здорово ориентируетесь в <strong>ручном тестировании сайтов и web-приложений</strong>, умеете делать кроссбраузерное, функциональное, регрессионное, интеграционное тестирование</p> <p>- Вы можете не только методично проверять соответствие поставленной задаче, но и понимать проблемы предметной области, которые она решает</p> <p>- Мы очень ценим <strong>профессионализм в коммуникации</strong> – уважаем фидбек, конструктивный профессиональный диалог без растекания мысли по древу и многочасовых дейли. Нам важно найти коллегу, который разделяет такую культуру общения</p> <p>- nice to have: если вы уже работали с таск-трекинг системами (JIRA) и базой знаний (Confluence), хотя кто сейчас не работал</p> <p>- nice to have: опыт тестирования сложных систем и веб-приложений</p> <p>- nice to have: опыт написания автоматизированных тестов (у нас webdriver.io)</p> <p>Что готова дать компания</p> <p>- В конце первого года вас будет ждать годовая премия, а далее – <strong>квартальные премии</strong>. Мы ценим то, что из нашей команды за 5 лет ушло 2 инженера, и, чтобы отблагодарить сотрудников, сделали прогрессивный коэффициент бонусов, который зависит от времени работы в нашей команде.</p> <p>- Из-за большого объёма данных вся разработка и тестирование происходят на удалённом сервере, поэтому <strong>работать можно откуда угодно</strong> — нужен только доступ в интернет.</p> <p>- Гибкий график – вы можете работать в удобном для вас режиме (в том числе удаленно), <strong>главное – быть с 12 до 18 на связи</strong> с командой в TeamSpeak.</p> <p>- Работа с <strong>highload</strong> – ежедневно наш сервис посещает более 700К пользователей. Но на этом мы не останавливаемся, наша продуктовая команда ищет новые аудитории пользователей, а, значит, нагрузка будет только расти.</p> <p>- Работа с уникальными задачами. Мы собираем <strong>open data</strong> и делаем так, чтобы эти данные были не только актуальными в любой момент, но еще и удобными для наших пользователей. Работа с open data несёт за собой вызовы: государственные данные порою требует изобретательности в методах работы с ними, чтобы извлечь из них максимум полезного. Причины просты – поставщики данных, как правило, не заботятся о том, чтобы эти данные было удобно использовать – у каждого ведомства своя логика упаковки и обработки данных.</p> <p>- У нас нет лишнего формализма, и если в процессе разработки или тестирования обнаруживаются неучтённые случаи, мы вместе с продуктовой командой выясняем, как лучше всего решить какую-то бизнес-задачу. <strong>Горизонтальная коммуникация хорошо налажена, и процессы происходят без бюрократии</strong>.</p> <p>- Мы всегда рады новым знаниям, помогающим решать наши непростые задачи, потому мы <strong>оплачиваем обучение, помогаем посещать конференции и семинары</strong></p> <p>- <strong>Наш проект может стать для вас площадкой для начала работы с автотестами</strong>, если вы еще не писали их для коммерческих проектов, но хотели бы начать</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Atlassian Jira"},{"name":"Git"},{"name":"Atlassian Confluence"},{"name":"Linux"},{"name":"MySQL"},{"name":"Проведение тестирований"},{"name":"Тестирование"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.117","name":"Тестирование","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"124","name":"Тестировщик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3742531","name":"Rusprofile","url":"https://api.hh.ru/employers/3742531?host=hh.ru","alternate_url":"https://hh.ru/employer/3742531","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/646227.png","90":"https://hhcdn.ru/employer-logo/3026056.png","240":"https://hhcdn.ru/employer-logo/3026057.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3742531&host=hh.ru","trusted":true},"published_at":"2021-11-21T21:07:53+0300","created_at":"2021-11-21T21:07:53+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49481347","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49481347","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}