{"id":"49537672","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Client Interfaces Product Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Dostavista.global (Borzo) </strong>is one of the biggest and most technologically advanced players in the global same-day delivery market. We provide unparalleled convenience to businesses and people, all the while creating millions of self-managed courier jobs, and strive to make delivery easier and cheaper than getting out of one’s house or office.</p> <p>We operate in ten countries across Asia, Latin America, and Europe and deliver more than 3 500 000 parcels monthly. To remain at the forefront of this promising, often surprising yet already highly competitive market, we aim to provide our clients with a stellar interface experience. We are looking for a UX ambassador whose passion for elegant and efficient interface solutions will drive it to perfection and make clients love us for our attention to their needs.</p> <p><strong>Your mission </strong></p> <p>As the Client Interfaces Product Manager, you will take charge of the platform and cross-platform client experience and drive client interfaces to perfection using data analysis, customer research, and your vision while supporting other teams that launch features with interface presence.</p> <p>You won&#39;t do it alone: we have a perfectly fitted team of researchers, analysts, and product designers who will support you along the way. The engineering team is also dedicated — only you are missing!</p> <p><strong>Expected outcomes</strong></p> <ul> <li>You have removed any interface obstacles that hinder the product value and achieved significant improvements in key product metrics with UX changes</li> <li>You have made platform and cross-platform interface experience seamless and consistent</li> <li>You have put us a step ahead of the competition in interface usability</li> <li>You have put together a system of UX and interface-related metrics that would allow us to assess interface performance</li> <li>You have established a continuous feedback loop to uncover interface issues and identify opportunities</li> <li>You have proven to be the client UX expert and platform owner whose opinion is taken into account across the company</li> </ul> <p><strong>Requirements</strong></p> <ul> <li>Track record of successful development of products that heavily rely on web and app interfaces to deliver product value</li> <li>Experience in tight collaboration with product designers, UX-researchers, and analysts</li> <li>Experience in AB-testing</li> <li>Ability to analyze data on your own using SQL, Tableau, Firebase, Amplitude, and GA</li> <li>Experience in interface prototyping</li> <li>Experience in designing and running moderated and unmoderated usability testing</li> <li>Excellence at system analysis and writing detailed tasks for development</li> </ul> <p><strong>Would be awesome if you:</strong></p> <ul> <li>Strive to solve complex problems with elegant solutions</li> <li>Understand the value of UX</li> <li>Enjoy teamwork</li> <li>Love getting dirty in research, analytics, and prototyping</li> </ul> <p><strong>What we offer</strong></p> <ul> <li>100% Remote work or office in Moscow or in any other one of our 10 countries</li> <li>Opportunity to work with a big global team</li> <li>Common sense is in our DNA</li> <li>Horizontal structure without strict subordination and bureaucracy</li> <li>Chance to build global breakthrough products in delivery</li> <li>Competitive salary and comprehensive health-care with dental insurance</li> </ul> <ul> <li>Education: own library, paid courses and conferences</li> <li>Recreation: PS4, Nintendo Switch, Board games, office quizzes, holiday parties</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Английский язык"},{"name":"Business English"},{"name":"Customer Service"},{"name":"Analytical skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"20.325","name":"Управление проектами","profarea_id":"20","profarea_name":"Строительство, недвижимость"},{"id":"3.150","name":"Менеджмент продукта (Product manager)","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"professional_roles":[{"id":"73","name":"Менеджер продукта"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3730831","name":"Borzo","url":"https://api.hh.ru/employers/3730831?host=hh.ru","alternate_url":"https://hh.ru/employer/3730831","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/896962.png","90":"https://hhcdn.ru/employer-logo/4028535.png","240":"https://hhcdn.ru/employer-logo/4028536.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3730831&host=hh.ru","trusted":true},"published_at":"2021-11-11T12:29:05+0300","created_at":"2021-11-11T12:29:05+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49537672","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49537672","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}