{"id":"49546296","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"BI - аналитик","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":180000,"to":250000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Мы в <strong>SegmentStream</strong> ищем опытного BI специалиста из сферы маркетинговой аналитики, который будет отвечать за применение технологий обработки больших данных и машинного обучения для решения сложных технических BI-проектов наших клиентов.</p> <p><strong>SegmentStream</strong> — инновационная платформа, позволяющая собрать все онлайн и оффлайн данные для построения продвинутой маркетинговой аналитики и мультиканальной атрибуции для эффективного управления marketing mix.</p> <p>Основанная в 2018 году, платформа SegmentStream завоевала доверие более 50 ведущих компаний, включая, Л’Этуаль, Петрович, Европлан, Goods, Nespresso, United Colors of Benetton и многих других.</p> <p>Мы полностью меняем представление о подходе к оценке эффективности Digital-инструментов, позволяя бизнесам достигать невероятных результатов в короткие сроки.</p> <p>Наши исследования о методах обработки данных и построения моделей атрибуции на основе машинного обучения публикуют топовые аналитически ресурсы мира. И сейчас мы ищем того, кому посчастливится внедрять все эти технологии на практике, решая задачи всемирно известных компаний и брендов, работая рука об руку с кофаундерами и нашими топовыми специалистами.</p> <p><strong>Основная задача в рамках роли:</strong></p> <p>Реализовывать стандартные и нестандартные проекты, используя наши технологии и данные наших клиентов. Какие-то задачи будут понятными (сквозная аналитика, атрибуция, ROPO-анализ), какие-то будут решаться впервые в мире!</p> <p><strong>Чем это лучше работы в агентстве?</strong></p> <ul> <li>Это интереснее. Мы разрабатываем глобальный продукт для маркетинговой аналитики. В рамках проектных работ нам достаются самые сложные и интересные задачи, которые агентства как раз и не могут решить.</li> <li>Не нужно нанимать, обучать и онбордить джуниоров. Работать придется как минимум с такими же профессионалами, а зачастую - с куда более опытными.</li> <li>Никакого аккаунт-менеджмента, политики, тендеров. Наши клиенты знают, что и почему они у нас покупают. И нам не нужно доказывать, чем мы лучше других.</li> <li>Никакой рутины. Если одно и то же делается дважды - это можно автоматизировать.</li> <li>Никаких &quot;грязных&quot; Ad-Hoc решений &quot;на коленке&quot;. Вся продуктовая команда и команда разработки будет работать на то, чтобы снабдить тебя самыми передовыми инструментами и технологиями для решения задач.</li> <li>Ну и самое главное - опыт работы на международном рынке!</li> </ul> <p><strong>Чем это лучше работы in-house?</strong></p> <ul> <li>Это интереснее. Каждая новая вертикаль имеет свои уникальные задачи, которые нам предстоит решать. Задачи порой настолько сложные, что in-house командам просто не хватает экспертизы их решить.</li> <li>Никакой рутины. В in-house командах, BI-специалисты - это не ключевая роль, задача которых по запросу бизнеса делать разные отчеты и прочие поручения. У нас BI-специалист - это ключевая роль, через которую компания получает кейсы применения технологий на реальных и, зачастую, самых интересных задачах бизнеса.</li> <li>Крутая команда. Один в поле не воин, с тобой в команде будут работать наши лучшие продакт-менеджеры, дата инженеры, дата сайнтисты и разработчики. Собрать такую команду in-house, которая специализируется именно на работе с данными почти невозможно.</li> <li>Новейшие технологии. Никаких AirFlow на своих серверах, никаких кривых Jupiter и Python, запущенных на локальном компьютере. У нас тебя ждут масштабируемые системы сбора данных, современные Dataflow системы и хранилища данных, инновационные методы обработки данных, машинное обучение и многое другое.</li> <li>А если на чистоту - наших специалистов мечтает нанять любой наш клиент. Вот только они не сильно хотят уходить :)</li> </ul> <p><strong>Мы ждем что ты:</strong></p> <ul> <li>Понимаешь существующие системы аналитики и работал в сфере маркетинговой аналитики (на стороне агентства или на стороне клиента);</li> <li>Экспертно владеешь SQL и умеешь применять его для извлечения инсайтов из данных;</li> <li>Владеешь BI-инструментами, такими как Power BI, Google DataStudio, Tableau и другие.</li> <li>Понимаешь, как отобразить сложные бизнес-требования в виде понятных метрик, таблиц и графиков;</li> <li>Ненавидишь плохой код, и умеешь создавать элегантные и масштабируемые решения;</li> <li>Владеешь английским на уровне как минимум свободного письменного общения</li> </ul> <p><strong>Кроме всего прочего, мы предложим:</strong></p> <ul> <li>Правильную зарплату;</li> <li>Опционы;</li> <li>Удаленная работа;</li> <li>Драйв, крутую команду, и атмосферу, где важен результат и отсутствует любая бюрократия;</li> </ul> <p>Если описанное выше показалось тебе интересным - ждем твоего отклика!</p> <p>Будь готов, что мы пришлем интересное тестовое задание, которое поможет нам понять твои навыки владения SQL, BI-инструментами и знание доменной области в маркетинговой аналитике .</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Data Transfomrations"},{"name":"Google BigQuery"},{"name":"Data Analysis"},{"name":"Dashboards"},{"name":"Анализ данных"},{"name":"Визуализация данных"},{"name":"Power BI"},{"name":"Data Studio"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.359","name":"Электронная коммерция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.137","name":"Маркетинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"10","name":"Аналитик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1564038","name":"SegmentStream","url":"https://api.hh.ru/employers/1564038?host=hh.ru","alternate_url":"https://hh.ru/employer/1564038","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/635972.png","90":"https://hhcdn.ru/employer-logo/2985040.png","240":"https://hhcdn.ru/employer-logo/2985041.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1564038&host=hh.ru","trusted":true},"published_at":"2021-11-11T15:22:20+0300","created_at":"2021-11-11T15:22:20+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49546296","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49546296","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}