{"id":"49573001","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Full stack developer - RiskFinder ERM","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Озерковская набережная","building":"24к3","description":null,"lat":55.739919,"lng":37.635745,"raw":"Москва, Озерковская набережная, 24к3","metro":{"station_name":"Новокузнецкая","line_name":"Замоскворецкая","station_id":"2.89","line_id":"2","lat":55.742391,"lng":37.62928},"metro_stations":[{"station_name":"Новокузнецкая","line_name":"Замоскворецкая","station_id":"2.89","line_id":"2","lat":55.742391,"lng":37.62928},{"station_name":"Третьяковская","line_name":"Калужско-Рижская","station_id":"6.90","line_id":"6","lat":55.74073,"lng":37.625624},{"station_name":"Третьяковская","line_name":"Калининская","station_id":"8.91","line_id":"8","lat":55.741125,"lng":37.626142}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Role Description</strong></p> <p>Russia Technology Center is looking to expand its internal Technology capability in Moscow to provide best in class technology solutions for the Banking industry.</p> <p>You will work as part of a cross-functional agile delivery team, including analysts, developers and testers. You will bring an innovative approach to software development, focusing on using the latest technologies and practices, as part of a relentless focus on business value.</p> <p>You will be someone who sees engineering as team activity, with a predisposition to open code, open discussion and creating a supportive, collaborative environment. You will be ready to take a leading role in all stages of software delivery, from initial analysis right through to production support.</p> <p>Responsible for developing, enhancing, modifying and/or maintaining applications in the Enterprise Risk Technology environment. Software developers design, code, test, debug and document programs as well as support activities for the corporate systems architecture. Employees work closely with business partners in defining requirements for system applications. Employees typically have in-depth knowledge of development tools and languages. Is clearly recognized as a content expert by peers. Individual contributor role.</p> <p><strong>Duties And Responsibilities</strong></p> <ul> <li>Responsible for developing software in Java, object-oriented database and grid using Kubernetes and open shift platform.</li> <li>Responsible for building REST web services</li> <li>Responsible for designing interface between UI and REST service.</li> <li>Responsible for building data-grid centric UI based on Angular framework.</li> <li>Participating fully in the development process through the entire software lifecycle.</li> <li>Participating fully in Agile software development process</li> <li>Use BDD techniques, collaborating closely with users, analysts, developers and other testers. Make sure we are building the right thing.</li> <li>Write code and write it well. Be proud to call yourself a programmer. Use test driven development, write clean code and refactor constantly. Make sure we are building the thing right.</li> <li>Be ready to work on a range of technologies and components, including user interfaces, services and databases. Act as a generalizing specialist.</li> <li>Define and evolve the architecture of the components you are working on and contribute to architectural decisions at a department and bank-wide level.</li> <li>Ensure that the software you build is reliable and easy to support in production. Be prepared to take your turn on call providing 3rd line support when it’s needed</li> <li>Help your team to build, test and release software within short lead times and with minimum of waste. Work to develop and maintain a highly automated Continuous Delivery pipeline.</li> <li>Help create a culture of learning and continuous improvement within your team and beyond</li> </ul> <p><strong>Experience / Requirements (Required)</strong></p> <ul> <li>Deep knowledge of at least one modern programming language, along with understanding of both object oriented and functional programming. Ideally knowledge of Java and Scala.</li> <li>Practical experience of test driven development and constant refactoring in continuous integration environment.</li> <li>An understanding of web technologies, frameworks and tools, for example: HTML, CSS, Javascript, Angular, Bootstrap, React, D3, Node.js</li> <li>Experience or Exposure to BigData Hadoop technologies / BI tools will be an added advantage</li> <li>Experience in Oracle PL/SQL programming is required</li> <li>Knowledge of SQL and relational databases</li> <li>Experience working in an agile team, practicing Scrum, Kanban or XP</li> <li>Experience of performing Functional Analysis is highly desirable</li> <li>Experience of Automated Testing is highly desirable</li> </ul> <p><strong>Experience / Requirements (Preferred)</strong></p> <ul> <li>Behaviour Driven Development, particularly experience of how it can be used to define requirements in a collaborative manner to ensure the team builds the right thing and create a system of living documentation</li> <li>Experience with a range of technologies that store, transport and manipulate data, for example: relational databases, nosql, document databases, graph databases, Hadoop/HDFS, streaming and messaging</li> <li>Architecture and design approaches that support rapid, incremental and interative delivery, such as Domain Driven Design, CQRS, Event Sourcing and microservices</li> </ul> <ul> <li>We are looking for great Techologists first. Useful but not essential would be knowledge gained in Financial Services environments, for example products, instruments, trade lifecycles, regulation, risk, financial reporting or accounting<br /><br /><strong>What we offer</strong></li> <li>Flexible working hours</li> <li>Partially remote work</li> <li>Comfortable office located in the city center</li> <li>Extended insurance package: medical and life insurance + partial coverage for spouse and children</li> <li>Plenty of professional learning opportunities: English courses, professional trainings and certification, conferences participation</li> <li>Relocation package (for new-joiners from other locations)</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"JavaScript"},{"name":"Oracle Pl/SQL"},{"name":"SQL"},{"name":"AngularJS"},{"name":"React"},{"name":"Java"}],"accept_handicapped":true,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.395","name":"Банковское ПО","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1641540","name":"Deutsche Bank Technology Center","url":"https://api.hh.ru/employers/1641540?host=hh.ru","alternate_url":"https://hh.ru/employer/1641540","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/248505.jpg","90":"https://hhcdn.ru/employer-logo/1436693.jpeg","240":"https://hhcdn.ru/employer-logo/1436694.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1641540&host=hh.ru","trusted":true},"published_at":"2021-11-21T12:06:54+0300","created_at":"2021-11-21T12:06:54+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49573001","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49573001","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}