{"id":"49577523","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Продуктовый аналитик (Content)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"Мы - <strong>СберМаркет</strong> - онлайн-сервис, который помогает делать покупки у любимых ритейлеров, не выходя из дома. Проект вырос на базе Instamart - мы были небольшим, но гордым стартапом, который показал самые выдающиеся на рынке результаты. Благодаря этому в нас поверила и присоединила к себе самая мощная экосистема: Сбер. Теперь мы №1 по объему на рынке e-grocery. <p><br /><strong>Зачем тебе к нам?</strong></p> <ul> <li>Аналитик в Сбермаркет – это не &quot;рабочие руки&quot;. В отличие от большинства компаний, где аналитики только и строят дашборды, ты будешь лидировать / сопровождать проекты в полном цикле, прокачивая <strong>как свои менеджерские качества, так и технические</strong></li> <li>Отдел контента – это главный помощник для нашего пользователя: прогулbваясь по магазину, он доверяет своим органам чувств, а используя сайт или приложения ему приходится довериться нам. В твоих руках будет один будет важнейший инструментов для решения потребностей покупателя, а значит, и <strong>сильнейший рычаг для роста бизнеса;</strong></li> <li>Твой <strong>потенциал роста в компании не ограничен</strong> – аналитики не просто помогают бизнесу принимать решения на основе данных, но и сами отвечают за ключевые направления в компании (прибыльность, эффективность платформы и т.д.)</li> </ul> <p><strong>Что предстоит делать?</strong></p> <ul> <li>С помощью данных отвечать на важные вопросы: каким должны быть дерево каталога? от каких категорий нужно избавиться? какие фильтры нужны пользователю в первую очередь? как наличие фотографии влияет на выбор товара?</li> <li>Стать owner&#39;ом аналитики Content: совместно с командой продумывать метрики, выдвигать и проверять гипотезы, строить визуализации</li> <li>Работать с event-аналитикой: дизайнить события и проверять их целостность</li> </ul> <p><strong>Чего ждем от кандидата?</strong></p> <ul> <li>Ты прекрасно знаешь SQL, любишь оконные функции и умеешь избавляться от дублей (и не создавать их)</li> <li>Ты ценишь автономность и время коллег: сперва ищешь ответы в goolge/slack/confluence и уже после штурмуешь личные сообщения</li> <li>Ответственность – твое второе имя: ты умеешь управлять своим временем и ожиданиями команды, поэтому изменения не становятся сюрпризами</li> </ul> <p><strong>Будет плюсом</strong></p> <ul> <li>Опыт дизайна и анализа A/B-экспериментов</li> <li>Опыт работы в e-com</li> <li>Опыт работы с Tableau или другими BI-инструментами</li> </ul> <p><strong>Условия</strong></p> <ul> <li>Офис в центре Москвы, но можно частично или полностью работать удаленно;</li> <li>Конкурентная заработная плата (по итогам технического интервью);</li> <li>ДМС, компенсация перелетов, фитнес, льготные покупки в Сбермаркете;</li> <li>Программа страхования жизни;</li> <li>Регулярное ревью позиции;</li> <li>Приятные сюрпризы от нашей Happiness Team;</li> <li>Программы корпоративного английского языка;</li> <li>Нам важно ментальное и физическое здоровье наших сотрудников, поэтому у нас есть корпоративные психологи и специалист по здоровью;</li> <li>Для комфортной работы мы обеспечиваем всем необходимым (ноутбук, мышь и др.);</li> <li>Для сложных задач мы с удовольствием обеспечим тебе ментора внутри компании или за ее пределами.</li> </ul> <p><strong>Команда</strong></p> <ul> <li>В команде Data&amp;Growth, частью которой мы являемся, больше 120 человек: это аналитики, data scientist-ы и инженеры. Мы все объединены в одну вертикаль, активно общаемся и черпаем друг у друга экспертизу. Например, команда Data Engineers читают лекции про Docker, а Data Scientists раскрывают секреты генеративно-состязательных сетей.</li> <li>В продуктовой аналитике тебя ждет 12 прекраснейших аналитиков, с которыми тебе предстоят брейнштормы, cross-review и циклы обратной связи.</li> <li>Ты также станешь частью одной из продуктовых команд и будешь работать напрямую с менеджером по продукту, общаться с разработчиками, дизайнерами и тестировщиками.<br /><br /><strong>Скорее оставляй свой отклик и становись частью нашей дружной команды :)</strong></li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Tableau"},{"name":"SQL"},{"name":"Python"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"10","name":"Аналитик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1272486","name":"СберМаркет","url":"https://api.hh.ru/employers/1272486?host=hh.ru","alternate_url":"https://hh.ru/employer/1272486","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3899103.png","240":"https://hhcdn.ru/employer-logo/3899104.png","original":"https://hhcdn.ru/employer-logo-original/864557.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1272486&host=hh.ru","trusted":true},"published_at":"2021-11-12T13:27:21+0300","created_at":"2021-11-12T13:27:21+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49577523","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49577523","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}