{"id":"49594813","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Data Engineer, Remote","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":3000,"to":6000,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>THIS IS A FULLY REMOTE JOB</strong></p> <p><strong>SUBMIT APPLICATION AT<br />https://tribesai.recruitee.com/o/senior-data-engineer-global-remote/c/new </strong></p> <p><strong>ABOUT THE JOB</strong></p> <p>We are looking for a <strong>Senior Data Engineer</strong> to become a core member of our team and to help us wrangle a super interesting dataset with millions of work interactions all loaded into one massive graph database!</p> <p>The successful candidate should have a passion for data engineering and the ability to innovate - there will be no instructions booklet, it&#39;s up to you and the team to develop a new cutting edge application from scratch while following software engineering best practice. However, above all else, you should enjoy working independently in a startup environment with all the pros and cons that that entails. You would be filling a key senior role in our young team which we think requires at least 4-5 years of hands on data engineering experience but we are known to have made exceptions if we really like someone :)</p> <p><strong>RESPONSIBILITIES</strong></p> <p>Your job responsibilities would include ...</p> <ul> <li>Development, automation and scaling of our data pipeline</li> <li>Implement established best practice where appropriate, innovate where not</li> <li>Identify, design and implement process improvements (i.e. automate manual processes, re-design infrastructure, etc)</li> <li>Mentor junior data engineers</li> </ul> <p><strong>ABOUT US</strong></p> <p><strong>Tribes.AI</strong> is a new startup aiming to help build strong high-performance teams with advanced analytics.</p> <p>Teams today produce a huge amount of data via everyday activities (emails, meetings, chats, files, tasks, code, etc) that can be mined for trends. This data provides powerful insights into team performance and helps management make more informed decisions about their employees, teams, and clients.</p> <p>The management team at Tribes.AI has already successfully built and sold a large data consulting company, Datalicious. As a result, we understand how valuable our team members are, and how to build working teams that produce results no matter what timezone you are in. We value skilled employees who are at the top of their game, who want to take ownership, and who want to grow with us.</p> <p>If you want to research us some more, we suggest you check out our current team on LinkedIn, what they say on Glassdoor, and our funding progress on Crunchbase.</p> <p><strong>OUR PERKS</strong></p> <p>All team members are offered the following perks ...</p> <ul> <li>Flexible working hours (i.e. we don&#39;t care when you work, within reason, as long as the work gets done)</li> <li>Working from home (i.e. we don&#39;t care from where you work, whatever makes you most productive)</li> <li>Working from home expenses (i.e. we pay for your home Internet and any other reasonable expenses)</li> <li>New laptop via EMI purchase (i.e. you buy it and own it but you can expense the monthly repayments)</li> <li>Unlimited leave (i.e. we don&#39;t count days off so take as many as you need as long as the work gets done)</li> <li>Training courses (i.e. we want you to keep learning so we pay for relevant courses and give you time off)</li> <li>Share options plan (i.e. once you&#39;re past probation you will get access to our employee share options plan)</li> <li>Opportunity to fast track your career with our highly motivated team</li> </ul> <p><strong>TECHNICAL SKILLS</strong></p> <p>To be successful, you would need the following skills ...</p> <ul> <li>Excellent problem-solving skills are a must-have</li> <li>Solid hands-on experience with <strong>Apache Airflow</strong> is a must-have</li> <li>Experience developing and maintaining distributed system is another must-have</li> <li>Solid understanding of software engineering standards, methods and design principles is a must-have</li> <li>Hands-on experience with Google Kubernetes would be a big plus</li> <li>Familiarity with Google Cloud Platform tools in general is a bonus</li> <li>Experience with graph databases such as Neo4j would be nice</li> <li>Understanding of GraphQL APIs would also be helpful along the line</li> </ul> <p><strong>SOFT SKILLS</strong></p> <p>All our team members should be ...</p> <ul> <li>Capable of working with almost no supervision (i.e. be self-driven, able to organize their own tasks, QA their own work and spot their own errors, explore new approaches, manage time frames/deadlines, etc)</li> <li>Great written and spoken communicators (i.e. solid written and spoken English skills, efficiently use of instant messaging and other remote team platforms, ability to document code/tasks, know when to bother other people with their own problems, etc)</li> <li>Team workers with a strong collaborative attitude (i.e. interest in other team member&#39;s challenges, ready to help with constructive suggestions unasked, never make any fuss about other people&#39;s mistakes, positive can-do attitude all around, etc)</li> <li>Obsessed with perfection and driven by a constant need to optimize (i.e. always wanting to look for a way of doing things even better than they already are, etc)</li> <li>Hungry for knowledge and passionate about their chosen discipline in the right way (i.e. not merely applying the most fancy algorithms or tools but instead the ones best suited to solve the business problem at hand)</li> <li>Committed as in ready to stay with us for the long run (i.e. recruitment, on-boarding, and training are extremely time-consuming tasks we do not want to go through time and time again)</li> </ul> <p><strong>PLEASE DO NOT APPLY</strong></p> <ul> <li>You do not know how to write optimized code efficiently (i.e. fast)</li> <li>You do not have experience managing infrastructure to support pipelines</li> <li>You do not feel comfortable working for a startup</li> <li>You do not believe in what Tribes.AI is doing</li> </ul> <p><strong>SUBMIT APPLICATION AT<br />https://tribesai.recruitee.com/o/senior-data-engineer-global-remote/c/new </strong></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Shell Scripting"},{"name":"Apache Airflow"},{"name":"Kubernetes"},{"name":"Google Cloud Platform"},{"name":"Neo4j"},{"name":"GraphQL"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5851812","name":"Tribes.AI","url":"https://api.hh.ru/employers/5851812?host=hh.ru","alternate_url":"https://hh.ru/employer/5851812","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5851812&host=hh.ru","trusted":true},"published_at":"2021-11-13T07:48:40+0300","created_at":"2021-11-13T07:48:40+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49594813","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49594813","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}