{"id":"49632113","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"UX/UI Designer (Remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":4000,"to":5000,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Ennabl is a startup headquartered in Greenwich, CT with a global team across multiple time zones. At Ennabl, we are building a modern connected platform for insurance brokers and agents. Ennabl is a modern platform that unifies, organizes and advances enriched data by role and function to accelerate the ability of insurance brokers and agents to source, advise and manage clients. Ennabl links tools, data and people to work together for better outcomes.</p> <p><strong>Who we are looking for ?</strong></p> <p>We’re looking for someone who is excited about our mission to enable insurance brokers and agents to be agile and data first. We believe great ideas and strong execution come from people who are mission-driven. As a UX/UI Designer at Ennabl, you will have the unique opportunity to make a huge impact on changing an industry. At Ennabl, we put our end users first - something that the insurance industry has struggled to do. You will collaborate with a group of peers with deep industry experience coupled with a proven track record of transforming large corporations as well as creating highly successful startups.</p> <p><strong>Why join us ?</strong></p> <p>There are many reasons to join us, but here are just a few:</p> <ul> <li>People are our main asset - we are a great collaborative and friendly team of professionals where every voice is being heard and everyone is ready to help you. Be sure you will feel safe and cozy for your very first day! Moreover, occasionally we get together in some cool places like New York, Dominican Republic to have some fun and get to know each other better.</li> <li>At ennabl, we insist on the highest standards of code quality, we use only modern programming languages and libraries (no legacy code!) and we have a ton of interesting engineering problems to solve!</li> <li>Every employee is an OWNER and is offered company equity;</li> <li>Fully remote work - want to work from a cottage by the sea? Go for it!</li> <li>All employees receive best-in-class equipment (latest MacBook Pro, Apple keyboard/mouse/trackpad, etc.) - we ensure that our employees are not hindered by outdated hardware;</li> <li>&quot;No Meetings Wednesday&quot; - All employees are guaranteed at least one day with no distractions with formal meetings - your time to code, code, code!</li> <li>Regular lunch &amp; learn sessions - great opportunity to share your knowledge or learn something new;</li> <li>Learning days - we believe that as an engineer part of your job is to always look around and learn new technology, new trends in software development, etc. So we periodically run learning days when at least 4 hours of your time is dedicated to learn new stuff, you choose any topic/technology you&#39;re interested in and just learn&amp;experiment!</li> <li>If you reside outside of Ireland we provide an opportunity to relocate to our software development center in Dublin, Ireland and receive compensation in Euros.</li> </ul> <p><strong>What You Will Do</strong></p> <ul> <li> <p>Develop and drive forward the design vision to align with the company vision and help inform Product and Design team roadmaps and goal setting</p> </li> <li> <p>Establish and lead an iterative UX design process utilizing Figma with UI Components</p> </li> <li> <p>Create fully interactive prototypes within Figma</p> </li> <li> <p>Provide feedback and guidance around all facets of the product design process, including: user experience design, interface design, and visual design</p> </li> <li> <p>Work closely with clients, prospects, and stakeholders to understand their current and future needs so ideas can be translated into product functionality</p> </li> <li> <p>Partner with the product and engineering team to create 0-1 products</p> </li> </ul> <p><strong>Basic Qualifications</strong></p> <ul> <li> <p>Strong knowledge and experience using Figma and Component UI Libraries</p> </li> <li> <p>Fluent both in English and Russian <strong>(please submit your CV in English)</strong></p> </li> <li> <p><strong>working hours: 14:00-23:00 MSK</strong></p> </li> <li> <p>Solid Understanding of Usability Heuristics and Information Architecture</p> </li> <li> <p>2+ years designing dashboards or other browser based SaaS products</p> </li> <li> <p>Strong organizational skills and the ability to clearly share ideas across teams</p> </li> <li> <p>Ability to successfully manage multiple projects, teams, and backlogs</p> </li> <li> <p>A strong commitment to enrich the iterative design process</p> </li> </ul> <p><strong>Preferred Qualifications</strong></p> <ul> <li>startup experience, preferably in a CRM environment</li> </ul> <p> </p> <p> </p> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Figma"},{"name":"UI"},{"name":"UX"},{"name":"Usability"},{"name":"Teamplayer"},{"name":"Communication skills"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.475","name":"Игровое ПО","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"11.62","name":"Дизайн, графика, живопись","profarea_id":"11","profarea_name":"Искусство, развлечения, масс-медиа"},{"id":"3.48","name":"Верстальщик","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"},{"id":"3.64","name":"Дизайнер","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"professional_roles":[{"id":"34","name":"Дизайнер, художник"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5114471","name":"Ennabl Inc","url":"https://api.hh.ru/employers/5114471?host=hh.ru","alternate_url":"https://hh.ru/employer/5114471","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/804172.png","90":"https://hhcdn.ru/employer-logo/3657575.png","240":"https://hhcdn.ru/employer-logo/3657576.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5114471&host=hh.ru","trusted":true},"published_at":"2021-11-21T13:20:20+0300","created_at":"2021-11-21T13:20:20+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49632113","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49632113","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":true}