{"id":"49729194","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Full Stack Engineer (Remote Working)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>This is a remote working role, we have opportunities for Full Stack Engineers / Servers Programmers at all levels from &#39;Regular&#39; to &#39;Senior&#39; and &#39;Lead&#39;. </strong></p> <p>Kwalee is one of the world’s leading multiplatform game publishers, with well over 600 million downloads worldwide for mobile hits such as Draw It, Teacher Simulator, Let’s Be Cops 3D and Makeover Studio 3D. Alongside this, we also have a growing PC and console team of incredible pedigree that is on the hunt for great new titles to join TENS! and Eternal Hope.</p> <p>With a team of talented people collaborating daily between our studios in Leamington Spa, Bangalore and Beijing, or on a remote basis from Turkey, Brazil, the Philippines and many more, we have a truly global team making games for a global audience. And it’s paying off: Kwalee games have been downloaded in every country on earth! If you think you’re a good fit for one of our remote vacancies, we want to hear from you wherever you are based.</p> <p>Founded in 2011 by David Darling CBE, a key architect of the UK games industry who previously co-founded and led Codemasters for many years, our team also includes legends such as Andrew Graham (creator of Micro Machines series) and Jason Falcus (programmer of classics including NBA Jam) alongside a growing and diverse team of global gaming experts. Everyone contributes creatively to Kwalee’s success, with all employees eligible to pitch their own game ideas on Creative Wednesdays, and we’re proud to have built our success on this inclusive principle. Could your idea be the next global hit?</p> <p><strong>What will you be doing?</strong></p> <p>As Full Stack Engineer you will write code that will run on 100s of servers thousands of times a second helping our games run smoothly, you will have to work out how to deal with massive amounts of data efficiently, train machines to crunch data and generally play around with the latest and greatest in tech.</p> <p>You love to write efficient code and tackle hard puzzles, you like working with a committed team.</p> <p><strong>What you tell your friends you do</strong></p> <p>“I’m the hero of the day, when actually I only needed to fix one line of code”</p> <p><strong>What you will really be doing</strong></p> <ul> <li> <p>Contributing to the design and architecture of our servers using Python with Flask deployed on AWS EC2 Servers.</p> </li> <li> <p>Implementing server features to robustly support millions of mobile game players.</p> </li> <li> <p>You’ll be working with a worldwide multi cluster Couchbase and Elasticsearch database.</p> </li> <li> <p>Interfacing with other teams on any server-related issues affecting them.</p> </li> </ul> <p><strong>How you will be doing this</strong></p> <ul> <li> <p>You’ll be part of an agile, multidisciplinary and creative team and work closely with them to ensure the best results.</p> </li> <li> <p>You’ll think creatively and will be motivated by challenges and constantly striving for the best.</p> </li> <li> <p>You’ll work with cutting edge technology, if you need software or hardware to get the job done efficiently, you can get it. We even have a robot!</p> </li> </ul> <p><strong>Team</strong></p> <p>Our talented team is our signature. We have a highly creative atmosphere with more than 150 staff where you’ll have the opportunity to contribute daily to important decisions. You’ll work within an extremely experienced and passionate team, including David Darling and the creator of the Micro Machines video games.</p> <p><strong>Skills and requirements</strong></p> <ul> <li> <p>A proven track record of writing high quality database and program code for servers with Python. We are considering different levels of experience (from several months to years).</p> </li> <li> <p>The ability to write quick scripts to accelerate manual tasks.</p> </li> <li> <p>Knowledge of NoSQL databases (Couchbase, MongoDB, Cassandra, Memcache,etc.) could be useful but it’s not mandatory.</p> </li> <li> <p>Knowledge of Unix, Linux or equivalent development environments</p> </li> <li> <p>Some experience in game development would be a plus, although it’s not necessary.</p> </li> <li> <p>An avid interest in either console, PC or mobile games.</p> </li> </ul> <strong>We offer</strong> <ul> <li> <p>You can either work REMOTELY or in our Leamington Spa office surrounded by a great bunch of people!</p> </li> <li> <p>We want everyone involved in our games to share our success, that’s why we have a generous team profit sharing scheme from day 1 of employment</p> </li> <li> <p>In addition to a competitive salary we also contribute to your pension, offer private medical cover and life assurance</p> </li> <li> <p>Creative Wednesdays! (Design and make your own games every Wednesday)</p> </li> <li> <p>Access to on site gym - no more skiving!</p> </li> <li> <p>25 days of paid holidays plus bank holidays</p> </li> <li> <p>Great work-life balance with flexible working hours</p> </li> <li> <p>Quarterly team building days - work hard, play hard!</p> </li> <li> <p>Entertainment area with consoles, pool table, tennis table and darts!</p> </li> <li> <p>Monthly employee awards</p> </li> <li> <p>Free snacks, fruit and drinks</p> </li> </ul> <p><strong>Our philosophy</strong></p> <p>We firmly believe in creativity and innovation and that a fundamental requirement for a successful and happy company is having the right mix of individuals. With the right people in the right environment anything and everything is possible.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Flask"},{"name":"NoSQL"},{"name":"aws"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.744","name":"Другое","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5409951","name":"Kwalee","url":"https://api.hh.ru/employers/5409951?host=hh.ru","alternate_url":"https://hh.ru/employer/5409951","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5409951&host=hh.ru","trusted":true},"published_at":"2021-11-20T17:53:26+0300","created_at":"2021-11-20T17:53:26+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49729194","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49729194","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}