{"id":"49758453","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Solutions Architect - Application Development and Middleware (Red Hat Russia, Moscow Office)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>The Red Hat Sales team is looking for a Solutions Architect to join us in Moscow, Russia. In this role, you will support Red Hat OpenShift and Red Hat Middleware including Red Hat Integration, Red Hat Runtimes and Process Automation and Platform-as-a-Service (PaaS) sales efforts in Russia and CIS. You will serve as a top technical expert and use your business insight to present executive lT leadership with a compelling business case to invest in Red Hat’s middleware solutions. You&#39;ll collaborate with the Sales team and technical delivery teams to bring our customers the best solutions from across the Red Hat middleware solutions suite, including PaaS, business process management (BPM), middleware migrations, integration offerings, mobile, and more. As a Solutions Architect, you’ll need to have excellent communication and people skills, as you&#39;ll be a crucial part of the first major experience our customers have with Red Hat.</p> <p> </p> <p><strong>Primary Job Responsibilities:</strong></p> <ul> <li> <p>Conduct compelling presentations and live demonstrations of Red Hat OpenShift, Red Hat Middleware portfolio (Red Hat Integration, Red Hat Runtimes and Process Automation) including Red Hat AMQ, AMQ Streams, Red Hat Fuse, Red Hat 3Scale API Management for modernization of application development</p> </li> <li> <p>Provide technical credibility to customers and partners</p> </li> <li> <p>Discover and analyze customer business and technical needs</p> </li> <li> <p>Take the lead in answering technical portions of RFPs and RFIs</p> </li> <li> <p>Collaborate with the Sales and technical delivery teams to bring our customers the most efficient solutions</p> </li> <li> <p>Architect, design, and present multiproduct solutions to customers</p> </li> <li> <p>Support the Sales team with recommendations for development and implementation of complex solutions to achieve sales quotas</p> </li> <li> <p>Meet revenue goals, deployment, and service objectives while sustaining good relationships with the existing and prospective customers</p> </li> <li> <p>Create user stories and contribute to live demos</p> </li> </ul> <p><strong>Required Skills</strong></p> <ul> <li> <p>Development experience with application servers (IBM WebSphere, Jakarta EE, Red Hat EAP/Wildfly, Oracle WebLogic, etc)</p> </li> <li> <p>Experience with middleware solutions like application servers, integration, and BPM; knowledge of data virtualization and mobile solutions is a plus</p> </li> <li> <p>Experience with competing or similar application containers like Docker, Kubernetes, IBM Bluemix, Pivotal Cloud Foundry (PCF), etc.</p> </li> <li> <p>Experience with DevOps and continuous integration (CI) or continuous delivery (CD) tools like Jenkins, Maven, Git, and Apache Subversion (SVN) and the agile methodology</p> </li> <li> <p>Experience with API management tools (IBM API Connect, Oracle Web Services Manager, WSO2 API Manager etc)</p> </li> <li> <p>Knowledge of application architecture (MVC and Model 2, patterns, JDBC, CVS, build management, etc.)</p> </li> <li> <p>Knowledge of enterprise architecture and Enterprise Integration Patterns</p> </li> <li> <p>Familiarity with microservices architecture with technology like JavaScript, Node.js, AngularJS, Backbone.js, Spring, or Spring Boot with technology like JavaScript, Node.js, AngularJS, Backbone.js, Spring, or Spring Boot</p> </li> <li> <p>Experience with architecting and deployment Linux-based solutions</p> </li> <li> <p>Presales and sales engineering experience</p> </li> <li> <p>Ability to explain technical concepts to non-technical audiences</p> </li> <li> <p>Good presentation skills; ability to present to small and large groups of mixed business, technical, and management audiences</p> </li> <li> <p>Ability to work well within a team</p> </li> <li> <p>Excellent written and verbal communication skills</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"JavaScript"},{"name":"Business Development"},{"name":"Jenkins"},{"name":"Leadership Skills"},{"name":"Continuous Integration"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.112","name":"Компьютерные программы","profarea_id":"17","profarea_name":"Продажи"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2722295","name":"Red Hat","url":"https://api.hh.ru/employers/2722295?host=hh.ru","alternate_url":"https://hh.ru/employer/2722295","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/396578.jpg","90":"https://hhcdn.ru/employer-logo/2028566.jpeg","240":"https://hhcdn.ru/employer-logo/2028567.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2722295&host=hh.ru","trusted":true},"published_at":"2021-11-18T15:10:51+0300","created_at":"2021-11-18T15:10:51+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49758453","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49758453","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}