{"id":"49779545","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior IT Recruiter (CIS)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":200000,"to":250000,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>We are looking for a <strong>Senior IT Recruiter</strong> to attract top technical talent in order to scale SegmentStream to the next level of its growth (from 25 to 100+ employees).</p> <p>We are looking for someone who is not afraid of working independently without instruction but who also enjoys collaborating cross-functionally, and to lead their own teams.</p> <p>Although we’ve been around for a few years now, we still consider ourselves a startup, which means we need someone who can reprioritize quickly and adapt to an ever-changing business.</p> <p>About us:</p> <p>At <strong>SegmentStream</strong>, we are building a cutting-edge marketing technology that is changing how leading businesses analyse and optimise the performance of their online marketing campaigns.</p> <p>Our SaaS platform helps advanced digital marketing teams apply our own sophisticated machine learning algorithms to reveal the true incremental value of each marketing channel and campaign, and automatically apply these AI-insights to close the loop of data-driven marketing.</p> <p>We’ve proven that our technology works and delivers the best ROAS possible for our enterprise clients across the globe. Check our latest success stories and you’ll understand why our solution is the next big thing in the digital marketing world.</p> <p>We are fortunate to be VC-backed by one of the world’s leading startup accelerators - <strong>TechStars</strong>, as well as some biggest names in the B2B SaaS world, including the founders of <strong>Pipedrive</strong>, <strong>Dynamic Yield</strong>, and other great companies.</p> <p>We are also proud to say that SegmentStraem is already trusted by <strong>over 50 enterprise customers</strong> around the world, including the UK, US, Canada, Australia, and lots of European countries.</p> <p>Responsibilities:</p> <ul> <li>Find &amp; attract top technical talent, get them excited about job opportunities at SegmentStream, and manage the interview process until the candidate accepted the job offer, and successfully joined our team.</li> <li>Produce high-volume recruiting pipelines for 5+ different roles at a time, to make sure we can hire a great candidate for any position within 2 months from the job opening.</li> <li>Use your recruitment/headhunting experience to attract the best candidates for our key positions and sell them the opportunity of joining SegmentStream at the current stage of the company development.</li> <li>Work closely with founders &amp; hiring managers to define clear roles and recruiting strategies: which people we need to hire, what they’ll be doing, where to find, and how to evaluate them.</li> </ul> <p>Requirements:</p> <ul> <li><strong>3+ years in IT/Tech recruitment</strong> with experience in hiring for young tech startups and fast-growing product companies (up to 200 employees).</li> <li>A strong track record of successful hiring for IT/Tech roles in Russia &amp; CIS, including <strong>software engineering, data engineering, data science, technical product management,</strong> and others. Take a look at our open positions here.</li> <li>A vast experience in headhunting/recruiting top talent for various senior-level positions. You know how to attract the best candidates that are not looking for a job, and excite them about your career opportunities;</li> <li>Personable and able to keep a positive attitude under stressful and shifting circumstances;</li> <li>Highly organized and autonomous;</li> <li>English C1 or above;</li> </ul> <p>Why SegmentStream:</p> <ul> <li>Unique and high-quality SaaS product that solves a massive problem for a huge market;</li> <li>A vast portfolio of enterprise customers around the globe including the UK, US, Canada, Australia, and lots of European countries;</li> <li>VC-backed by top investors &amp; angels, including TechStars, founders of Pipedrive, Dynamic Yield, and other great SaaS entrepreneurs;</li> <li>Fast-growing, fully distributed, and international team of smart people who not only love what they do but are also really good at it;</li> <li>A great company culture that is embracing functional ownership, entrepreneurial mindset, and personal growth;</li> <li>Full responsibility from day one and being part of our results-driven working environment;</li> <li>A lot of opportunities for future career growth within the company;</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Team management"},{"name":"Recruitment"},{"name":"Analytical skills"},{"name":"Technical Recruitment"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.137","name":"Маркетинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"6.254","name":"Рекрутмент","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"}],"professional_roles":[{"id":"69","name":"Менеджер по персоналу"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1564038","name":"SegmentStream","url":"https://api.hh.ru/employers/1564038?host=hh.ru","alternate_url":"https://hh.ru/employer/1564038","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/635972.png","90":"https://hhcdn.ru/employer-logo/2985040.png","240":"https://hhcdn.ru/employer-logo/2985041.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1564038&host=hh.ru","trusted":true},"published_at":"2021-11-19T11:13:11+0300","created_at":"2021-11-19T11:13:11+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49779545","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49779545","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}