{"id":"49781344","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Product Enablement Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Knoema is looking to add a Product Enablement Manager to our growing Product team. This is an exciting opportunity to join a fast-paced, industry-leading, team that works with some of the biggest global companies. Knoema&#39;s technology delivers the smartest way to organize many internal and external data sources of our enterprise clients for discovering, packaging, and sharing data insights driving critical business decisions in the era of digital transformation.</p> <p>You will be responsible for articulating relevant product knowledge to departments across the organization to improve employee productivity and to ensure company-wide alignment. The role emphasizes having a clear sense of the product’s concept, purpose, user personas, and advantages over competitors as well as understanding of the needs of various internal stakeholders. The Product Enablement Manager is expected to gain the product knowledge and translate it into training and educational resources for departments across the company. The role is accountable for improving departments’ effectiveness through better knowledge of the product.</p> <p>Extensive experience in technical writing, i.e. understanding and communicating the technical aspects of a digital product to both highly technical and non-technical users will be paramount. Experience in market research and analysis, product positioning and messaging is a must. The role requires the ability to effectively communicate with internal stakeholders from cross-functional teams. The candidates for this Product Enablement Manager role will have to demonstrate the ability to work independently.</p> <p>Your goal is to ensure cross-functional teams are in sync with regard to product knowledge. You will be a core part of the product team working closely with multi-disciplined internal teams: product marketing, engineering, customer success, sales, marketing, and customer service.</p> <p><strong>What you will do:</strong></p> <ul> <li>Work with internal stakeholders to gain an in-depth understanding of the needs of various departments, and translate that insight into programs and resources that resonate with different audiences</li> <li>Develop and execute programs specific to each department that provide relevant product knowledge to that department’s employees</li> <li>Work with product marketing team on collateral for sales enablement</li> <li>Act as an editor to ensure consistency in training documentation</li> <li>Make all training and resources as accessible as can be for all employees</li> <li>Collect and monitor feedback from internal teams to prioritize future programs.</li> </ul> <strong>Required skills and experience:</strong> <ul> <li>Bachelor’s degree in an IT related field</li> <li>5+ years of experience in product marketing, technical writing, or product management role focusing on IT, SaaS, or Data Science</li> <li>Strong verbal and written communication abilities in English: must effectively communicate with technical and non-technical people; the ability to present complex concepts to a wide range of audiences</li> <li>Ability to work autonomously in a highly demanding and often ambiguous environment, with attention to detail.</li> </ul> <strong>We offer: </strong> <ul> <li> <p>Interesting work in an international professional team giving you the opportunity to gain unique experience and knowledge. Regular communication with native English speakers, pumping up your (and our) sense of humor</p> </li> <li> <p>Your continuous professional development is important to us. We pay for employee travel to conferences and training</p> </li> <li> <p>VMI with dental</p> </li> <li> <p>English Courses</p> </li> <li> <p>Fitness reimbursement</p> </li> <li> <p>Cab or parking reimbursement</p> </li> <li> <p>We provide all equipment necessary for work.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Analytical skills"},{"name":"Проведение презентаций"},{"name":"B2C маркетинг"},{"name":"B2B маркетинг"},{"name":"Обучение"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.296","name":"Технический писатель","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.744","name":"Другое","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.89","name":"Интернет","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"73","name":"Менеджер продукта"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"888182","name":"Knoema","url":"https://api.hh.ru/employers/888182?host=hh.ru","alternate_url":"https://hh.ru/employer/888182","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/806048.png","90":"https://hhcdn.ru/employer-logo/3665079.png","240":"https://hhcdn.ru/employer-logo/3665080.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=888182&host=hh.ru","trusted":true},"published_at":"2021-11-22T11:46:20+0300","created_at":"2021-11-22T11:46:20+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49781344","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49781344","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}