{"id":"49799564","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Software Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>The Align Quality Center of Excellence (QCOE) team is looking for a Software Engineer in Automation Engineering to join our team. In this role, you will support our Center of Excellence organization by assisting in building automation needs in the service of a wide range of Engineering and Software Quality Assurance (SQA) teams. In addition, you will work closely with QCOE Managers and Leaders and with Software Engineers as a part of our DevOps Org.</p> <p>To be successful in this position, you will need to have a wide range of automation experience within the SQA space. You will need to design and build solutions related to test automation frameworks (runner, executors, test orchestration), including data visualization (test reporting) within many connected engineering systems. You will also need to have a history with developing these solutions on both internal and AWS infrastructure.</p> <p>This position is not a Test Automation Engineer position, but a history working as one would be beneficial. Your ability to develop solutions in service of a Software Quality Assurance and Quality Center of Excellence are paramount to your success.</p> <p>You will lead the charge on automation through a variety of Industry Standard toolsets as well as interfacing with in-house solutions. You will work closely with other Software Engineers as part of our DevOps org. and other Automation Engineers within QCOE and Internal Tooling groups. You will act as a developer in providing middleware solutions that enable the visibility of our work and develop solutions that drive our ability to excel within the complex ecosystems required of a medical device company. You will work with leaders and peer stakeholders to guide teams, projects, and initiatives, continually developing and improving our SDLC, STLC, and related Quality Engineering processes.</p> <p>Being part of the QCOE is a unique opportunity to help drive a culture of Open Decisions and inner sourced code. Your solutions become force multiplication and pattern-matched for business scalability, where one-off scripts may have challenged long-term maintainability. The architecture of your solutions is a vital part of your job.</p> <p>Finally, you will help influence a generative learning culture in all that you do. Documentation through code, wikis, influence, and any other method helps drive our culture of openness and giving. You will share success with others and grow through mutually beneficial relationships. Your success is also the success of those around you.</p> <p> </p> <p><strong>In this role, you will…</strong><strong> </strong></p> <ul> <li>Design and Develop Tools, Frameworks, and Automated solutions that bridge that gap between a multitude of Test, CI/CD, Reporting, Ticketing, and other tools used within the SDLC and STLC.</li> <li>Develop in a wide range of languages, both OOP and Scripting in nature</li> <li>Work closely with engineers, developers, analysts, and Sr. Leaders to design complementary solutions</li> <li>Enable opportunities by connecting System and Data together through automation</li> <li>Create middleware solutions to manage integrations where no solutions exist</li> <li>Partner with a direct team of Center of Excellence Members on their deliverables</li> <li>Inspire and drive architecturally sound solutions that stand the test of time</li> <li>Participate and promote a culture of collaboration, agility, and ownership within and across teams</li> <li>Own your solutions and be responsible for feature delivery, quality, and performance of the solutions</li> </ul> <p> </p> <p><strong>In this role, you’ll need …</strong></p> <ul> <li>A history building scalable solutions in service of Software Quality Assurance orgs.</li> <li>Expertise in integrating with SDKs, APIs, Screen scaping, DBs, and/or any other method to providing integrated solutions.</li> <li>Expertise in the buildout of Cloud and/or Local infrastructure solutions to support maintainable integrations</li> <li>Strong foundation of Databases, APIs, Web Services, and other modern engineering stack components</li> <li>Proficiency at least one modern development language (Java, Python etc.), and the ability to switch between languages as required</li> <li>Strong foundation in both Object-Oriented Design and Scripting, utilizing each as required, knowing when each is appropriate</li> <li>Experience with modern CI/CD practices and Tooling, including DevOps movement work</li> <li>Experience with Quality Engineering Practices; many of our stakeholders are Engineering and SQA teams</li> <li>Experience with Test Execution and other SQA Automation and SDET support solutions</li> <li>Ability to switch between Languages, Tools, and Systems as necessary to complete integrations</li> <li>Ability to visualize your designs</li> <li>Knowledge of modern Front End Development Frameworks is a plus</li> <li>Be a self-starter and a master of your process: You will have high autonomy and must be able to deliver value within that model</li> <li>4+ years of SDLC (System Development Life Cycle) experience</li> <li>6+ years of experience working in an Individual Contributor model in modern development and delivery practices</li> <li>Bachelor’s degree in computer science or equivalent experience</li> <li>A proven and tested ability to communicate effectively within a company and with those from diverse cultural backgrounds</li> </ul> <p> </p> <p><strong>We offer:</strong></p> <ul> <li>Interesting tasks and the opportunity to work on an innovative product in a strong team</li> <li>Full medical insurance for employees and their children (including dentistry), life insurance, travel insurance, a doctor available in the office</li> <li>100% paid sick leave</li> <li>28 days of paid vacation per year + 3 additional days</li> <li>Lunch allowance</li> <li>Sports and ergonomics of the home workplace</li> <li>Discounts on Invisalign treatment for employees and their family members</li> <li>English courses payment</li> <li>Courses/books/conferences for professional development payment</li> <li>Comfortable office with gym (&quot;Danilovskaya Manufactory&quot;, Tulskaya metro station)</li> <li>Remote work for the pandemic period (hybrid format is possible)</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.117","name":"Тестирование","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"27937","name":"Align Technology","url":"https://api.hh.ru/employers/27937?host=hh.ru","alternate_url":"https://hh.ru/employer/27937","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2227472.png","90":"https://hhcdn.ru/employer-logo/2227471.png","original":"https://hhcdn.ru/employer-logo-original/446376.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=27937&host=hh.ru","trusted":true},"published_at":"2021-11-19T18:56:44+0300","created_at":"2021-11-19T18:56:44+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49799564","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49799564","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}