{"id":"49832790","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data and AI Technical Sales","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Introduction</strong></p> <p>At IBM, work is more than a job – it’s a calling: To build. To design. To code. To consult. To think along with clients and to sell. To make markets. To invent. To collaborate. We want our clients to succeed. IBMers can access our entire organization to develop original ideas that help clients create the world they imagine. Not just to do something better, but to attempt things you’ve never thought possible. We use breakthrough analytic solutions and Cloud platforms to help businesses extract critical insights and transform how they serve their clients. Are you ready to lead in this new era of technology and solve some of the world’s most challenging problems? If so, lets talk.</p> <p>We are looking for a highly motivated and innovative Technical Expert who has a passion for delivering scalable and highly available Data Fabric solutions with advanced analytical, data governance, data pipelines and data repositories to join the Data &amp; AI Technical Sales team in Russia!</p> <p> </p> <p><strong>Your Role and Responsibilities</strong></p> <p>This position serves as a technical sales consultant to our clients and a technical sales leader for sales representatives. The applicant will learn their client’s business and technical requirements, competitive landscape and apply their technical knowledge and experience to recommend new solutions. The applicant will also be delivering demonstrations, and proof of concepts with capabilities of IBM Cloud Pak for Data supporting DataOps capabilities such as Watson Knowledge Catalogue, Data Virtualisation, Data Integration, Master Data Management, Virtual Data Pipelines and IBM and third-party data stores. Chosen applicant will be responsible for collaborating with the sales representatives to define, design, and detail the technical aspects and feasibility of proposed solutions. They will also support technical design solutions and answer technical questions throughout the sales process to progress/close sales and develop customer relationships.</p> <p> </p> <p><strong>Key Responsibilities:</strong></p> <ul> <li>Use technical and business acumen to understand the client’s business requirements, technical requirements and/or competitive landscape</li> <li>Collaborate with IBM sales teams to define, design, and detail the technical aspects and feasibility of proposed solutions</li> <li>Deliver effective Demos, Proof of Concepts (POC), workshops, and execute problem resolution</li> <li>Actively engage with clients to develop the trust and credibility to help them grow their businesses by solving strategic and tactical business problems with IBM’s proven cognitive, AI, and cloud technology solutions</li> <li>Apply IBM brand strategies and offerings, methods and models, to ensure successful design and deliver</li> <li>Understanding current data topologies and workloads, develop, recommend and successfully implement the recommended data architecture for a given use case</li> <li>Continuously build and deliver impactful presentations, develop deep expertise in IBM’s Data &amp; AI technologies and position winning solutions</li> <li>Apply IBM brand strategies and offerings, methods and models, to ensure successful design and delivery</li> <li>Monitor technology trends and influence Track emerging technologies. Model a future-state enterprise architecture that incorporates emerging IBM Cloud Pak for Data (CP4D) as an Integrated end to end platform that is cloud native by design, constructed micro-services and containerized workloads</li> <li>Create and socialize development and testing best practices, coding standards, framework usage, code review tools and processes, contributing to the creation of governing principles and information management repository to guide enterprise architecture decision making</li> <li>Review solutions and designs of peers, including data models and pipeline design, to provide appropriate feedback for performance optimization, supporting peers and IT partners, recommending solutions that reduce/manage risk and deliver value</li> <li>Drive business and technology strategies and initiatives into actionable roadmaps with clear direction on execution to ensure business value and ROI</li> <li>Automate and optimize processes as needed to configure and migrate applications</li> <li>Help resolve Performance/Technical issues during implementations and migrations</li> <li>Create a consistent methodology &amp; process to share across the global team</li> </ul> <p><strong>Required Technical and Professional Expertise:</strong></p> <ul> <li>Bachelor’s Degree in Engineering/Technology or MCA</li> <li>3+ years of data experience with a proven track record in Sales Engineering/Presales/Consulting</li> <li>Familiarity with Data Lake, Data Fabric, Data Centric concepts</li> <li>Familiarity with architecture design, architecture principles and patterns (Lambda, Kappa, microservices)</li> <li>Experience in one or multiple areas data management, data quality, data integration, data virtualization, data governance, big data, ML/AI, analytics</li> <li>Experience in building data solutions (operational, analytical, DWH, data marts)</li> <li>Experience in one or multiple technologies: R, Python, Java, Scala, scripting languages, Spark, Kafka, NiFi, Airflow, S3</li> <li>Proficiency in Query Language: SQL</li> <li>Expertise in exploratory data analysis, data preparation, and data wrangling, building automated data pipelines for cleaning, preparing, and optimizing data for ingestion and consumption</li> <li>Experience with one or more relational and non-relational data stores (Oracle, DB2, MSSQL, Teradata, Postgresql, Greenplum, Hadoop, Object Stores, MongoDb, Snowflake, etc.),</li> <li>– Experience working with various data structures and algorithms</li> <li>Experience with one or more solutions: Informatica, SAP, Alation, Collibra, Denodo, Alteryx, etc.</li> </ul> <p><strong>Soft Skills: </strong></p> <ul> <li>Ability to interact and influence across multiple organizational levels</li> <li>Ability to influence engineering and product directions</li> <li>Ability to interact with business stakeholders, data engineers, and other technology leaders</li> <li>Analytical approach to problem-solving; and leveraging technology to solve business problems</li> <li>Critical thinking with excellent problem-solving skills</li> <li>Excellent verbal, written, and interpersonal communication, good listening and interpretation skills</li> <li>Ability to prioritize projects and keep multiple streams of work on schedule</li> </ul> <p><strong>Preferred skills:</strong></p> <ul> <li>Business understanding and experience with common use cases across different industries (customer 360, fraud detection, cross-sell up-sell, etc.)</li> <li>Ability to design workflows and diagnose and solve issues around data quality, privacy &amp; management</li> <li>Experience in cloud-native/container architectures, deployments</li> <li>Experience in DataOps and/or DevOps</li> <li>Knowledge and experience in Kubernetes and containerization technologies such as with RedHat OpenShift</li> <li>Experience with one or more leading cloud platforms like IBM Cloud, Amazon Web Services, Azure and Google Cloud</li> <li>Extensive experience with enterprise data architecture for transactional systems, analytical platforms, master data management, data governance framework, data integration and large-scale data migration</li> <li>Experience and/or knowledge in several of the following technology areas: Scala, Spark, Python, Bash, Java, Kubernetes, SQL, Kafka</li> <li>Experience in data privacy and regulatory compliance and familiarity with industry and government regulations</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"DataOps"},{"name":"Watson"},{"name":"Data integration"},{"name":"Data management"},{"name":"POC"},{"name":"Cloud Pak"},{"name":"Consulting"},{"name":"Sales Engineering"},{"name":"Presales"},{"name":"Kappa"},{"name":"ML/AI"},{"name":"Data warehouse"},{"name":"R"},{"name":"Python"},{"name":"Java"},{"name":"SCALA"},{"name":"Spark"},{"name":"Kafka"},{"name":"NiFi"},{"name":"Airflow"},{"name":"SQL"},{"name":"ORACLE"},{"name":"MS SQL"},{"name":"DB2"},{"name":"Teradata"},{"name":"PostgreSQL"},{"name":"GreenPlum"},{"name":"Hadoop"},{"name":"SAP"},{"name":"Kubernetes"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.225","name":"Продажи","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5274","name":"ИБМ Восточная Европа/Азия - IBM EE/A","url":"https://api.hh.ru/employers/5274?host=hh.ru","alternate_url":"https://hh.ru/employer/5274","logo_urls":{"90":"https://hhcdn.ru/employer-logo/310505.png","240":"https://hhcdn.ru/employer-logo/383362.png","original":"https://hhcdn.ru/employer-logo-original/231166.gif"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5274&host=hh.ru","trusted":true},"published_at":"2021-11-22T12:55:09+0300","created_at":"2021-11-22T12:55:09+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=49832790","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/49832790","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}